{"review_id":"GJZhNtDAGqHllrKT19R0GQ","user_id":"c8IXI-4nQjMIXIkrYKTWGA","business_id":"izSgTrqebu8bN8ONOCs6cQ","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"Best bread ever ! A must if you are visiting and looking for some local treats. My favorite is the date\/ almond. Staff is super friendly too","date":"2018-05-09 04:40:30"}
{"review_id":"30MKOx5AWvx898ko3ibaNw","user_id":"3C_JW08Cc14Wuz6F5ugllg","business_id":"izSgTrqebu8bN8ONOCs6cQ","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"Oat Bakery is in a new location (the old Hana Kitchen at 5 West Haley) and is currently open to the public only 3-1\/2 hours per week: 4:00 to 7:30 pm on Tuesday only (downtown Farmers Market day) (as of October 2017). It is run by a Danish lady. Beautifully rustic tasty round loaves, both regular and gluten-free.","date":"2017-10-04 03:32:02"}
{"review_id":"6BWnygfUQcbCJtYi8tooQA","user_id":"nXV-ovnDPaLDEiom-5og0Q","business_id":"izSgTrqebu8bN8ONOCs6cQ","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"Absolutely delicious. Their spreads are amazing. The perfect snack or addition to a charcuterie plate. The bread is so good!","date":"2018-02-25 22:31:03"}
{"review_id":"F0qabvjxhHUhkxRRpUps3Q","user_id":"5yvkcEmtCTeD2S9qdZiLLg","business_id":"izSgTrqebu8bN8ONOCs6cQ","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"Early congrats to Oat Bakery, 1 year anniversary! We are looking forward to celebrating the upcoming year with you!! - Miki and Gavino (from Ojai)","date":"2018-08-16 05:48:49"}
{"review_id":"r_GnflwQ4MBBlqN3mULKnA","user_id":"YcgH7TqJHfF1V-uump8gng","business_id":"izSgTrqebu8bN8ONOCs6cQ","stars":5.0,"useful":1,"funny":0,"cool":0,"text":"Oat Bakery is amazing!  I had had there bread before they opened the store front, and was so pleased to see this place now!!  \nIt is super tasty, and doesn't leave me feeling bloated and bad like other breads.  There spreads are also amazing!! They service at this location is great!  Very friendly owners. Im a fan!","date":"2018-09-01 15:38:43"}
{"review_id":"DCPtD_ZnT1rYo6h_mXVhSQ","user_id":"vrIg5xF0fcixjf8Zry96qw","business_id":"izSgTrqebu8bN8ONOCs6cQ","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"THE BEST gluten free and Paleo bread in Santa Barbara!  Thank you thank you for providing such delicious, healthy, organic food to our community.  I am a customer for life and highly recommend!","date":"2018-03-14 21:23:03"}
{"review_id":"BMRuf64tlAv6bZteggN9Ig","user_id":"J7Lcd-G4Un31s3iqtO4CGA","business_id":"izSgTrqebu8bN8ONOCs6cQ","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"5 stars from me too and that's rare. Oat Bakery is a lovely, much-needed surprise here in SB. The bread is fresh with (what I believe are) fresh ingredients and made from competent hands. And it's delicious!\nThe tastings are generous and they clearly separate the gluten-free bread from the rest. They also slice the loaves for you which I really appreciate so I can freeze some if needed. Oat also makes yummy spreads which are reasonably priced at $5 and they last for about 3 days. I hear Tuesdays are the best day for fresh bread but it's also Farmer's Market day so beware traffic. I'll go back for sure.","date":"2018-06-05 01:28:25"}
{"review_id":"3muVqT6Cuby8a1Msus5klw","user_id":"_X84ll6Gd4jumVd3aXCTXg","business_id":"izSgTrqebu8bN8ONOCs6cQ","stars":5.0,"useful":1,"funny":0,"cool":0,"text":"I love this little bakery. They do sell out quickly so come early if you want your pick of everything. I typically try to avoid gluten and they have some really great GF options, but when it comes to this place I don't even care, all bets are off I'm eating gluten because I can't deprive myself of this level of deliciousness! My boyfriend and I will get some marrow bones from the farmers market and roast it on the shiitake garlic and it's literally to die for.","date":"2018-08-01 19:53:36"}
{"review_id":"kMZpU3NHix1uxk32phAM2g","user_id":"UDKUb0bPeURzLce_lKzA5A","business_id":"izSgTrqebu8bN8ONOCs6cQ","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"Yummy!\nJust came from Farmer's Market & yelped to find the closest bakery!\nIt was totally a lark we landed there & the bread\nWas so unique!\nThey had many flavors and ones you've never heard\nOf!\nLots of samples to try...\nKnow I'll be back to get some as presents from our\nTrip!\nI purchased a spirulina pumpkin seed etc & can't wait to have some!","date":"2018-01-03 00:21:43"}
{"review_id":"gNpCJgWeGBBXfYGy2WtSdg","user_id":"iwr1qvQYCXNA8a1jZSd1ZQ","business_id":"izSgTrqebu8bN8ONOCs6cQ","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"Love oat bakery. They produce bread the way it should taste! Super fresh and doughy. Love all the grains and superfoods they add.  Friendly, helpful staff and wonderful, lovely, local owners.","date":"2018-11-29 00:19:13"}
{"review_id":"uOYDKLJV8CB1w7VjQwInDA","user_id":"g8qiB5kEpy-MMPHJK0alLQ","business_id":"izSgTrqebu8bN8ONOCs6cQ","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"I've never had bread so tasty that's still so healthy for you. It's great with cheese, jams, butter, pesto...the list goes on. I've had several different kinds-- can't pick a favorite-- cause they all are so good!! I like to keep a few in the freezer, thaw it in the oven and it's ready to go for any occasion.","date":"2017-02-12 17:31:47"}
{"review_id":"Gevu9hLR5WBznvtjE6Q16Q","user_id":"bjl8fmY6H5e_Rl2ZbfA5VA","business_id":"izSgTrqebu8bN8ONOCs6cQ","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"The most amazing homemade breads from the most darling and gracious owner. Always fresh,  delicious, and nutritious! I've never felt so guilt free about eating bread before! Perfect for spreads, sandwiches, or toasted. And they have gluten free options, that are equally delicious. Honestly, can't say enough about OAT, check them out if you haven't already.","date":"2017-04-10 20:20:59"}
{"review_id":"1PKmfRF_u1jYDoX_SCKu3g","user_id":"R-4Fl6H8VISTHTimPHqNGw","business_id":"izSgTrqebu8bN8ONOCs6cQ","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"As a gluten free eater it's very hard if not impossible to find home made bread that tastes like bread.  It's the thing I missed most...until now.  Lou and Louise are magicians.  I don't know how they do it.  Every gluten free offering is the real thing.  Toasted, natural, on their own or with cheese,humus you name it.  I close my eyes and it's like bread heaven.  Run to their bakery on Haley.  You won't be disappointed.  You will be fulfilled.  Simply wonderfully amazingly...great bread!","date":"2018-05-17 03:12:21"}
{"review_id":"JaB-CAUZgkrNtjqDZffN0w","user_id":"JP5-pf-9TXYmVBrVKFbG-w","business_id":"izSgTrqebu8bN8ONOCs6cQ","stars":5.0,"useful":1,"funny":0,"cool":0,"text":"Tasted a loaf of their bread at the Summer Solstice parade, oh boy a new bakery is in town!","date":"2018-06-27 13:47:19"}
{"review_id":"4-3FYnYaVr97GkU2xDr_aA","user_id":"W9vf-llXNwRtCIFu1oSMJg","business_id":"izSgTrqebu8bN8ONOCs6cQ","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"Unique combinations, chewy, flavorful... definitely one of the best breads I've had in a long time! Also their granola is perfectly balanced... watch out and before you know it you've eaten the whole bag on the drive home...","date":"2019-05-25 18:55:32"}
{"review_id":"Ibc3qJSktZUD436QfGI1sA","user_id":"0IiyzoZOGHbnum_XGnPlcQ","business_id":"izSgTrqebu8bN8ONOCs6cQ","stars":5.0,"useful":1,"funny":0,"cool":0,"text":"The loaves here are creative and amazing! We were spending the weekend doing wine tasting in Santa Barbara and found this bakery. You can smell it when walking down the street. \n\nI got the superfood grain, the almond\/date, and the cranberry\/brie bread.  These breads are what I have been looking for filling, full of flavor, and fresh ingredients. They are some of the best breads that I have ever had and glad to have found this place. Only thing is Santa Barbara is a long drive from where we reside so it will be a treat when we are in that area again. \n\nThe staff are friendly and helpful.","date":"2018-10-21 04:18:46"}
{"review_id":"ivzTyou-Qf47zZk79Zl2GA","user_id":"FMq5QuanH19IHkPLKlZbDA","business_id":"izSgTrqebu8bN8ONOCs6cQ","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"Friendly staff, doughy delicious bread! Sage garlic loaf melts in your mouth, great toasted with butter, seeded log pairs well with avo!","date":"2019-06-12 05:23:13"}
{"review_id":"2pMswmifJk_VIj43x-xTYg","user_id":"QtJf4ofxKHNRwORcJV7ZCQ","business_id":"izSgTrqebu8bN8ONOCs6cQ","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"I love all their bread and especially the hygge buns. I come back every week for them. We love the charcoal sesame bread and also get it almost every week. Last week the loaf did not came out as our liking and they exchange it for us and were very nice and kind about it. I love this place and to encourage local Santa Barbara entrepreneurs.\nThank you again for your delicious organic breads!","date":"2019-06-03 17:39:44"}
{"review_id":"jTZc05UVrjpg1HzQETR-OQ","user_id":"uGw-8ZqxLEitR7990kHbqw","business_id":"izSgTrqebu8bN8ONOCs6cQ","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"The bread at Oat Bakery was delicious, filling, and super healthy! We bought some of the super seed bread home for our daughter, who has gluten issues. She was able to eat yummy bread without feeling sick. We also purchased two other loaves that were flavorful and filling! This will be an added stop on our future travels. Great staff!","date":"2018-12-02 01:10:11"}
{"review_id":"mX521VdI0z-Gjacud_uy-Q","user_id":"b5QOo3qnuIeoilaVf4Y28w","business_id":"izSgTrqebu8bN8ONOCs6cQ","stars":5.0,"useful":1,"funny":0,"cool":1,"text":"Delicious focaccia. Hygge bread was sweet anD warm.... tasted kinda like a cinnamon bun. Shiitake shallot bread perfectly warm, subtle delicious flavors. This place is  small, charming, and sometimes aa line out the door. Go in the morning","date":"2020-02-01 18:41:23"}
{"review_id":"eZQ330pG6oEYgFqpX8h82A","user_id":"50X0JEVSFnvAA8bFv4Yu5Q","business_id":"izSgTrqebu8bN8ONOCs6cQ","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"Found this little gem while staying at the Holiday Inn. The quality of the bread is superb! I wish they had more places like this in Los Angeles. I want\/need more! Everything from the loaf to the spread, it'll bring heaven to your taste buds!","date":"2019-02-25 21:15:19"}
{"review_id":"OAa17QhWugFhiS9kKNirwA","user_id":"v60bF7pUIUCt9ERomryufA","business_id":"izSgTrqebu8bN8ONOCs6cQ","stars":5.0,"useful":3,"funny":1,"cool":1,"text":"Most AMAZING bread ever!!!! And DO NOT MISS their incredible vegan Truffle Cream Cheese... MIND BLOWING!!! So grateful for this amazing local business and their incredible bread and spreads. I utilize them for events and parties and family get togethers. THANK YOU OAT BAKERY!!!","date":"2019-02-07 19:46:18"}
{"review_id":"PS7UA-iDISdlgG4KRsK5mw","user_id":"UbhKUp5AQlUofUG5lCLHUQ","business_id":"izSgTrqebu8bN8ONOCs6cQ","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"We are a Kiwi family currently travelling around California. Jan Dunbar introduced us to your most fabulous super seed bread and bakery in Santa Barbara! We have never tasted bread like this before! Maybe we've never tasted bread how it is truly meant to be! Just like yours! If bread was made like this everywhere the world would be a happier and healthier place! Please come to New Zealand! Kiwis would love you guys!!!","date":"2018-11-28 22:22:24"}
{"review_id":"XQiso8swLoGOcH95ZrTsHw","user_id":"Ry34ggRfZ0cktmcLE0xUMQ","business_id":"izSgTrqebu8bN8ONOCs6cQ","stars":4.0,"useful":0,"funny":0,"cool":0,"text":"Very good gluten-free loaves. My whole family tried three varieties and we loved them all. Toasted or pan fried with a little butter or dipped in olive oil is good since they are just slightly dry but good for a gf bread. I just wish they didn't put rice flour as a base. We don't eat a lot of carbs and try to stay away from grains so this was a splurge. I'd like to see some interesting, ancient flours that are Lowe in carbs and more nutritious than rice or whatever other base they use (I can't remember but I asked).\n\nThey were so friendly and answered all our questions and patient as we took a while to decide what to get.","date":"2019-07-28 21:04:04"}
{"review_id":"bWB1W8EI1oHLrA9bXOFcFA","user_id":"GhRzwj6gIXGcj4QO8EJkaw","business_id":"izSgTrqebu8bN8ONOCs6cQ","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"Almond date bread is out of this world. Just tore chunks off when it was fresh during my road trip, then the next day I sliced it and toasted it with some coconut oil. Wow! I'll definitely be swinging by again next time I roll through SB!","date":"2019-06-23 23:14:54"}
{"review_id":"hw9S2GFdRCD2MIqiq6NgPg","user_id":"-4tp0tmjnrJeWq5EG-9ZHA","business_id":"izSgTrqebu8bN8ONOCs6cQ","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"Best bread I have ever had in Santa Barbara (or anywhere for that matter). Always freshly baked...I find it hard to make it home with an intact loaf. My personal favorites are the Sage\/Garlic and the Date\/Almond. Even if you are not a \"bread person\" (whatever that means) drop by and try out one of their phenomenal spreads. The beet hummus is unique and delicious! Very personable staff who help to make the experience 100% -- thanks Oat Bakery!!","date":"2018-05-09 04:34:51"}
{"review_id":"EGDfbz4MoVRQxn8jTm-6Sw","user_id":"BC0Iswye8Ian616MCvNtUQ","business_id":"izSgTrqebu8bN8ONOCs6cQ","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"Run down early in your pyjamas worthy! \nI am not a 'bread person' because too often bread is waste of space for more delicious treats in life, but only because cheap bread is not real bread! No carb or calorie is wasted here! Every fresh healthy bite should be savored and enjoyed! Oat Bakery is what I wish all bread could at least aspire to. That soul cuddling, crisped pocket of fluffy flavour! I got the Danish Rye and it was simply superb! If you are not a 'bread person' please rediscover this divine food here!! I also grabbed the sage and garlic bun and in my excitement, gobbled it with my neighbour while it was hot, before I got home. Thanks!!!","date":"2018-05-30 17:47:34"}
{"review_id":"Ot_EVb874alwHkMff6uvnA","user_id":"OVdGMJZrlnxgAyO3HV-HWg","business_id":"izSgTrqebu8bN8ONOCs6cQ","stars":5.0,"useful":1,"funny":0,"cool":0,"text":"Amazing Bread! Saw them at farmer market in Ojai, tried the almond Date bread, delicious! Then the superfood bread... Beyond Amazing! \nCan not wait to get more!","date":"2019-07-15 05:02:52"}
{"review_id":"QLFbd27o379J2SOumpmL9A","user_id":"0v5mKoDCNc5drd8hzpm5-A","business_id":"izSgTrqebu8bN8ONOCs6cQ","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"One of my favorite things to do is go to the farmers market on Saturdays and then stop at OAT for fresh bread and one of their amazing spreads. They let you sample different things so you can figure out exactly what you want. I think everything I've tried from oat is amazing! The staff are all super friendly and helpful as well :)","date":"2018-05-09 05:41:37"}
{"review_id":"rb6U_S62kQjGvSF2cDPQYQ","user_id":"_VcXcsgNpvm41g0CN8XlKA","business_id":"izSgTrqebu8bN8ONOCs6cQ","stars":2.0,"useful":0,"funny":1,"cool":0,"text":"They get two stars for creativity only. Some unusual combinations work, some not so much. Beyond that--$10 for a loaf of bread or $6 for a sweet roll? Ok for an occasional splurge, if fabulous, but they weren't. And the packaging was horrible. Putting a sweet roll and onion heavy focaccia slice loose in the same paper bag was not a good combination. By the time I got home both bags of food had big greasy stains on them. There are better options out there.\n\nIn regard to the owner's response--you missed the point. I don't mind the prices as long as the products are home runs. Not all of them are. Also, the careless packaging shouldn't require me to pick onion chunks off the sweet roll from a grease stained paper bag aka McDonald's.","date":"2019-05-13 19:51:45"}
{"review_id":"51wdrlt_OJcIcspefb-ppA","user_id":"-9k2d74SV_x-eRgPkhdNOA","business_id":"izSgTrqebu8bN8ONOCs6cQ","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"Most delicious bread and limited pastries in SB! So so good, fresh, handmade, creative, etc. couldn't ask for more. They make you want to finish them all before you even make it home!","date":"2019-06-28 16:08:32"}
{"review_id":"L_-bGr-tJhBCAkaF34DO6g","user_id":"reqFTQd4-nsxl88U5oEXCA","business_id":"izSgTrqebu8bN8ONOCs6cQ","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"Some friends and I ordered a charcuterie board at Lab Social, and the second I bit into the bread I swear my eyes must have doubled in size. I couldn't even bring myself to put any of the other things on the board onto it, it was so good. I immediately found out where they'd gotten it from and was stoked to hear that it was a local bakery and I COULD BUY MORE. The first chance I got I went in and bought a bun, and let me tell you, the second tasting did not disappoint in the least. My personal favorite is for sure the pumpkin seed bun. Holy wow, the texture is incredible, the taste is out of this world, and then you bite into a nut and get that nice crunch and another burst of flavor. It's actually ridiculous. The sage garlic loaf is also good but be warned, the garlic is intense. I got some different loaves for appetizers for a party and everyone agreed it was amazing. It's perfect for a cheese board or to eat as a side with a meal. You could probably make sandwiches out of it and it'd be amazing but honestly I don't think I can ever get myself to eat it with anything but maybe a little butter because I don't want anything to distract from the taste. Please go buy this bread. It will change your life. That is all.","date":"2020-03-28 00:16:09"}
{"review_id":"6bV5XZm_5fRqCQ457YJcLw","user_id":"DiQOeMXjqxe6M1s0tQu7aw","business_id":"izSgTrqebu8bN8ONOCs6cQ","stars":5.0,"useful":0,"funny":1,"cool":0,"text":"Holy moly, this is hands down the best bread I've ever tasted. I don't even eat it with anything. I can't even make it the car ride home without straight taking bites from the loaf like a savage. Honestly, I think I can survive of just eating this bread for the rest of my life. \nI will never be able to  buy bread from anywhere else again.","date":"2017-12-07 00:21:45"}
{"review_id":"5x1bNrJKHCCvNaDBi8Gqrg","user_id":"7GRGnL2yUEXjcO9mQOU0qg","business_id":"izSgTrqebu8bN8ONOCs6cQ","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"Delicious! Beautiful artisan bread. This is the real deal- everything has it's own unique flavor executed exceptionally. Their Hygge bun was phenomenal! (Wish I had snapped a photo) and the shallot shiitake bread was delicate but hearty. Lastly, we had the superseed cookie which was gluten free and vegan- very tasty! (But if you can eat gluten I'd go for the hygge!)","date":"2020-02-15 18:06:15"}
{"review_id":"Y375i8NT_aFJ4OusDHUZZg","user_id":"KAQptU6B0ouRFFO10Y3owA","business_id":"izSgTrqebu8bN8ONOCs6cQ","stars":5.0,"useful":1,"funny":0,"cool":0,"text":"The best bread ever! Yum!!!\nSo many creative choices with gluten free options too.  Their vegan cream cheese and pesto spreads are delicious too!!!\nThey always have samples of the breads so you can try new types. This is a weekly stop for our family after the Farmers Market!","date":"2018-11-08 17:31:47"}
{"review_id":"Oa81WJERrPHKnT6GB2JbxA","user_id":"2u-nKBo6fh8YUmRG6Ydo6g","business_id":"izSgTrqebu8bN8ONOCs6cQ","stars":5.0,"useful":2,"funny":0,"cool":0,"text":"An absolute gem in Santa Barbara!!\n\nOat Bakery makes Scandinavian bread made from the best seasonal, local and organic superfood ingredients.\n\nWe tried a couple of the loaves and was blown away by the flavor of The Shiitake Shallot. It's made with: organic oats, organic unbleached wheat flour, organic shiitake mushrooms, organic shallots, flax seeds and organic chia seeds.\n\nThe spreads here were very enjoyable as well! Both the Vegan Truffle Cashew Cream Cheese & Cilantro Walnut Pesto paired very well with the breads! \n\nDelicious * Organic * Gluten-free options * Vegan\n\nHighly recommend checking them out when in Santa Barbara :)","date":"2021-02-10 05:00:15"}
{"review_id":"UHA8HnBGsN-tP4FoHPlRxA","user_id":"ftRtwXjXATZSmEr1VFecIQ","business_id":"izSgTrqebu8bN8ONOCs6cQ","stars":5.0,"useful":6,"funny":1,"cool":5,"text":"If you're looking for local, organic ingredients at prestige quality - I highly suggest this gem.\n\nLouise brings her Scandinavian roots and mother's passed down recipes to Oat Bakery - and you can taste the authenticity.\n\nFamily owned, Louise runs the bakery with her husband Lou. Both of them are usually seen together behind the counter baking away. Local and comfy vibes for sure.\n\nSanta Barbara needs more places like this. Thanks for making my bread dreams come true!\n\nPro tip: They kill the gluten-free bread game, unreal.","date":"2019-11-26 23:36:00"}
{"review_id":"b4mAnTVLa8UxEsRGil3blw","user_id":"2EvNn1In30GFhQRe-0eazQ","business_id":"izSgTrqebu8bN8ONOCs6cQ","stars":4.0,"useful":1,"funny":1,"cool":0,"text":"Dear Oat Bakery,  Thank you for providing one of the only breads that I can eat. I have an allergy to refined sugar that makes it impossible to buy bread in a store.  Your breads are marvelous.  Super moist and amazing.\n\nI also was in awe of the Super Seed Cookie the first time I tried it. Again, can't buy cookies because of the allergy so what a special treat.  However, I will have to say that the cookies have been hit and miss.  Sometimes they simply don't taste good at all!  Way off to the point of throwing it out but when you pay $4.00 for a cookie plus a tip you choke it down anyway.  I talked to a friend about this and she suggested that dates go bad and that was probably why the cookies were sometime not so good.  Also it seems the consistency of recipe for this one seems to be off.  The 1st time I had it the sweetness was amazing and the cinnamon notes were just awesome subsequent purchases were just so, so in this regard.\n\nHoping that you can do something to move your customer line a little faster.  Arriving at 9:08 and having to stand in line for 30 minutes for 1 item is a bit of a bummer.  This is even being number 8 in line.  I would imagine that you are loosing a great deal of business because people just don't want to stand there that long.  Why you started serving coffee I will never understand! This addition only exacerbates the long SLOW line. I wish I had a suggestion how to streamline your process at checkout.  Maybe your brilliant bakers and staff can come up with a solution.  Seems like you might need a second window or a larger facility. Not a bad problem to have.  :-)\n\nMaybe ask the customer if they are having coffee 1st thing when they walk up.  Call out to someone else to make the coffee while the nice young woman at the front continues with the bread order. \n\nThanks again!","date":"2021-03-13 18:22:17"}
{"review_id":"PAXlWhDQCt-IyHpBBXBB9Q","user_id":"KXQ2Jb2mHrnex95aW2oOIw","business_id":"izSgTrqebu8bN8ONOCs6cQ","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"If you want the most exquisite bread in town, look no further. Louise brings her traditional Danish family recipes and adds a new age splash with local ingredients that make for a combination of flavors that are both exciting and healthy!\n\nThe shop has an incredible chic family vibe to it, their crews energy is exceptionally positive - always an adventure going to their cute local shop.\n\nShoutout to both the owners, Louise & Lou, for always making their customers feel like family!","date":"2020-06-30 16:26:58"}
{"review_id":"BuSdbZ2lqMuVInaGykRQcA","user_id":"61yERKmEa_0mkZYy_3PNAg","business_id":"izSgTrqebu8bN8ONOCs6cQ","stars":4.0,"useful":8,"funny":6,"cool":5,"text":"Wow Oat Bakery has the best superfood bread I've ever had! They do sell out quick so make sure to come early in the day if you want to have many different choices to choose from. They have GF, Vegan, and many more choices. I've had many different kinds of their bread and they have all been delicious. I've had the superfood grain, the almond\/date, the GF sourdough, and the focaccia. Every single one of their breads has been delicious so far and I can't wait to try more! \n\nThey even have amazing spreads to go with their breads. I've had the pesto and the truffle cream cheese. Both of these spreads have been incredible! Everytime I come here I tend to eat the bread right away and never save it since it's so good. I'm excited to try the new breads and spreads soon!\n\nOat Bakery is the such an amazing local bakery in town that you don't want to miss! Check them out if your looking for a perfect bread for everyone. They have so many choices which make it the perfect place to please everyone's bread cravings.\n\nI highly recommend giving this bakery a try! I'll be back soon Oat Bakery! :)","date":"2018-12-28 01:45:27"}
{"review_id":"a8gPXqwRXCY8T1h-IsAzCw","user_id":"0MOHJcS8ULnS6EadezPn0w","business_id":"izSgTrqebu8bN8ONOCs6cQ","stars":5.0,"useful":0,"funny":0,"cool":1,"text":"Lou and Louise have a charming bakery and they make the best bread in Santa Barbara! Gotta try their sourdough rye and the pesto. To die for!","date":"2017-11-02 19:33:21"}
{"review_id":"V0LkeQB5idM8iFmq-Z9rtg","user_id":"nChIh4_Y_oGfcrS71NDJ9g","business_id":"izSgTrqebu8bN8ONOCs6cQ","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"First encountered this young couple when the did a popup at Paseo Nuevo, and now they gave their own place. Breads are absolutely delicious and best of all, for my gluten free husband, they have a yummy selection of gluten free breads as well.","date":"2018-04-28 18:35:55"}
{"review_id":"6ZDdQxp60gMcwiL60q5ofg","user_id":"E9mRuh1r_gLY3IAo9khlnA","business_id":"izSgTrqebu8bN8ONOCs6cQ","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"The bread is amazing! The gluten free bread is delicious and made daily (my favorite is the sage garlic). For those that are able to have regular brEad there are more options- you can't wrong with what you chose (or so my gluten-eating partner says). The line gets longer the later in the morning it gets but it moves quickly and it's so worth it!","date":"2020-02-01 16:32:35"}
{"review_id":"hW4CIxbI-niNG5BNDkOhNw","user_id":"Qb2pHfVG8tctw8EeBOdWwA","business_id":"izSgTrqebu8bN8ONOCs6cQ","stars":2.0,"useful":2,"funny":0,"cool":0,"text":"It's ok. The bread is unremarkable given that it's $8+ per piece. The texture is ok. The staff seems willing to help. But overall just another unremarkable SB bakery. The bread just about anyplace is equivalent. Nothing amazing.","date":"2019-02-27 23:46:19"}
{"review_id":"tBzsuIzYlWCsUl4BT2Kf9A","user_id":"3QxQhMZ83UdHPzkJNUBYZA","business_id":"izSgTrqebu8bN8ONOCs6cQ","stars":5.0,"useful":2,"funny":0,"cool":0,"text":"This is the best bread I have ever tried in my life! As a type 1 diabetic who has to watch sugar and carb intake, the super seed bread is heaven sent! It is fresh, dense, nutritious, and sooo good. I am moving to San Diego at the end of the week and don't know what I am going to do without easy access to this bread! \nI brought my mom (who is also type 1) who is from Florida, and she got the garlic spread, the cilantro walnut pesto, and the super seed bread and said it was the best bread she has ever had. \nI was even making some at work, and let my coworkers try some, and they were blown away by the bread and pesto. \nIf you're looking to enjoy bread again, and not just getting the store bought processed bread, then do yourself a favor and go here! You won't regret it :)","date":"2019-06-25 16:53:43"}
{"review_id":"qCEAGgVs8H3v9LwZuU7qzw","user_id":"yKPn8ZSVSwQcgjE8AZYbeQ","business_id":"izSgTrqebu8bN8ONOCs6cQ","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"Stopped here and got some supersede bread and grabbed a few superseded cookies, amazing cookies! Healthy and not overly sweet! Loved them! Clean healthy ingredients, will be back for sure.","date":"2020-06-07 05:49:21"}
{"review_id":"2wBp6R6C_wffHpI0oZmRbg","user_id":"_28irUrSMX0QJJLd4OBL5A","business_id":"izSgTrqebu8bN8ONOCs6cQ","stars":5.0,"useful":0,"funny":0,"cool":1,"text":"I've been gluten free for over 10 years and this is my FAVORITE place to get bread. The fact that it's local AND affordable is just the cherry on top. I highly recommend!","date":"2020-07-03 05:00:06"}
{"review_id":"Gz5ZSEbTTSKomaZWgHEw5A","user_id":"mh6D0jZxX0-puCIzqlyfkQ","business_id":"izSgTrqebu8bN8ONOCs6cQ","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"Yummy bread and good selection of gluten free options. Super cute little storefront and helpful staff too! Looking forward to returning","date":"2021-03-31 22:04:11"}
{"review_id":"4GM-LtS0vrlC18O0FUMR8A","user_id":"Rlg-BYA9wLLX9iOsJO1zqQ","business_id":"izSgTrqebu8bN8ONOCs6cQ","stars":4.0,"useful":0,"funny":0,"cool":0,"text":"Super long wait for the bread here. \n\nWas the bread good? Yes. The best was the shiitake shallot, hands down. Really dense and freshly baked. It was a lump of deliciousness. 5\/5. Would highly recommend this one. \n\nAlso got an apple danish(4.25\/5), sourdough loaf (4\/5) and the cinnamon roll (3\/5). \n\nThe apple danish was tasty and well crafted. Pretty to look at.\n\nSourdough loaf was standard. Tasty. \n\nCinnamon roll was disappointing. The many reviews raving about this one might have made my hopes high. Was dense and the flavor was lacking. It did taste kinda \"healthy\" though.","date":"2021-02-21 22:18:35"}
{"review_id":"UrLKdwgZiGA91fupd3-A7w","user_id":"pvd8arxkQT8B3fwapvMbVQ","business_id":"izSgTrqebu8bN8ONOCs6cQ","stars":5.0,"useful":3,"funny":0,"cool":3,"text":"Amazing bread. Friendly staff. They have GF and Paleo options. Lots of unique flavors.\n\nI purchased half a loaf of bread from them and it was piping hot from the oven. I can't even remember which one it was but it was amazing! Definitely worth a visit.","date":"2018-05-09 02:45:12"}
{"review_id":"D4-eJwIfNYd9ZHK6NIjrcg","user_id":"6PYUhEWVd3V0niS9TQOu4w","business_id":"izSgTrqebu8bN8ONOCs6cQ","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"I absolutely love this bakery ! The breads are so unusual ! In a world where \"artisan\" is the new buzzword, this Baker is a cut above ! The oat seeded gluten-free is my favorite. Whenever I am in Santa Barbara I always pick up a giant loaf, it's a brick of goodness. A meal in itself. I portion it out to make it last as long as possible. Thank you guys.","date":"2019-09-22 14:25:38"}
{"review_id":"FDvDKozFQ8oxTRO9UX7Lcw","user_id":"WqfOxM5VCH3qyQeKteXtcA","business_id":"izSgTrqebu8bN8ONOCs6cQ","stars":5.0,"useful":0,"funny":0,"cool":3,"text":"We love this online bakery and could not have been happier we found it! With a baby at home we tend to look for quick and easy meals to make. We get a bulk order of this bread and freeze it. We plop one frozen bun into the toaster oven (so easy!) to have with our dinner and it comes out just as soft and flavorful. It is not your typical bread - it tastes delicious and healthy at the same time. The bread is packed with healthy organic ingredients!! I swear it helped increase my milk supply as well - WIN WIN for all you new mothers out there. Oat Bakery is just what SB needs!","date":"2017-02-12 17:43:04"}
{"review_id":"500nhaiBEeMrBWGFO0zD2g","user_id":"_yB6wENtqd_fMHSRBfAbAQ","business_id":"izSgTrqebu8bN8ONOCs6cQ","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"Totally worth the line any day of the week. Their GF crackers and vegan truffle cream cheese are must grabs for any picnics","date":"2021-02-20 22:56:19"}
{"review_id":"FCQIUVYTxqg_cVSw77yZkw","user_id":"kKw3VoHhtC3TvgnMW3pViQ","business_id":"izSgTrqebu8bN8ONOCs6cQ","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"organic and full of heart for all things good \ni've nearly tasted every single thing \nand i recommend them all!\nwe stock up every time we come into town\nfrom corona, ca","date":"2020-07-07 00:43:40"}
{"review_id":"kekU4dvEXZA8CLQY0qF-oQ","user_id":"8PYCXZmJv7u_CWyPfKFP8g","business_id":"izSgTrqebu8bN8ONOCs6cQ","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"This is a very special bakery in Santa Barbara with the best bread! I love my weekly trips to Oat Bakery. The Almond and Date bread is perfect with cheese. The pumpkin seed bread is the current favorite with the cilantro pesto. The cilantro pesto is a must!!!","date":"2021-02-22 19:55:41"}
{"review_id":"a5Sihfifp-hwLKEEBkg1Rw","user_id":"aEqK6LmaVVUwj6ueig8RIA","business_id":"izSgTrqebu8bN8ONOCs6cQ","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"Super yummy gluten free bread!! I was in Santa Barbara on vacation and got some on a whim while biking downtown. Really great bread and super kind service!","date":"2020-09-13 19:58:57"}
{"review_id":"taf40nhWPn5Py67LAfYeFg","user_id":"y1aSYZwYkSBX3afwJ0HZoA","business_id":"izSgTrqebu8bN8ONOCs6cQ","stars":5.0,"useful":1,"funny":0,"cool":1,"text":"LOVE this spot and the team that runs it, not to mention their breads and spreads. We got lucky on Saturday morning and arrived just as the hot foccacia came out of the oven. It was insanely good, especially with their plant-based cheese and pesto. Such a good vibe in the space -- totally possible to have a meal there -- and love how they fold the seasons into their breads. Local, seasonal, GF, plant-based, and DELICIOUS. Huge fan and supporter.","date":"2018-07-20 21:24:56"}
{"review_id":"KPnj8N16a71S5w92aoGz9w","user_id":"5ptszPl42JMET8BoLBebSw","business_id":"izSgTrqebu8bN8ONOCs6cQ","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"Fresh, delicious bread. I tried the date almond, garlic sage, and a hygge - not all at the same time :-).All were delicious alone, so didn't need to try the spreads, but they looked good. Someday maybe. Anyway - they sell out, so get there early.","date":"2019-10-26 19:50:19"}
{"review_id":"kjvV60xi97GvOilinJ5pPQ","user_id":"xdO093T71O_kgaeO9YIfCg","business_id":"izSgTrqebu8bN8ONOCs6cQ","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"I was sooo happy to find this bakery in Santa Barbara!  I bought 3 kinds of breads and 1 cracker and they were all sooo good!  Shiitake and shallot bread is savory and has lots of flavors.  My kid's fav is focaccia.  I was surprised to see lots of whole almonds hidden in a dates & almonds bread!  The cracker was super crunchy and we couldn't stop munching them.  We'll definitely go back and try different breads next time.","date":"2021-04-01 23:05:43"}
{"review_id":"DoGlhQMxmEM8Bk6X-20Qrg","user_id":"x7CGazGfox5noT2zvmWzUg","business_id":"izSgTrqebu8bN8ONOCs6cQ","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"The best! The Vegas cinnamon rolls are to die for! And the oat cookies are a meal. The bread is amazing too. This is such a cute little bakery with a bunch friendly girls working, I love it. The rolls sell out early so get there quick. I love it!","date":"2021-09-08 02:49:26"}
{"review_id":"rzzivtSEEYokBODJEFSGRA","user_id":"2auWtKkDG_i5JCctQ44oug","business_id":"izSgTrqebu8bN8ONOCs6cQ","stars":5.0,"useful":7,"funny":6,"cool":8,"text":"I'm not into bakeries as most just throw together flour water and butter and shape into different forms calling themselves bakeries.  Well one day I was in a juice shop in town and ordered Avo toast which came on a bread that came from this bakery and ever since I'm a converted bakeriette if such a thing exists.\n\nIn the old days you could walk in this place almost empty and smell all of the wonderful breads stacked up next to each other to throw your nostril at. But now that's all changed, you know  like the toilet paper and soap thing in 2020 -- so even if I try my best to show up at 9 am I'm looking at lines of people eating to get some of their goodies. Like a 20-30 minute wait on a Saturday morning. \n\nSo all this writing talk but what the deal with why this bread is so good.  First off it's made freshly every day and they are not afraid to use a lot of of whole grains and gluten free flours so that anyone can find something interesting.  Most are vegan too except for a few that have cheese. \n\nMy favorites here are the superseed. That bread lasts for weeks as it's so dense. Great triple  toasted  with nut butter on top GF. They are gluten free they also make a superseed cookie that is pretty phenomenal too.  I also like their sage garlic in either gluten free or regular, the shiitake shallot.  I'm more on the savory spectrum but if you like more sweeter option they have those too. Heck they even have a charcoal bread for those needing a bit of a detox;)\n\nPrices are crazy high here I see people throwing out $100 bills without a hitch.  I suck it up and throw out the CC and then they will ask you what kind of tip if any you would like to give to the bakers of course not the servers.  Bravo to the bakers.  \n\nDon't mess around folks. Get here early, be patient,  bring the wallet and when you are at home biting into your sliced triple toasted slice of bread you will realize that the smile it gave you was worth every dollar. Thanks","date":"2021-02-27 16:26:39"}
{"review_id":"RUu3uXVQana48Hp6eE2JiA","user_id":"m8BPrTGDcYAwKo0qbQGtKQ","business_id":"izSgTrqebu8bN8ONOCs6cQ","stars":5.0,"useful":2,"funny":0,"cool":0,"text":"i was walking down to the sb pier the other day and decided to stop by oat bakery for grabbing a lil beachside snack along the way. i ordered a loaf of the gluten free seeded bread, put some hummus spread on it, and it just melted in my mouth :') !! i normally don't eat a lot of heavy carbs, but i ended up eating the ENTIRE loaf in a sitting LOL\n\noat bakery's bread is so well-priced for its high-quality, i will definitely come back here for those carb cheat days!!","date":"2019-07-19 01:55:15"}
{"review_id":"LUPSQcNWJ2kNPvVQx6SsKw","user_id":"sQsKB6t58gwOBSvnnT0-gw","business_id":"izSgTrqebu8bN8ONOCs6cQ","stars":5.0,"useful":0,"funny":1,"cool":1,"text":"Today I had the focaccia farmers market special with peaches feta and some other stuff and it was fantastic. I drove out to Costco and finished half of  it before I got there it was soooooooo good.","date":"2021-05-29 22:38:12"}
{"review_id":"ZR481KBg-zr-0vURQGvmFw","user_id":"4AObwp-wnEdr9iohaOxtKA","business_id":"izSgTrqebu8bN8ONOCs6cQ","stars":1.0,"useful":1,"funny":0,"cool":0,"text":"Come on guys start a second line for pick up orders. Every other reputable establishment has a separate line for pick up orders to avoid customer conflict. I saw 3 or 4 arguments about who's first in line. I'll gladly change my review if you add a pick up line. Thanks","date":"2021-01-16 18:01:29"}
{"review_id":"cBqdH4dM8hgAMZTRyEMDaA","user_id":"TJa-tI2-l4IgnrSEKvb3Jw","business_id":"izSgTrqebu8bN8ONOCs6cQ","stars":5.0,"useful":1,"funny":0,"cool":0,"text":"My housemate walks and walks. Up into the mountains, down to the end of the pier, onto the Wilcox Property, back up to Franceschi Park. He's in super shape and loves to eat. He really loves his bread, too. He brought home some bread from Oat Bakery (accidental, happy discovery) and it's some of the best bread EVER. \n\nThe people who served my housemate were happy, nice people. He has been back many times since and recently asked me to go on Yelp and give Oat Bakery a rave review. Here you have it.  Thanks, Oat Bakery, for making such healthy and delicious bread.","date":"2019-02-12 06:00:28"}
{"review_id":"KoNsO-BVQls-xeI7sjdXSw","user_id":"DHB5jLz2R65tBh9Dmu4XvQ","business_id":"izSgTrqebu8bN8ONOCs6cQ","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"Unique and different bakery with gluten-free options. Be prepared for tasty breads loaded with grains and amazing taste.","date":"2020-06-24 04:19:06"}
{"review_id":"kJJLAm2fWfcWXGw8SGVtYA","user_id":"eaUAQZCEdDGbpaYhIYZAgQ","business_id":"izSgTrqebu8bN8ONOCs6cQ","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"This is one place i never miss in Santa Barbara. It's the best I've ever had. I've only tried two things, supersede bread and \"the cookie\", because I'm afraid of getting hooked on more things. \namazing.","date":"2020-09-08 03:02:12"}
{"review_id":"uc0Xeqet5PGzTO6ylJ8rWA","user_id":"l4QZF2pzvjHfS82Bu4Zdvg","business_id":"izSgTrqebu8bN8ONOCs6cQ","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"If you have heard the phrase \"Heaven is just a place on Earth\" with a bit of doubt or misunderstanding, please go visit this place for clarity. Over the last 6 months I've become totally in love with visiting Oat Bakery. The phenomenal staff is incredibly kind and authentically welcoming. You can sense their genuine love for what they create and their appreciation for their customers. Everything here is done artfully. Each item is carefully created. The entire menu boasts flavor, texture, aroma and is also incredibly aesthetically pleasing. I stopped eating store bought bread\/crackers\/pasta 10+ years ago. I always bloated and felt super inflamed, weighed down and even grumpy so I cut out the gluten and never looked back. Until a friend insisted we visit here last November. Despite a lot of reluctance, I caved less than a hour after she bought her goods. The smell was driving me crazy in the best way! Expecting the bloat to hit like a brick, I still kept eating. Almost the entire focaccia loaf! I couldn't stop even despite knowing how I was going to feel. Well guess what! It never happened. Not after eating. Not that night. Not when I woke the next morning. I was shocked! But certainly not mad. Oat is a must at least once a week but ideally 2! Try everything. It's all so good, I promise! You can taste and feel the love in each bite. In our world, There's thrift store clothes and there's Chanel. There's Hyundai's and there's Ferraris. There's store bought bread and there's Oat. There is simply no comparison. If you appreciate craft, luxury, innovation and heart felt energy put into your foods, this is your place. My mom recently went to grab a loaf of bread from Lazy Acres and I bout had a heart attack in the store and insisted we drove downtown if she wanted bread. She said \"there's literally a wall of bread right in front of us.\"  I said \"this is not bread. It just looks like it. You want bread? We're going downtown!\" She was a bit confused by my passion. Then we arrived. All doubts were laid to rest upon just seeing their beautiful display box. I'm telling you, Oat is a a true GEM!! The 6 Star Luxury Resort of Baked Goods. I have so much gratitude for all the women and the 1 gentleman working here. Each visit is as nourishing for the spirit as it is for the gut so treat yo self! I LOVE YOU OAT!! Coming for you today.","date":"2021-05-28 18:12:13"}
{"review_id":"50fRxHW2iLVOmpydCXaK5A","user_id":"ok7tW2Ww5XafmaMaUjwj7g","business_id":"izSgTrqebu8bN8ONOCs6cQ","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"Hands down one of the best bakeries I've ever been to! From their vegan focaccia to their pesto - excellent! It's hard finding a place that makes good product and uses good ingredients. Plus the gluten free options is a plus. I discovered this place through one of my good friends who had raved about it and ever since then I've been telling the town all about it. And if you're lucky and go early enough their sweet buns are INCREDIBLE!","date":"2020-03-18 19:32:59"}
{"review_id":"J0UxAs-0OoN8cl00VjaJTw","user_id":"03GOEL4ePQfofp07De8nFg","business_id":"izSgTrqebu8bN8ONOCs6cQ","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"Love this place! I try a different bread each time and they are all amazing.","date":"2019-09-11 22:09:41"}
{"review_id":"EJqRLewalk1Wa8-BwdDLLQ","user_id":"eS70SW-AwlEICst1r7sMqA","business_id":"izSgTrqebu8bN8ONOCs6cQ","stars":5.0,"useful":1,"funny":1,"cool":1,"text":"Came on Saturday of labor day weekend around 9:30 am to a line of patrons down the sidewalk which took about 25 minutes to get through. There are so many delicious options and hubby and I got an assortment of breads for the weekend. My favorites were the savory hygge (pronounced 'huga') and the garlic sage bread which had a garlic filling inside it. We enjoyed that with the cashew truffle cheese- bonus because it's vegan. We also tried their flax sourdough which was yummy, the sweet huga which wasn't too sweet, and the date almond bread which though sounds like it would be sweet, actually is not. Worth a try if you are in the area and the breads freeze well.","date":"2021-09-25 01:47:58"}
{"review_id":"AUuFtvG_tTh0WOhuHnu29A","user_id":"xZtgjjPu0tpuvjlA36RN8g","business_id":"izSgTrqebu8bN8ONOCs6cQ","stars":5.0,"useful":1,"funny":0,"cool":0,"text":"We stumbled upon this bakery a few months ago when trying to find some tasty bread in town. First off, this team is super sweet. Second the bread they are crafting is absolutely the best around, hands down. On our way back right now and can't wait to try something new. Head to Oat Bakery now, you won't regret it.","date":"2021-07-06 16:25:48"}
{"review_id":"oSM3xMY6ycb7-D1mtqQZmQ","user_id":"cruz7lbFRp8_Ii3XMapxrw","business_id":"izSgTrqebu8bN8ONOCs6cQ","stars":4.0,"useful":0,"funny":0,"cool":0,"text":"Cute bakery with great assortment of bread.  We were hoping they had bagels and vegan cream cheese for our road trip but unfortunately they did not.  We did try the seed cookie which was amazing and very filling. Also loved the cinnamon rolls. \nThey had an assortment of plant based cream cheeses that I would have loved to try. Unfortunately we were passing though and did not want to buy an entire container and large loaf.","date":"2022-01-19 05:59:11"}
{"review_id":"WYB-LzQlbl2IuAhyHiPSFQ","user_id":"kSXZfGw9Lf8ZCu9-s4qunw","business_id":"izSgTrqebu8bN8ONOCs6cQ","stars":3.0,"useful":0,"funny":0,"cool":0,"text":"Liked the savory bun (which in fact was savory-sweet). The sweet bun was too sweet to my taste. Not willing to slice bread, and used COVID as an excuse though that doesn't make any sense.  For the amount payed they should slice the bread.","date":"2020-09-12 21:14:55"}
{"review_id":"mSNeahKoldTKg0bbFd0h2w","user_id":"YVaCDOtlBxfx80Uk8ZsTdg","business_id":"izSgTrqebu8bN8ONOCs6cQ","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"Having lived in Italy for several years, I have been exposed to some of the best breads in the world.  Never did I imagine that extraordinary bread usually only found in Europe is available right here in Santa Barbara at Oat Bakery.  My parents actually found this place by chance as it was close to their hotel when they came to visit several months ago.  The focaccia is so similar to what I used to eat in Italy - I was shocked!  It's extraordinary.  Then there are the vegan cookies that are delicious and the varieties of breads like lemon, olive and cheese that keep you coming back for more.  \n\nI am not being paid to say this, I just love this place that much.  Their bread has now replaced my typical habit of gifting cupcakes when I see family\/friends :)","date":"2020-06-29 23:26:08"}
{"review_id":"BHF55woJNo41iogBi1GY6A","user_id":"-4OFMjSiYAKT1MereIyfNA","business_id":"izSgTrqebu8bN8ONOCs6cQ","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"Found this little gem of a bakery while spending a few days in Santa Barbara. They make wonderfully hearty gluten-free (and regular) bread options.  We enjoyed the GF seed bread, garlic sage loaf, and the \"cookie\" which was packed with nuts, seeds and bits of chocolate. Highly recommend if you are looking for healthy N tasty gluten-free options.","date":"2020-10-16 14:55:28"}
{"review_id":"RyBR9Hdn11KKUA_iiw3nxw","user_id":"cStREXmzqU6XAMCZ_8T2UQ","business_id":"izSgTrqebu8bN8ONOCs6cQ","stars":5.0,"useful":1,"funny":0,"cool":0,"text":"We were on a overnight trip to Santa Barbara during COVID and walked by this place. People lined up to get their breads. Saw the prices and walked away. \n\nThe next day I was walking by again and on a whim, picked up a loaf of the sourdough. Let me tell you, the best freaking loaf of bread I have ever had in my life. I would drive from the OC to get a loaf. It is that good.","date":"2021-03-23 11:51:50"}
{"review_id":"j3827V1seTvPc1jd_rWzjA","user_id":"DLEQaAhRiBshKzJ0jTm-Xg","business_id":"izSgTrqebu8bN8ONOCs6cQ","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"Charcoal sesame sourdough: to die for\nDate walnut cinnamon bun: literally cannot stop eating it (not dry at all, loaded with filling)\nArtichoke heart garlic loaf: my entire family was so amazed by the flavor and texture; 10\/10\n\nEverything at this bakery tastes amazing, and The bakers\/front window staff are so sweet. I can't wait to try a seeded cookies next! Favorite bread bakery in town\n\nOnly slightly negative comment is that the shiitake shallot loaf, which I had high hopes for, was definitely less flavorful than the other options. But no worries! The others are all winners, 100%","date":"2021-01-20 23:34:09"}
{"review_id":"-Kx6kMKcKPW52gXX4NWjbw","user_id":"10qbisF4sIqX7eDCtrQnWw","business_id":"izSgTrqebu8bN8ONOCs6cQ","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"This might have been the best bread I've ever had... I'm normally not one to gravitate towards focaccia but this loaf was out of this world. Paired with their artichoke dip... just heaven!\n\nThere's always a line and they tend to sell out of their staples, so show up early! Their service is top notch and their employees are very knowledgeable about their products.\n\nAlthough literally just a hole in the wall, worth making it a destination during your time in SB.","date":"2021-07-24 02:57:55"}
{"review_id":"f9PTlaWj3O-6c6di9szheg","user_id":"JO42WgKf7AqPK7-j9wOdcg","business_id":"izSgTrqebu8bN8ONOCs6cQ","stars":5.0,"useful":1,"funny":0,"cool":0,"text":"The Hygge bun, the foccacia, the super food cookie - out of this world and we did not even have room for the breads. Going back for more of this goodliness.","date":"2021-03-23 20:51:21"}
{"review_id":"naZSP5abp9wBLyP89GA5eQ","user_id":"wscD7kMnPdx44I0PYYgqlg","business_id":"izSgTrqebu8bN8ONOCs6cQ","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"THis is such a hidden jewel of SB, I have friend show live there and had never been.\nThe vegan cinnamon buns are to die for and on a long weekend you can only buy 3 at a time so the 4 of us fought over the 3.\nThe bread are so good and when they are right out of the oven it's magically \nA business run any ALL woman wooo hooo and they were working hard in the shop.\nTotally worth 5 stars plus sad I don't live in SB but also good as I would be there too regularly","date":"2020-09-16 03:43:57"}
{"review_id":"6O8rAjnoWq9Y3dvQy8fo7A","user_id":"Wo9ukcxjLGGFMpgrHJl-aQ","business_id":"izSgTrqebu8bN8ONOCs6cQ","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"Amazing collection of bread. We took the shiitake mushroom bread and the hygge bun. Both were vegan. The bun was not very sweet and had a quite subtle taste of cardamom and cinnamon adding to the flavors. The bread was very tasty, Quite soft and freshly baked. I will definitely visit again.","date":"2021-05-07 00:04:25"}
{"review_id":"2Ct2wjXKAQ6WLQqkQAs9cg","user_id":"0B-iMRDZeLLbigc3H-p7_g","business_id":"izSgTrqebu8bN8ONOCs6cQ","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"Delicious and creative breads! And fun to see the bakers crafting the loaves in the back. Just wish they would afford a slicer, if even for online minimum orders of $25 for husbands who love sandwiches with thinly sliced bread! Please ,,,,","date":"2021-02-22 15:07:55"}
{"review_id":"Z9oVVGllsXuHOW2r5lovkw","user_id":"lYNUBmXI1okw2bRXV-EDsg","business_id":"izSgTrqebu8bN8ONOCs6cQ","stars":5.0,"useful":3,"funny":1,"cool":1,"text":"If you're in the area come here and get some bread! They have gluten free options. Their super seeded bread is delicious. The shiitake bread was tasty. The only thing I would pass on is the \"chips,\" If they were seasoned I would probably try them again. This place is a must try.","date":"2020-12-06 18:01:36"}
{"review_id":"LQJD_QJOgpJrpkxAixdN8A","user_id":"iCwQQGuAL-2lq_s1QRJCSg","business_id":"izSgTrqebu8bN8ONOCs6cQ","stars":5.0,"useful":2,"funny":0,"cool":1,"text":"Oat Bakery is so convenient with easy walk up window (since covid) and simple street parking.  We currently LOVE all  their gluten free options but have also had their breads with gluten and they are so good!","date":"2020-10-24 04:09:55"}
{"review_id":"Xdtr_EtL4d3luH86BTMpyQ","user_id":"m9ioCQJovG_CGzJyketzKw","business_id":"izSgTrqebu8bN8ONOCs6cQ","stars":5.0,"useful":1,"funny":0,"cool":0,"text":"I stopped in yesterday after the farmers market and I was really impressed! The breads and pesto were incredible and everyone was super friendly. I live right nearby and having recently gone plant based I will definitely be back on a regular basis. I ended up purchasing the sesame nori & a garlic herb. Both breads were amazing and I served them to my husband with some homemade vegan cheese and he absolutely loved it. Highly recommend giving this bakery a try!!","date":"2017-10-04 21:15:12"}
{"review_id":"tIEmCLGrnsqCHqtOJ2wmVA","user_id":"nnTAzkmCz-_2SmR4vWrLYA","business_id":"izSgTrqebu8bN8ONOCs6cQ","stars":5.0,"useful":1,"funny":0,"cool":1,"text":"Stopped by Oat Bakery to pick up some delicious vegan baked goods. The staff was super friendly and the goods were divine. We ordered a savory hygge and the spinach and artichoke bread. So good!","date":"2021-06-13 03:06:17"}
{"review_id":"mitEzHo63KmuysXz_RGr6g","user_id":"LM1Aleq_ozhEslRd2GUGEQ","business_id":"izSgTrqebu8bN8ONOCs6cQ","stars":5.0,"useful":2,"funny":0,"cool":2,"text":"Looking for great home baked breads, you will not be disappointed with any bakery item you try from this bakery. Bread is all organic with locally harvested ingredients. Located right downtown just off State street on Haley with friendly happy staff and bakers. Small local business with great options. Gluten free bread available on request. Our favorite is the Sage garlic and the Shiitake shallot, but we have loved everything we sampled. Warning though, be prepared to stand in line especially on Saturdays, and the line moves slowly as when you get up to the window in can be difficult to decide with so many delicious options in front of you. Hint: you can order ahead and your order will be ready for you to pick up with no waiting.","date":"2021-07-27 15:01:24"}
{"review_id":"bRXNkewLUAZqs5mtxsXEDw","user_id":"v3f8xjxJhbvJ38PpepUO6w","business_id":"izSgTrqebu8bN8ONOCs6cQ","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"Second time visiting Santa Barbara and we could not go home without getting some fresh made bread before we trekked back home.\n\nTheir bread is dense and delicious with unique ingredients you don't normally find at a bread shop\/bakery. \n\nOrdered:\n-house coffee with oat milk = 3\/5. I was ignorant and asked for half and half. Hello! The place is called Oat Bakery they use oat milk! Lol. The coffee was decent. My mom wasn't used to oat milk so she only finished half. Would I get coffee here next time? If I didn't have time, yes, but I would prefer going up the street to Caje or Dune. \n-shiitake\/shallot = 5\/5. Delicious and the mushrooms are a nice touch! I was skeptical on the mushrooms. I thought it would provide too much moisture to the bread loaf but it makes for great flavor and texture.\n-sage\/garlic = 3\/5. Nothing special flavor wise. I would probably not get this again.\n-date\/something salty? = 6\/5. I wish I remembered what seasonal bread we ordered the first time we visited. It was a Tuesday and there was a loaf with dates and something salty. This loaf was the reason why we came back! Since we visited on a Sunday they didn't have anything seasonal","date":"2021-09-13 16:26:54"}
{"review_id":"ledK8XGgIUjtNTEJjZQRsA","user_id":"Z-qm3lePU2_EKbiMQbTmUA","business_id":"izSgTrqebu8bN8ONOCs6cQ","stars":5.0,"useful":1,"funny":0,"cool":0,"text":"This is probably one of the best bakeries I've been to, and I'm pretty picky about good bread. They hyyge bun was very tasty. The special corn & jalapeo loaf was amazing. The texture of the bread is chewy perfection inside with an outstanding crust outside. It's not cheap, but really worth it. We will add this to the top of our list for our next visit to Santa Barbara.","date":"2021-07-20 19:59:25"}
{"review_id":"7ySHS8VnQWJOSSS3-eUlLw","user_id":"HvSv6sVh-RoWDi8ZHPv9TQ","business_id":"izSgTrqebu8bN8ONOCs6cQ","stars":5.0,"useful":0,"funny":0,"cool":1,"text":"LOVELY BREAD ! The rosemary focaccia bread is so savory and flavorful. 10\/10 would recomend.","date":"2021-03-25 21:32:58"}
{"review_id":"TTQ3c1k1Lfa--pp2GG0JiA","user_id":"BkhXezL2_ngoIMe8C-h06Q","business_id":"izSgTrqebu8bN8ONOCs6cQ","stars":5.0,"useful":1,"funny":0,"cool":0,"text":"Soooo good! The Focaccia reminded me of living in Italy. I went to SB for a day trip and this place was a MUST GO stop for me. I'm so glad I waited in that line (:","date":"2021-02-01 18:47:22"}
{"review_id":"VCqQ0lkfQ83Vx0_l6Ah2Dg","user_id":"ZzyNf1ID4VxEhKZB-c7FUA","business_id":"izSgTrqebu8bN8ONOCs6cQ","stars":3.0,"useful":1,"funny":0,"cool":1,"text":"The folks who work here are great.  Super friendly and willing to slice your bread for you.  Many of the breads are wonderfully thick and yummy.  Then there are the other items.  Do not buy the truffle cream cheese-expensive but awful. We are throwing it away.  Save your $   Buy bread only.","date":"2019-01-30 05:37:32"}
{"review_id":"WSGx28Xp2sJ3cHAXlq9miA","user_id":"a4r7b9qJI_1HwfVul-ns5A","business_id":"izSgTrqebu8bN8ONOCs6cQ","stars":5.0,"useful":1,"funny":0,"cool":0,"text":"We came here at the recommendation of Low Pigeon Coffee Roasters, looking for some bakery items to munch on with our coffees. Unfortunately, it was more bread than sweets, but we still walked away with some hygge buns and the most delicious foccocia bread. I wish we lived in SB just so we could appreciate their other breads because I couldn't justify getting a loaf only to have it sit for days before being able to enjoy it in our kitchen at home.","date":"2021-12-30 00:02:07"}
{"review_id":"hiS3tC3Iy2L6Ls56DopuHQ","user_id":"uIRi2CQ69hg0QDGkr-ViQg","business_id":"izSgTrqebu8bN8ONOCs6cQ","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"LOAF their bread - I think very possibly the best bread I've ever had, and all organic too. I've always aspired to live in a spot with a great bread bakery nearby where I could pick up freshly baked bread the day of eating it... and I finally found my spot!\n\nI've gotten their hygge bun 3x this past week already - think cinnamon bun but healthier and heartier. I've also gotten their market special (available Tues and Sat only), which is a corn jalapeo feta sesame bread on top of their famous shiitake shallot and a rosemary focaccia with cheese. All are absolutely incredible. So soft and fluffy on the inside with the perfect amount of crunch on the outside. Paired the savory breads with their truffle cashew cream cheese, which is pretty out of this world. \n\nOverall I'm pretty blown away by this place and they have definitely gotten another regular customer!","date":"2021-08-07 21:56:16"}
{"review_id":"jqDDQp8JOaikCDBY9wupMQ","user_id":"7JfZGFtlfncILiZWraWYUg","business_id":"izSgTrqebu8bN8ONOCs6cQ","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"Delicious superseed cookie. I wish they could share the recipe, I would return just for that item. The date almond bread was also delicious and stayed moist for days in the fridge. Love the walk up window ordering system.","date":"2021-05-22 06:04:41"}
{"review_id":"xtQqdDCgj_KGh0CKtpI-vQ","user_id":"D36edPvzc504tHFLXcVP0Q","business_id":"izSgTrqebu8bN8ONOCs6cQ","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"I had some bread from here - how was it so good? The hygge bun was amazing. How can bread be so good? I don't get it.","date":"2021-04-07 02:05:58"}
{"review_id":"jCNEdW-nfTtyEKMsDZjtOQ","user_id":"UVFvTVvo_TKuzjoStgg_kg","business_id":"izSgTrqebu8bN8ONOCs6cQ","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"I got Half of a Seeded loaf. No flour. \n$15. Omg it was yum. Dense and complex. \nI don't live in the area but if I ever I'm in the area again I am definitely going to get the seeded loaf again.","date":"2021-12-29 04:59:50"}
{"review_id":"EdG1L2KrFnueGAiyTqosdg","user_id":"L-C9gH_a_SLMoHpHoK1-Aw","business_id":"izSgTrqebu8bN8ONOCs6cQ","stars":5.0,"useful":2,"funny":0,"cool":0,"text":"Great great great service along with DELICIOUS bread and pastries. Stopped by on Sunday around noon and I follow their IG so I saw they were selling a strawberry rhubarb pastry. Unfortunately they sold out by the time I got there but I was still able to get some items\n\nPurchased a blueberry lemon tart which was absolutely delicious - perfect balance of blueberry and lemon with a flaky crust. I also got some rosemary sourdough focaccia which I toasted up the next day - soooo yummy. Last thing I got was the blueberry lemon ricotta (can you tell I like blueberry lemon) but it actually did not taste like blueberry or lemon or ricotta. It did taste DELICIOUS however \n\nThey gave me a bag for the pastry that had \"we loaf you\" on it - absolutely adorable!! The only thing I would change is for them to post prices somewhere because I just ordered not knowing what costs what. Oh well.. it was worth and I hope I can come back!","date":"2021-05-16 21:36:57"}
{"review_id":"YqoUxBMfNy8-NGdJxFlwJQ","user_id":"BcTFcLGFVLWlbWQgM12OCw","business_id":"izSgTrqebu8bN8ONOCs6cQ","stars":5.0,"useful":1,"funny":1,"cool":1,"text":"I'm going to be craving this place until the next time I'm in SB, darn it. \n\nAbsolutely amazing bread. Honestly the Mushroom Shallot roll might be the best bread I've had- perfect chewy soft texture, flavorful and delicious.\nThe Hygge bun was good too but I would have preferred less nuts. The perfect amount of sweet though (not overly so), good cinnamon flavor and gooey texture. Go here!","date":"2021-08-31 21:32:27"}
{"review_id":"v4CQGTp9rMy7dyRxAeT1zw","user_id":"f8EZkSVeflte1cQ11l4_Ig","business_id":"izSgTrqebu8bN8ONOCs6cQ","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"Consistently friendly & helpful customer service and GREAT breads and pastries. I'm a longtime customer and my favorites are the hygge buns, shiitake shallot loaf,farmer market special, and the sourdough focaccia. But honestly everything is amazing!!","date":"2021-10-17 00:57:26"}
{"review_id":"WnGJDLPbkex2UDnbMNlOmg","user_id":"gmf4CyQq5jnBwNZmOdsOMQ","business_id":"izSgTrqebu8bN8ONOCs6cQ","stars":5.0,"useful":0,"funny":0,"cool":1,"text":"I had no idea this little hole in the wall existed, but I'm so glad I found it. The Oat Bakery has a delicious variety of freshly baked breads. From Savory to Sweet to Gluten Free and Vegan. Honestly the best bread I have ever had! I love the Sage Garlic and the Superseed Cookie which are both packed with seeds and are super delicious and filling. I highly recommend this place, especially if you like to eat healthy. I normally stay away from bread, but can't stay away from this bread!","date":"2021-03-08 21:45:44"}
{"review_id":"F049VuQG6AazX3z1xJJmoQ","user_id":"LyUbrS9JF5xFFqXZpUY7QQ","business_id":"izSgTrqebu8bN8ONOCs6cQ","stars":5.0,"useful":1,"funny":1,"cool":1,"text":"So delicious and such a quaint spot. Love this local SB bakery and the emphasis on healthy ingredients. It definitely shows, visually and gustatorily (??!lol?!?!)! Standouts include the Hygge Bun and Shitake Shallot loaf!!!! \nI literally went back a second time within the hour to get some more to take home to LA. \nFriendly service; highly recommend! I loaf you, Oat Bakery!!!","date":"2021-08-03 22:24:24"}
{"review_id":"fAumbpcqdX7gi0xtVpdC0A","user_id":"mngAq_ySH-uFP-GVVQdS_g","business_id":"izSgTrqebu8bN8ONOCs6cQ","stars":5.0,"useful":1,"funny":1,"cool":1,"text":"This is such a gem of bakery and service is always very friendly.  Such nice people working here providing fresh bread with fresh ingredients from the local farmer's market.  My husband loves the sourdough, and i love their gluten free breads (sage & garlic and date & almond are my favs).  Visited them once a week during the pandemic and it was always such a warm, welcoming environment.  I'll gladly wait in line for fresh baked gluten free bread any day.  Also their Instagram page is awesome and they post mouthwatering pics of their creations and all of the smiling faces of the obviously happy people who work there.  Love supporting local businesses like this!","date":"2021-05-25 01:53:01"}
{"review_id":"AfQcJ5LbxT41u2Sx2qzTog","user_id":"MMbNT3A5nPEGRLwQUUTgJw","business_id":"izSgTrqebu8bN8ONOCs6cQ","stars":5.0,"useful":0,"funny":0,"cool":1,"text":"This spot is great! They have a few different gluten-free options as well as a gluten-free vegan cookie which is delicious. The cookies were warm and fresh out of the oven when I arrived so of course I had to buy one. They tasted very healthy. The gluten-free bread was also very tasty. The people working were friendly and knowledgeable about the ingredients.","date":"2021-07-02 00:43:48"}
{"review_id":"kjrKyiUDzKc6CaM7ONBLFA","user_id":"DCxrFguMElcE0kDwi1dSKw","business_id":"izSgTrqebu8bN8ONOCs6cQ","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"I eat gluten and typically find gluten free bread to be sort of sad, but everything at Oat is delicious! I particularly like the Danish rye which is super dense and flavorful l- perfect for smorbrod","date":"2021-11-28 20:55:53"}
{"review_id":"mEX_XwPNoQaA9N6ooMIlJA","user_id":"lBd2PMaBPdpRbUQEh1hHSg","business_id":"izSgTrqebu8bN8ONOCs6cQ","stars":5.0,"useful":2,"funny":1,"cool":3,"text":"I love this bakery!! Their bread is all organic and gluten free and they use health-conscious ingredient. They bake their goods early in the morning so if you come early you can get freshly baked bread. We got the shiitake mushroom and shallots bread, along with the artichoke dip. So.... good! Knowing that what you're eating is healthy & clean makes you feel good - especially when I usually feel guilty when I indulge in carbs. \n\nWe also got the healthy cookie and the hygge bun. They are both delicious but the cookie is very flaky and doesn't have the texture of your normal flour cookies. Unless you're somehow who enjoys eating healthy options, you might not like this cookie as much. (I personally loved it but my boyfriend still prefers the good old chocolate chips cookie). I didn't know what to expect for the hygge bun since it was my first time trying it - it reminded me of a really healthy cinnamon roll with seeds. It was interesting to try but probably won't get it again. \n\nIf you love bread and eating healthy - this is the perfect bakery :)","date":"2021-05-16 22:25:08"}
{"review_id":"7AsPJMb1OfPJWPdDFiDsIA","user_id":"Cv_w67rE6lo1_J6T08d5tA","business_id":"izSgTrqebu8bN8ONOCs6cQ","stars":5.0,"useful":1,"funny":1,"cool":1,"text":"I found this amazing family owned Oat Bakery.  I was strolling on State St. when I noticed the sign on the sidewalk.  I love bread & decided to try it.  The owners daughter was so sweet & explain that it was her moms recipe.  I 1 loaf of the almond date loaf & couldn't resist but to take a chunk & eat it.  The following week when my husband was in the area I asked him to buy us some bread, he bought 3 different kind & all were delicious.","date":"2018-10-06 21:15:16"}
{"review_id":"_TiQrIOpc2Wu_fqL22AC6A","user_id":"6ZCU5Pn3c5iJ95pZFDs2Ag","business_id":"izSgTrqebu8bN8ONOCs6cQ","stars":5.0,"useful":1,"funny":0,"cool":2,"text":"I can't wait to try every single bread they have and then repeat multiple times over!  Hubby and I definitely enjoy bread but it HAS to be good, just can't be, \"yeah it's alright\" for us to munch away.  If I'm gonna have to burn off some extra calories, it's gotta be worth the taste.  Oat Bakery is worth every bit of the taste!  We try breads from every place that offers it, large and little places, and too often, it's one or two bites and we don't return.  Not the case here.  We went, we had the Sage Garlic, and \"OMG\", and quickly went back the next morning!  We repeated and added the Rosemary Sour Dough Focaccia.  Best bread in town hands down!!  They also offer gluten free.  Prices are extremely decent.  It's also nice to see the bake team enjoying their work.","date":"2020-06-26 18:22:46"}
{"review_id":"FA3GHi4VnfwMlLqBysABcQ","user_id":"nEkwa_GANKF9DXYtC0wJkA","business_id":"izSgTrqebu8bN8ONOCs6cQ","stars":2.0,"useful":1,"funny":0,"cool":0,"text":"I asked for a loaf of olive sourdough bread and what they sold me was a loaf of burnt olive sourdough bread.  Yes, burned on top and bottom.  Thankfully there are other very good bakeries in town because I won't be returning to this establishment.  When they were learning to bake bread,  they should have been learning some integrity along with it.","date":"2019-10-08 21:20:08"}
{"review_id":"dLExPejn5BaHZtaPChvwhA","user_id":"ehiTduJIC7AhWP3zG43Cxg","business_id":"izSgTrqebu8bN8ONOCs6cQ","stars":5.0,"useful":1,"funny":0,"cool":0,"text":"We kept seeing a long line at Oat, so decided to check it out! This is the best bread I have maybe ever had. The shiitake shallot is unreal!!! Also would really recommend the truffle cashew cream cheese. The woman who helped us was super kind and answered our questions very thoroughly. I've seen a few reviews saying that it's a bit expensive but trust me $6 is a VERY fair price for bread this fresh and delicious. Will be returning very soon!!","date":"2021-02-22 18:28:09"}
{"review_id":"wWDDT1bJRy-faS5yVD1cWQ","user_id":"Bo4TVr3EWwEYccILf6DSPQ","business_id":"izSgTrqebu8bN8ONOCs6cQ","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"We've tried every bakery that makes bread in Santa Barbara and nothing else comes close.  I know it sounds weird, but the charcoal bread is intoxicating.  We go through a loaf a week.","date":"2021-07-22 18:00:58"}
{"review_id":"HvAfixyocisVNtOFZwY_lw","user_id":"eaUAQZCEdDGbpaYhIYZAgQ","business_id":"izSgTrqebu8bN8ONOCs6cQ","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"Agree with everyone else, the best superfood bread I've ever had. It has such a great texture, and taste. I'm glad I found this place, definitely coming back.","date":"2020-06-12 19:09:21"}
{"review_id":"mNbVx-_57zak6Q7E-qRKnQ","user_id":"hj6bHxcTRCPVhanRL5neGA","business_id":"izSgTrqebu8bN8ONOCs6cQ","stars":5.0,"useful":4,"funny":2,"cool":3,"text":"Best sourdough bread - try their charcoal or charcoal Tumeric sourdough.   \nVegan spreads. Loved e sweet pea, mint with hint of jalapeo.  Three more vegan spreads.  Breads are vegan too. \nGreat service.  Kind staff  and fabulous breads, treats and more.","date":"2021-05-11 07:33:13"}
{"review_id":"qOoHhAWJYDgJ1b65hD95yA","user_id":"83hGjT-0qeA-x3wKM7X5Zw","business_id":"izSgTrqebu8bN8ONOCs6cQ","stars":5.0,"useful":2,"funny":1,"cool":2,"text":"Two words: Shiitake Shallot. \n\nPre COVID my husband and I were spending a day in Santa Barbara and stumbled on this gem. They have so many heavenly breads but we ended up getting Shiitake Shallot home and it is incredible. Large chunks of Shittake and little pieces of cooked shallot in the bread is so incredibly savory and the general umami of it unbelievable. This may be the best bread I've ever had in my life. I also expected any bread with mushrooms to be watery or to be a little too wet but this was perfect. At $6 a pop it's not cheap certainly but worth it as a treat. Would highly recommend.","date":"2020-07-12 23:15:21"}
{"review_id":"j9Cg6lAQBISAxEC5v-o0_Q","user_id":"7Rq_WlMYbpf_67b7nHUXtA","business_id":"izSgTrqebu8bN8ONOCs6cQ","stars":5.0,"useful":1,"funny":0,"cool":0,"text":"THE WORLD'S BEST BAKERY!!!! I am so obsessed with their seed bread that I stock up every time I'm in town from LA.....it tastes beyond amazing and if you want to cleanse, this bread is amazing for that!! It's the best by itself or as toast, Avacado toast, it's just the most amazing invention ever! Plus it freezes perfectly, it's like a unicorn bread \n\nThe ladies who work there couldn't possibly be any sweeter and have the very best customer service ever, they found the very best people \n\nI've also tried their homemade granola and AMAZING spreads....I think everything they make turns to gold, they're magic makers \n\nBest place ever, you'll be beyond happy that you discovered it","date":"2020-05-26 22:12:06"}
{"review_id":"BEn0Kdn_lBuGneNY5Jhw0A","user_id":"2okJkbOmIOE8d8pa15QHmQ","business_id":"izSgTrqebu8bN8ONOCs6cQ","stars":2.0,"useful":0,"funny":0,"cool":0,"text":"Some creative concepts.  I tried the Shitake shallot one based on couple of the bakers' recommendations. I was disappointed as the crumb was doughy and felt as though the bread was not fully baked.  \nMight of been a one-off thing given all the 5 star reviews.","date":"2021-04-01 05:00:11"}
{"review_id":"zUz73_MJ_aMUN3rrMT9cFw","user_id":"qDOTCEC2R6xZ-UwrTxF_NA","business_id":"izSgTrqebu8bN8ONOCs6cQ","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"Ok so... holy moly. If I could, I'd give more than 5 stars. I work in the specialty food\/drink world and am always on the lookout for local artisanal spots when I travel: Oat bakery is exactly it! My wife and I got the Hygge bun and the pecorino thyme and couldn't be more thrilled. Our items were definitely fresh, flavorful and well presented. Whether you're a local or just stopping through town, Oat Bakery is a must try! Cheers!","date":"2020-09-12 20:27:02"}
{"review_id":"U3nDmyID2CAeiNQVovop3A","user_id":"XLRzqtCGycIESuA5xfbXdA","business_id":"izSgTrqebu8bN8ONOCs6cQ","stars":5.0,"useful":2,"funny":2,"cool":0,"text":"Stop LOAFing around and get yourself to Oat Bakery! This husband and wife owned Scandinavian bakery has a charming storefront with gorgeous blue tiles and a \"we loaf you\" pun (more bread puns on their website too!). I've noticed that other restaurants like Satellite use Oat Bakery's organic, handmade bread, so you know their bread has to be good!\n\nI loved the hygge (pronounced \"hue-gah\") bun! Warm and crunchy on the outside, this bun was heavenly with jammy chunks of dates and comforting flavors of cinnamon and cardamom. The thick superseed cookie with dark chocolate wasn't what I expected. It didn't taste like a typical cookie in both flavor and texture but rather a healthy energy bar, but I still enjoyed it as a mid-afternoon snack. The vegan and gluten free truffle cashew cream cheese had a thinner texture similar to hummus; I wish it was thicker like cream cheese. However, the spread was still delicious with a strong truffle flavor and pairs well with the shiitake shallot bun, which was soft and pretty moist inside. Even though it's called a bun, its size is larger and more like a small loaf. I'll definitely be back to try the rest of their buns and breads!","date":"2021-08-16 22:43:02"}
{"review_id":"rUpUvr-tTnWNGfpqxIu9bw","user_id":"8_dgvigBjl7TtkUwzvujCw","business_id":"izSgTrqebu8bN8ONOCs6cQ","stars":5.0,"useful":0,"funny":0,"cool":1,"text":"Without a doubt the best bread I have ever had in my life. Every time I'm in SB, I stock up on several loaves. Absolutely out of this world, I've never had a miss here. Also - get the hygge buns!! Absolutely to die for as well.","date":"2021-03-17 04:36:01"}
{"review_id":"J4EMy-dY-szydnrOWxWQMA","user_id":"1kdr8S6wJ6hcPWcbzFo2Ew","business_id":"izSgTrqebu8bN8ONOCs6cQ","stars":4.0,"useful":1,"funny":0,"cool":1,"text":"Surprised I have yet to write a review for a bakery that saved me during the pandemic (nothing than brightens a day more than Bread and Buns) \n\nOat Bakery is a gem hidden, but very well-known, in DT Santa Barbara. The line is always long but so worth it. My absolute favorites and go-tos are Date Almond Bun, Hygge Bun (ya try to not mess up that pronunciation) , and the super-seed cookie. I'm talking MOUTH WATERING, what dreams are made of good. \n\nSo why 4 stars? On the numerous occasions I have been here - I won't even say how many times to spare me that embarrassment- They are NOT consistent. You'll either get a bun with TONS of almonds, dates or whatever they promise, a BIG cookie , OR you'll be madly disappointed the next week when you pay the same amount for a subpar version of what you waited to eat all week for breakfast. My suggestion is this- look at what is good. If it looks pathetic that day, chances are it tastes as such too. \n\nI'll be of course returning, hoping for that fully loaded bun, cookie, or bread. However, I wouldn't be surprised if I have to go back and ask for my soggy, undercooked bread to be replaced.","date":"2021-02-27 20:50:29"}
{"review_id":"AfMwwP3XxolzeK5YPMK5bg","user_id":"vYxJk0mKy5ftLdeoJEvIMw","business_id":"izSgTrqebu8bN8ONOCs6cQ","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"Excellent: sourdough breads, tried the charcoal sesame, & vegan focaccia, \nGreat: gf plain & sage garlic loafs - must be toasted! \nGood: hygge bun, super seed cookie,\n\nLove that they use organic ingredients, have a lot of organic sourdough breads, & a few GF options.","date":"2021-06-02 23:58:51"}
{"review_id":"MqK72QnvWeuPHIahqh-r1w","user_id":"uZ_bST59k2C7hXGe-0xK2Q","business_id":"izSgTrqebu8bN8ONOCs6cQ","stars":5.0,"useful":1,"funny":0,"cool":2,"text":"What a cool concept!! Glad I got to try this place over July 4th when visiting SB.\n\nSo many unique breads to choose from. I got the shiitake mushroom, almond date, pumpkin seed, whole wheat focaccia, and charcoal sesame. Had to eat this throughout a week and amongst 6 people. The loaves are pretty massive haha\n\nAbsolutely loved the shiitake and the whole wheat focaccia and second fave would be the charcoal sesame. \nOthers were good but I prefer the more savory type of breads and they did an excellent job with flavor and each was true to description. \n\nHope I can stop by on my next trip and try some more out  in addition to my faves :)","date":"2020-07-13 05:11:22"}
{"review_id":"Fy14BUV9qt3Ko3FIBkwxKw","user_id":"iJQtNnEcrxdpaD132v26nQ","business_id":"izSgTrqebu8bN8ONOCs6cQ","stars":5.0,"useful":18,"funny":6,"cool":13,"text":"In an era where bread has become the vilified, black sheep, Oat Bakery is its saving grace. With incredible, fresh-baked loaves and buns, Oat Bakery is making eating bread \"cool\" again. My favorite things to order are the Brie & Cherry Loaf, Spinach & Feta Loaf, Savory Hygge Bun (think Cheesy Monkey Bread with Herbs), Sweet Hygge (think Cinnamon Roll but better, made with dates) and their House Made Granola. I also love their Cashew Truffle Spread (think truffle cream cheese without the cheese.) \n\nThe Gluten Free bread could be employed by the CIA and go under cover as traditional bread without ever breaking cover. It's that good! On one of my visits to the Ty Lounge at the Four Seasons Biltmore Resort, a group of tourists with Celiac Disease ordered their charcuterie board with a side of Gluten Free crostini. After taking their first bite, they flagged the waiter down and proceeded to admonish him for bringing them gluten bread. They were sure it contained gluten because it tasted so good. Nope, it was Oat Bakery's delicious, double-agent, Gluten Free bread. I couldn't resist chiming in and doting about SB's gem of a local bakery and vouching that their crostini was in fact gluten free. They finished their board and bread with delight (and NO anaphylactic shock)!\n\nMany local restaurants and eateries procure their bread from Oat Bakery. Love the Fancy Avocado Toast at Caje? Their Charcoal Sourdough Bread is from Oat Bakery. Crazy about the Raw Cashew Toast at Juice Ranch? - Their bread is from Oat Bakery. Does Healthy Warrior's SuperFood Breakfast Toast make you Happy? - It's also from Oat Bakery! The list goes on and on. Oat Bakery is a hit not to be missed! \n\nThe shop itself is quaint; tucked discreetly between a few other businesses off State Street on Guiterez Street. Blink and you could miss it. This is not a sit down and eat establishment, although their are usually a couple of bar stools inside along bay windows looking out onto Downtown Santa Barbara. Order at the counter and take your goodies to go. It's the perfect stop before a picnic, wine tasting or stroll to the beach. Not to mention before a dinner party. Show up with a few loaves from Oat Bakery at your next gathering and you'll be the Belle of the Ball!","date":"2020-02-09 18:28:46"}
