{"review_id":"CPzY8DW6J8ouzQ8WoLZPwQ","user_id":"eUzLNFgQS6e2eKltBIRqeA","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"AMAZING empanadas from a take-out place that feels more like an industrial kitchen than a restaurant, with great service. I ordered at the counter inside and waited outside at the patio table for about 10 minutes for my order. We ordered 6 empanadas for the 2 of us, which was the perfect amount. Since my fiancee is vegetarian, we tried all four vegetarian options: caprese, fugazzeta,, quinoa, and humita. They come in slightly different shapes so you can identify which is which after you open the box at home. The flavors were absolutely perfect - my favorite was the fugazzeta (blue cheese and sauteed onions in an empanada? yes please!!). Highly recommend!","date":"2017-09-20 16:04:30"}
{"review_id":"ItVCfo4wSRy7a5ceGZzylA","user_id":"tQffKBZlKeNx2WfLgeFJkw","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":1,"funny":0,"cool":0,"text":"Absolutely the best empanadas \nEver the beef empanada are my favorite\nThe staff are wonderful people \nThomas Mathias  your the best \nCan't wait for July for the \nArgentina festival \n     \n10 STAR","date":"2016-06-12 14:12:36"}
{"review_id":"xEcsbKEJc8CVGI22bkJ9eQ","user_id":"r-phes27ngRgHimVUEy1jw","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":1,"funny":0,"cool":0,"text":"Since my boyfriend and I are vegetarian now, this was one of two booths at Solstice that we could get a hearty meal from. We got the caprese and choclo empanadas and they were so BOMB! Especially with that sauce they give you (some kind of pesto-type sauce?). I preferred the caprese since it tasted refreshing yet it was filling (I prefer tomatoes over a corn filling). Will definitely try to get more empanadas from here","date":"2016-09-07 01:12:03"}
{"review_id":"FFPTkNAIN0Zzhthx6gUchQ","user_id":"Z0aSdZS8mrSSO1bRF2IvTw","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":1,"funny":0,"cool":0,"text":"Absolutely delicious! I was at Telegraph Brewing twice now and was offered one to try each time they were both perfectly cooked and the chimichuri sauce was also very tasty!","date":"2016-03-19 01:37:05"}
{"review_id":"2-efPjaRklV8x4cB1TUCYA","user_id":"YtAlwpS2f6BksThEVTVj7A","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":2,"funny":0,"cool":0,"text":"Great empanadas! Definitely a gem in Santa Barbara. All the empanadas are tasty I especially enjoyed the Suiza. Order to go and enjoy at a local brewery on the east side.","date":"2016-04-24 02:16:48"}
{"review_id":"hIObnw_BP68t19VlrrVMVA","user_id":"OdyICzhXz1xIppreK7lYDQ","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":1,"funny":0,"cool":1,"text":"I'm always skeptical when I try empanadas and chimichurri. My mom is from Argentina and I have had the pleasure of eating her delicious, authentic cooking. Buena Onda delivers! They are delicious empanadas in the lightest dough. Everything is so fresh. The chimichurri is fantastic as well, not too acidic and not too garlicky. Just a fantastic spot with great food!","date":"2018-07-27 02:09:46"}
{"review_id":"o7CW82NDj9Mx0BeeWHQuIg","user_id":"EYz_UN1dKHshzaMKDrrBNA","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"Hi there, oh, I am not here to write a positive review, I am just here to accuse Buena Onda for making me fat yet I cant stop loving the empanadas here.\nPlease stop making SB fat again.\nSeriously though, I love the caprese , I can eat like 6 per night...and is all your fault, Buene Onda, give me back my waist line!!!!!","date":"2018-07-18 04:51:34"}
{"review_id":"vaO7pFXLT4s1XBcx7BZR_Q","user_id":"1fwVY_Lui6PyV2BHKEM6nA","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"This place was great! From the friendly service to the great tasting empanadas! I tried the vegan, chicken and the sweet one. All three were better than I expected. I would recommend this place to anyone trying to find a local place with organic ingredients. Will definitely be going here again!","date":"2017-12-30 04:40:49"}
{"review_id":"5HyUcBIMZ9CnQy45ZkXIeg","user_id":"PedkMlX4QQC4KA5YRohk5Q","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":1,"funny":0,"cool":0,"text":"Delicious!  I was in town visiting a friend who recommended we try Buena Onda.  It didn't disappoint!  The empanadas were delicious and I loved the unique flavor combinations.  What a fun, modern take on the traditional empanada.  We picked up the empanadas and brought them with us on a boat cruise.  It was the perfect snack!  Definitely give them a try!","date":"2016-03-09 22:30:03"}
{"review_id":"GAaf8xRyVITVEZEtPgeIog","user_id":"g1yLBdzZwKriM_fAkCNmLg","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":1,"funny":0,"cool":0,"text":"A SB Hidden treasure. I tried 3 empanadas and they were all delicious. Light, flaky pastry beautifully presented and baked to perfection. What a great departure if you're ready to branch out from SB's excellent Mexican food! Attentive owners and nice outdoor dining.","date":"2018-06-28 03:04:09"}
{"review_id":"fcLmsThymy4H1ju6xtHcqQ","user_id":"bdH9y-8diQ2_3DTQU5MuNQ","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"Loved this inconspicuous place with beautiful bougainvillea beside the small tables outside. The empanadas were very tasty, especially the caprese. A perfect lite bite place for pre-evening entertainment. We'll be back!!","date":"2018-08-24 18:44:35"}
{"review_id":"EUGhbHfbY-3-3dHEoo7sWg","user_id":"7gn6q55hkN9_3ATMu8mp2Q","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":2,"funny":0,"cool":1,"text":"One word, phenomenal! These are hand crafted and authentic and it doesn't disappoint. They can add me as a customer for life.","date":"2016-06-25 01:52:10"}
{"review_id":"JGfXAhw1CkH3u6FDde0DmQ","user_id":"td-nDkoKPnRoKmJ1CLAEtg","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"In the overpriced and under-seasoned land of Santa Barbara, this place is a haven of flavor and decent prices. This place has become one of my favorite go-to takeout spots for lunch or dinner. I've regularly ordered half dozens from here to share with friends and there are great options, vegetarian and vegan available, for a great price. While the empanadas aren't super large, I've found them to be very filling, 2-3 would suffice for an individual. I would highly recommend picking up the Fugazzeta, Suiza, or the Pollo (for meat lovers) to start. The space itself is not really for sit down, but there are some picnic tables and benches. Recommend to anyone looking for a quick and delicious bite.","date":"2018-06-10 18:32:13"}
{"review_id":"CW1CvKJ7VAX7iQKNuwdl7g","user_id":"iYFktoqE4knUunTTkh3cMw","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"They gave my family and I a good welcome. Food is good and satisfying. The sauce that comes with the empanadas really gives them that extra deliciousness.","date":"2018-06-21 06:54:51"}
{"review_id":"CwH8YZ6TDy7W-inZtMcpAQ","user_id":"3MbIOTY4keQzb8Fwte6EWQ","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"Two months ago we spent 3 weeks in Argentina and one of the things we really enjoyed were Empanadas. We missed having them so we tried Buena Onda. The Empanadas at Buena Onda were better than we had in Argentina!\nThe outer shell is light and baked to perfection. Both the meats we tried, were flavorful, moist and complimented with the right spices.","date":"2017-03-19 02:03:42"}
{"review_id":"yCIsfw_oe2CyIEnTLofTwg","user_id":"JsIUMu2yGmAMWDh6q_UsuA","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":0,"funny":0,"cool":1,"text":"Perrrrrrrfect Emapanadas!!!! Super flavorful and crispy. The meat and eggs was my favorite","date":"2017-02-11 02:45:19"}
{"review_id":"RFqASsKVQPHL53X2kIn6kA","user_id":"nQkxOecQjqira4HOxZDYDQ","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":2,"funny":0,"cool":1,"text":"YUM! I was blown away by the tastiness when I visited Buena Onda. My favorites were the pollo, carne picada, and la suiza. Everything was so fresh and homemade, which makes sense as it's run by the most loving and welcoming family! I'll definitely be back soon (and maybe asking for a dozen or two to pop in the freezer for another day )","date":"2016-02-29 03:57:01"}
{"review_id":"me9jU863vVus1Oq84CQSPg","user_id":"uDE1BPzED66ObhbyIthdWw","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"Wow !! Incredible place !! So delicious!! We came up for the weekend from southern Cali and wanted empanadas. We so glad we stop by!! The best ever and we are a foodie family!! The staff is family owned and so nice and friendly!! We definitely come back again when we are in Santa Barbara!! I wish one was near us!! I'm going truly miss this place!! It's a must go to if you in the area!!","date":"2018-08-19 02:12:17"}
{"review_id":"1jS1eD5Sfvu6wiTZhRW2Zg","user_id":"bhrDjKgQF8uzbyHQOoLDZQ","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"These empanadas were so delicious! They were made with the authentic Argentinian flavors. I closed my eyes and was transported to Buenos Aires.","date":"2018-06-29 07:37:46"}
{"review_id":"xbNNApPWN8YxRhrGlKAsBA","user_id":"0VYzR15p6G18-2_KCsvuEw","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":4.0,"useful":3,"funny":3,"cool":3,"text":"To-go empanadas? Always yes.\n\nFound this spot super close to our airbnb during a weekend in Santa Barbara, so my friend and I walked here. We got half a dozen, and were happily surprised by both the veggie and meat options. \n\nI'm from the Bay Area...and our empanada spot in the city is El Porteño's. Comparing Buena Onda's to that...I'd say the portion sizes are much smaller, but filling choices are way more diverse. They have the same ones like fugazetta and suiza...but different ones that have caprese filling or a quinoa-based inside! It's such a great little snack if you want to have a lighter meal, or have something to snack on with your drinks.\n\nWe bought them hot in a box to go, but they also partner with SB menus if you want to order online or need delivery. This place is located in a factory-like setup...with no frills ordering at the cashier, and a waiting area outside on their front \"porch\" with private parking. There is also a lot of street parking too, if the private lot gets full. We saw customers who clearly ordered ahead online or by phone, and came to pick up their warm goodies. I highly recommend these empanadas--great for groups to snack on, or delicious enough for a party of one!","date":"2017-09-21 06:33:19"}
{"review_id":"v9nzRefEcXbtTAPbaFYYGg","user_id":"H6qSr0fhuxcYxUsT2kwB9g","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":2,"funny":0,"cool":0,"text":"I did receive a voice message from the owner a couple days later trying to rectify the issue of one of my empanadas being missing from my order. Since he did reach out I will update my review since the food was very good and they did reach out.","date":"2018-02-26 22:01:55"}
{"review_id":"OGAf4a4UYuzUUk5o5EyJEA","user_id":"uqC3ll6vCfqFalbWnPi-Qg","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":1,"funny":0,"cool":0,"text":"Wow. Real quality ingredients. Flavors are super authentic. Friendliest service I've seen this side of the equator. These are totally on par with, if not better than, the most acclaimed empanadas I've had in SF or LA.","date":"2016-09-11 06:03:43"}
{"review_id":"4VkBE44txLZYNkEUZvcvug","user_id":"_5luC8h4abbHpbpm907B6w","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":1,"funny":1,"cool":1,"text":"Tasty empanadas. Fresh and hot from the oven. Flavors are excellent. Great customer service. The parking lot was full and I called the shop to ask them if somebody could run out to deliver my box of empanadas to me in my car. They were nice and accommodating to delivery the pastries in an instant!","date":"2017-10-16 00:54:55"}
{"review_id":"msTP1mhX9xsNNRdcDzsv7g","user_id":"tQffKBZlKeNx2WfLgeFJkw","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"Absolutely the best empanadas \nEver the beef empanada are my favorite\nThe staff are wonderful people \nThomas your the best \nCan't wait for July for the \nArgentina festival","date":"2016-06-05 00:10:29"}
{"review_id":"AsGgfmE1YUEP33Cm1iCz5A","user_id":"sZvXnUfd6UjMeNWQ07_6qA","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"The best empanadas ever, just in town for a holiday and came across this place. Very family like feel and the food was very very fresh, all the organic ingredients making hella difference. Will def stop by again","date":"2018-06-14 01:32:52"}
{"review_id":"M_-lBFz7gXjczEEN9mR3WA","user_id":"V1uip6aQe17D39YWc_-lBA","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"OMG this place is awesome! The empanadas are amazing!!! So happy we have this place in town!","date":"2018-09-07 21:26:10"}
{"review_id":"Y8vY4tLj0AnEi5fCZj69Aw","user_id":"SallxxlA_akS2c4BNR1Rhg","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":4.0,"useful":0,"funny":0,"cool":1,"text":"authentic ARG empanadas! mouthwatering and addictive!","date":"2017-02-02 06:20:28"}
{"review_id":"grC2E4gJSbWe7Y9bbTHu0w","user_id":"7eLjZ0ITNRS_i_HYo8wg7w","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"Simply the best Argentinian emapanadas. I drove for two hours just to try them and it was worth it. They were so good, I brought two dozen home.","date":"2018-10-02 02:02:11"}
{"review_id":"q5kw20icCZAeg3O6UaFa7Q","user_id":"4mjV52-w-aDLYBP-k33P4g","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":2,"funny":2,"cool":2,"text":"Found this little gem on our way back home to Orange County and so happy we did. This place is cozy, warm, and inviting. Matias and Elena literally treated us like family. My little boy turned 3 today and they literally made his night. The empanadas themselves are out of this world, and I've had many from authentic Argentine restaurants! I think I'm going to have to make the trip out to Santa Barbara not only to get these decadent empanadas again but to see Matias and Elena, they really made our trip out to Santa Barbara more memorable. It is a little hard to find, but where MAPS takes you, is where it's at, don't question yourself. It's inside of the open gated parking lot just adjacent to the mini mart. Their chimichurri sauce is to die for. I got a full dozen to bring home but wish I got more because everyone loves them!!! These are made fresh to order, so don't come expecting them to be quick. They're going to be sizzling hot coming out of the oven, crisp on the outside and soft and savory on the inside.","date":"2017-02-05 04:52:27"}
{"review_id":"9qHAJ4AqA158MKfM9wwoYQ","user_id":"RakXi-A5uXTd8hkoc9K9cw","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":1,"funny":0,"cool":1,"text":"Just came home with half a dozen. They are incredible. This place is making a fantastic Empanada. Call ahead as it takes about 15 minutes since they make them fresh to order. Well worth the wait though. And the Chimichurri sauce is really tasty stuff. I'm going back for more soon.","date":"2018-02-04 03:07:40"}
{"review_id":"wbqSts5dI5a5uTplLYq_5Q","user_id":"ja5KgtnQDLIcfdoT5-e7og","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":1,"funny":0,"cool":1,"text":"Simply delicious and a hidden gem!  Definitely a recommendation for those visiting Santa Barbara.","date":"2017-12-09 00:34:48"}
{"review_id":"38Ht7pXo1sYQb4vOVIwYEQ","user_id":"fDA5XRMRaWUcLFRG-xwT1w","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":1,"funny":0,"cool":0,"text":"Good taste, good people and the real Argentinian flavor in a nice place to try Gourmet empanadas.","date":"2018-03-29 21:18:47"}
{"review_id":"ivAXdfDO3oKhjrHTZYWWaA","user_id":"mA3tDGDlW6FXNMws18bbQA","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":1,"funny":1,"cool":0,"text":"Super late on my review of Buena Onda. Found it after Lucidity last year and was beyond impressed. I'm a huge fan of La Empanada in San Francisco and didn't think there was any better until I found this spot. I met the owner Matias and he couldn't have been nicer. Does anyone known if they sell frozen empanadas? Thanks guys","date":"2017-03-10 07:44:46"}
{"review_id":"AsMf2C6I8m9Q9ocXAWlLcA","user_id":"46KUbhuEsVvqrQBcPq2reA","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"Owners are incredibly nice and the empanadas are delicious AND they're mad with organic ingredients!","date":"2017-03-31 06:32:33"}
{"review_id":"hxIepTtnPUaG7IYL1bW3-w","user_id":"Z0aSdZS8mrSSO1bRF2IvTw","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":1,"funny":1,"cool":0,"text":"I finally went and ordered a bunch of Empanadas for myself and a friend we had the Carne Picada and the Pollo (Beef and Chicken) and just like last time they were Great!  Thank you Thomas, Malena and Matias and for the delicious treats!!","date":"2016-05-13 05:14:15"}
{"review_id":"I7TRn_NRPqbTM7hImkH74g","user_id":"aPhSpNikotD5tSEVydnAWQ","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":1,"funny":0,"cool":1,"text":"Tried the suiza and caprese empanadas at the Earth Day festival and they were delicious! The suiza filling tastes like spinach dip, and the caprese has a good amount of basil to make it really flavorful. Can't wait to get these again!","date":"2018-04-21 23:26:29"}
{"review_id":"jei50qAVxPL5pcXordSiVQ","user_id":"Xjc5s4GH-uhby48gfqpkrg","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":3,"funny":0,"cool":0,"text":"Amazing empanadas , reasonably priced , fresh . If you get a chance order a dozen of these great South American delights , don't forget to get their chimichurri.","date":"2015-11-29 23:49:57"}
{"review_id":"6x_H88fOXahJ4-q4nauUbA","user_id":"fU3CH6xLR7-AD9d5NDGu3A","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":3.0,"useful":0,"funny":0,"cool":0,"text":"The food was ok, but to me it seems that they tax way more than the usual tax, they don't provide receipts, when asked he did not know what to answer, the amount is much more after the taxes are amount it, so I don't know if that is like a extra 5 percent tip.","date":"2018-06-17 07:08:58"}
{"review_id":"XCVd3DwdweNIfhdnExeJgA","user_id":"rVa7cBBhRvCxvBui3Mkc2w","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"So delicious and such a great value! Not really a place you want to eat at, but can be picked up to go and on certain days they deliver to local tasting rooms. Highly recommend!","date":"2018-04-21 18:29:37"}
{"review_id":"uXOUwadqXeqk31OBGVQgqA","user_id":"yTP-pE8skZXjVTE-Ejegug","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"The BEST, I repeat the BEST EMPANADAS I HAVE EVER EATEN. These things are actually incredible. A tip try a little bit of each and share with a friend!","date":"2018-09-01 02:25:23"}
{"review_id":"CVITCOPk7v4QV05tTkNPDg","user_id":"b5QOo3qnuIeoilaVf4Y28w","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":4.0,"useful":0,"funny":0,"cool":0,"text":"Love the carne empanadas with chimichurri sauce at old Peet's location. Cheese basil and other one just okay.","date":"2019-02-17 05:20:24"}
{"review_id":"P0Ba4PfpbuWiwZJqsvQ3mg","user_id":"40jM3N2rAuAW5q__LgzckQ","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"Wow, great local spot with friendly faces and excellent authentic food. You will have to take your food home or beachside to consume but it's well worth it when you take your first bite into one of these delicious empanadas. They are made with love","date":"2018-04-23 03:48:47"}
{"review_id":"WS2Yehk4G-FO3_AGBKr6RQ","user_id":"hW-mR_xCCDmMyMf_elxknw","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"Empanada's are delicious ...Great vegetarian selection; the humita is my favorite.","date":"2017-07-06 18:31:32"}
{"review_id":"VvoA9MXEKLRs8iX7iq3orQ","user_id":"iPxU1nBFzaZs8En75YWSng","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"Seriously amazing tasting food! The vegan option is wonderful and filling. You will be full with 2 -3 or so as they do not skimp on the fillings.","date":"2018-03-14 00:42:37"}
{"review_id":"mMvO6T0EPJzAMG92SHizzw","user_id":"iPetj-0dnwc9kNJLZ3JKew","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":4.0,"useful":0,"funny":0,"cool":0,"text":"So so yummy! This place makes fresh empanadas made to order, and served with yummy chimichurri sauce! The inside space is pretty small, they have a few counters and stools for solo eaters. They also have very beautiful courtyard seating outside with bigger tables and umbrellas and pretty stringed lights for the night time.\n\nWe got chicken and steak empanadas and wish we stopped to eat them before leaving because we would have ordered more! Love that they have vegan options and seasonal empanadas too. Overall I think they have close to 10 different flavors, they range in the 3-4 dollar range, and were a little bigger than a standard computer mouse.","date":"2019-01-04 19:05:28"}
{"review_id":"xm8mhVFmPr6mliXGKCsNgA","user_id":"jQfyUwH41mrAwb-LfBRUfA","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"L O V E Buena Onda. The empanadas are delicious and they are very accommodating for catering. Nicest people, great food... what more could you want?","date":"2017-08-24 22:34:01"}
{"review_id":"dSMJZ_JzvbXChnsz3hnMVA","user_id":"ff_MOBvy2g0e5_UY4GdB-Q","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":4,"funny":0,"cool":0,"text":"I used Buena Onda to help cater a birthday party for 30+ guests. Tomas and Matias could not have been more helpful! They made the entire process- from deciding what & how much to order to delivery and heating instructions- so simple and easy, not to mention they were extraordinarily patient with all of my questions and decision-making :) The empanadas were outstanding- a HUGE hit and the highlight of the party - we couldn't get enough of them or the chimichurri! Highly recommend for any event, will definitely be using them again! Thank you Buena Onda!","date":"2016-02-23 00:52:49"}
{"review_id":"7XzxgP5g2bKSWpwoMG9iJg","user_id":"k0LL1-O6wRozWRCe_THiVA","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"I love the empanadas here. Whenever I come up from Ventura on a day trip I try to make sure I stay past 4 p.m. even if it means I get stuck in traffic, just so I can stop by here. It looks like they might have started opening for limited lunch hours!!!\n\nThe empanadas have a wonderful filling to dough ratio. Both the filling and the dough are wonderfully flavorful. Their chimichurri sauce is on point. \n\nDeciding what to order? \n\nThe Carne is a delicious and flavorful ground beef empanada which is most closest to a traditional empanada. Hands down my favorite of the meat options. Doesn't need the chimichurri, but if it's provided, why not? \n\nPollo is shredded chicken. It's not as flavorful as the Carne is. Better for people who like really mild flavors. One of the few empanadas that need the chimichurri to be perfect. \n\nI love my meat, but the Quinoa empanada is one of the few things that I would find to be on par with any meat dish. This is such a wonderful balance with the quinoa, feta, garlic, peppers and other delicious veggies. It would really be a shame if you missed out on this one. It's a favorite on par with the Carne. \n\nProsciutto is nice. You can identify the slices of meat swimming in the cheese. It's a very tempting option as I have never run across a prosciutto empanada before. While it's worth a try, if I'm limited to three choices this is an easy skip. It's more cheese heavy than prosciutto and the grease that results is a contrast from their normally flavorful and clean tasting flavors.\n\nSuiza is the veggie and cheese heavy option. If given a choice I like the tart balance of the feta in the quinoa over this one. However, if you are a huge garlic and cheese lover, this may very easily be your favorite. Super wonderful and flavorful. \n\nHongo\/fugazette- I love mushroom. And I love what Buena Onda does with mushrooms. They are lovingly sautéed, lovingly seasoned, and lovingly stuffed and baked. When they were out of the fugazette (mushrooms, onions and bleu cheese) I was in a period of serious mourning. I'm glad they brought back a mushroom in the form of the Hongo (now with mozzarella). \n\nVegan- unless you are a vegan, I would keep to the rest of the empanadas. Do not get me wrong...This will kick the butt of any street vendors empanada, or any fancy sit down restaurant. That being said, there are so many better and taster options here. \n\nI love this place. At $3.50 an empanada it is very reasonable. They do not skimp on the filling. The ingredients that they use are clearly a cut above once you take the first bite. The chimichurri is a perfect match. The people are lovely and if you happen to want to wait at Telegraph Brewing, they will walk your order over. This is hands down my favorite empanadas and my favorite place to come to in Santa Barbara. \n\nPro tip: call your order in and it will be waiting for you. \n\nWhat are you waiting for? Stop on by! Go in for lunch, bring some to a work potluck and be called a culinary hero! Just help this place take over the world :) they are just that good!","date":"2018-09-30 00:31:27"}
{"review_id":"2MRCnImC140Do--4Rhd1Ng","user_id":"fOFwCKZr30YXTZFXosJ4lg","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":1,"funny":0,"cool":0,"text":"I've been hearing lots of great buzz about this place, so I decided I needed to come see for myself! Wow, I rarely have met an empanada I don't like, but these are the best I can recall having...at least from recent memory.\n\nThe group I went with ordered a wide variety, but the two that stood out most to me was the carne and quinoa empanada. So fresh, with just the right crisp to the crust. They were also quite generously stuffed which is always appreciated when it comes to empanada appreciation. \n\nEven though the place was steadily busy, the line moved quite quickly. It's safe to say I will be returning soon!","date":"2017-10-15 05:52:37"}
{"review_id":"c4ukkll2rT1oG6R8TidUrA","user_id":"-6PCMZss7Bc-jO7tkTYoZw","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"Just enjoyed 4 different empanadas; carne, pollo, suiza, caprese. They were all great","date":"2018-04-26 01:53:23"}
{"review_id":"nfsD3fmIZmmFyGxhLWfP2w","user_id":"yBW8YsfCCj6SlIbGke0gPg","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":6,"funny":3,"cool":3,"text":"It looked like i was going to have to cook this week for a gang of people intent on watching all 2 seasons of Twin Peaks that first aired 25 years ago in preparation for the reboot of the show which was going to broadcast on Sunday evening.\nSince i didn't want to cook and i needed something that is easily served and consumed i thought about this place as a remedy.\ni had heard through the grapevine and fellow Yelpers that Buena Onda (Good Wave, literally ) was the place for Empanadas in SB.\nIt is a little hard to find but well worth the search.  It's inside of an open gated parking lot just adjacent to the mini mart. Along with being hard to find, Buena Onda is closed Sun-Tuesday and then opens at 4 pm on the other days. Plan accordingly.\nTwo good looking Argentinos (people from Argentina tend to be good looking for some reason) took my order of a dozen (3 Caprese, 3 Pollo, 3 Carne (beef) and 3 Suiza).\nI did not realize coming in that the Empies are made to order and would arrive piping hot. So  all i had to do was open the box and run from the red eyed, crazed Twin Peaks horde hungry for blood but settling for Empanadas i'm thinking. I cut off the end of all varieties so that i could sample.\nFirst of all the dough. The dough was very special: firm yet velvety, buttery: melting on the tongue as it finally releases its fillings which are another story of goodness. An Empanada dough has to be hearty enough to hold the fillings in without melting away to nothing  yet tender enough to caress your teeth not break them. I've had bad Empanada dough so i know of what i speak.\nCaprese: tomatoes, mozzarella, basil, olive oil. simple, amazingly good stuff. I love caprese Salads, Pasta and i love this product.\nPollo: pulled chicken, bell peppers, onions and some spice. Not my favorite but the Twin Peaks horde liked this very much.\nCarne Picata: ground beef, olives, hard boiled egg. Reminds me of a stuffed beef item called Matambre i had in Buenas Aires years ago. Delicious.\nSuiza: Brie (yes, melted scrumptious Brie), Swiss Chard and Sage. My favorite. All melty brie and nutty, slightly spicy Swiss chard . Yum.\nWe dipped these in the Argentinian version of Salsa, Chimichurri which is chock full of herbs, garlic and olive oil. I  should have ordered extra but instead we used a bowl of Roasted Pasilla chili salsa i made earlier in the day that worked very well.\nThough I don't know for sure i'm assuming that the Buena Onda use their terrific dough to encase all manner of luscious fillings not on the menu that day like maybe spinach and feta? Or mushrooms and swiss?\nIn any event, the Twin Peakers only made it through 10 episodes and the mantras of the night were, not suprisingly : \"I am Dead yet I Live\" and \"Fire Walk with Me.\"","date":"2017-05-22 23:43:19"}
{"review_id":"vpwZAoAylIKlhKHOaa1eAA","user_id":"fU3CH6xLR7-AD9d5NDGu3A","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":3.0,"useful":0,"funny":1,"cool":0,"text":"The food was ok, but to me it seems that they tax way more than the usual tax, they don't provide receipts, when asked he did not know what to answer, the amount is much more after the taxes are amount it, so I don't know if that is like a extra 5 percent tip.","date":"2018-06-20 02:51:02"}
{"review_id":"8WxRi1sKiRpan1-yOkA9Jg","user_id":"haDzNVqFlU8Tn7QDNORRbQ","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"The empanadas are amazing.  I ordered a ton for my employees for lunch and they went faster than any other lunch we've had.  The chimmicurri amazing!","date":"2018-05-17 20:12:44"}
{"review_id":"Cy1GPbKX4Ke-ev1Rzwt0Jg","user_id":"375lszn2QrZUdmwsb-aHFA","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"First time I tried it! Wow. Amazing. Carnitas was absolutely delicious. Got it for delivery and wish I ordered more! 12\/10.","date":"2018-10-21 03:49:58"}
{"review_id":"JJc9VAnxy22qbxWfRHLtqg","user_id":"Rea7ThD4cB_pbNTz2wUeIA","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"Absolutely Off The Wall good. If you like awesome authentic food, you are home. 5 Yum Yums, from where I come from. Find 'em, eat 'em, and enjoy them.","date":"2017-06-26 00:51:15"}
{"review_id":"kj2-pBmPxZOGMh-HXNIGPg","user_id":"_G5YGuHhKCI3p2fIdyDNIg","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"Try this place, you gonna love it! \nFresh ingredients, meat and a lot of veggie options. I really liked every combination that we tried, though the one with chicken was really something! \nWe ordered half-dozen and it was a perfect portion for two. \nThey also have a parking lot that makes the pick up or dining options easier.","date":"2018-09-21 20:38:37"}
{"review_id":"AB6tpAFV1Z9jtpaSbjXbLg","user_id":"muuvOcdZyj7RNNb2mU4gtg","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"Wow! They truly have a magic recipe. Don't know how, but every time I dine there, I'm blown away by the quality and flavor of their empanadas. The Ground Beef is my favorite but they have many other selections for vegetarians.","date":"2019-04-03 19:40:33"}
{"review_id":"8_zFJZShJ4LqU6um8Wz7SA","user_id":"S0AbduPK7GSNLSZ08t7qjA","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":1,"funny":0,"cool":0,"text":"It's a order to bake setting. You can order on-line and pick it up when you're ready. Chimichuri was really good and refreshing. Ordered one of each and they are all great! Crust is not thick and all the fillings are tasty. They have two vegan options.","date":"2017-10-22 02:54:02"}
{"review_id":"n2uNEbSfR9_wNBs0Z6r4Ww","user_id":"rA9uFy77mkVHGr-wWLR5EQ","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"Fantastic empanadas.  Variety is great, every one has been wonderful.  My favorite is the Caprese.","date":"2018-10-16 19:30:01"}
{"review_id":"Lj-1h2rDQnaEo3-Q0M3q0Q","user_id":"xceIOE5njGxwuewrEVqziw","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"Great empanadas!!! watching football needed something delivered .. found this place fast  delivery's and great tasting food !! Great job guys ! Nice too have something\nHeathy and tasty !  Also , didn't have to drive while drinking ! Something besides   pizza . Swill eat them again soon!! Thanks","date":"2019-01-13 04:42:55"}
{"review_id":"lqonRmZ_llnd6Bx97KyDEw","user_id":"nx2rpQXBiAWp6E8f9P9ufw","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"This place is great! I was in the area and decided to give this place a try. The owners were very cool and helped me figure out what to order. I will be back!!","date":"2019-01-21 20:46:41"}
{"review_id":"-QEhqNJadeVD_w9z0EojhA","user_id":"2BstVoMi_I9Lkpj5aO_Hqw","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"So delicious! The Chimichurri is  absolutely phenomenal. I could drink it with a straw.","date":"2019-04-25 03:48:26"}
{"review_id":"V1qLvIcSI9LSUvVbaybntA","user_id":"xaaDUJa_mfKELzl2_yIOeA","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"Best empanadas I've ever had, hands down. They are delicious, handmade, everyone there is really friendly, warm and inviting. I dream about these empanadas.","date":"2017-11-14 05:20:38"}
{"review_id":"yVhhqDhIhrus3GskGw9zpQ","user_id":"uLxuqyU1gtksp55qU-HJUQ","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":1,"funny":0,"cool":0,"text":"Great beef empanadas. Authentic Argentinian flavor. Don't forget to buy some dessert empanadas, you won't be disappointed.","date":"2019-06-23 23:16:43"}
{"review_id":"JTkmlaxZurK1ZgESpfjNJQ","user_id":"abSBvxp3OvIWaCHm6Drivg","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":4.0,"useful":0,"funny":0,"cool":0,"text":"Very good food and I like the environment also.  Great vacation spot.  I will be back.","date":"2019-07-04 20:45:26"}
{"review_id":"Uz80czsWAfUMgPaidrAQ4w","user_id":"1nIluiEmuFimr07T_NbUWw","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"Really tasty juicy empanadas! We chose the meat, chicken, mushroom, and quinoa ones. They were so good especially with their chimichurri sauce (which is an argentine pesto). Their outside patio is so cute to sit and relax!  Definitely will be coming back next time we are in Santa Barbara.","date":"2019-04-03 21:37:55"}
{"review_id":"ryoo5nKVa4mn8WLXiwrMSA","user_id":"8HNgp3ZP1iAeoqfuGnFkRw","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"We used Buena Onda for our wedding and we are SO glad we did! Working with Matias during the planning process was an extremely smooth experience. He and his staff went above and beyond on the day of the event and our guests raved about the delicious empanadas and salads that Buena Onda provided! Highly recommend Buena Onda!!!","date":"2018-11-05 19:06:42"}
{"review_id":"7BS0cKwmh17cWzhY8UwwkQ","user_id":"bAkYwM6gsJoOqHj81dbwvQ","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"Best empanadas. Now I won't be excited by most. I hope I can find similar quality up in the Bay Area now that I know how the can taste. A must try. Great the next day too.","date":"2019-03-04 00:26:57"}
{"review_id":"RIsqNh2VWX9unISW-QYIhA","user_id":"RgsxXOPEnd0VGyD-W2Xs0w","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":1,"funny":0,"cool":0,"text":"OMG!  These are the best empanadas I have ever had.  I wish they were open today so I could have got their empanadas instead of the crappy calzone from Nutbelly.  If I lived here in Santa Barbara I would eat here once or twice a week.  I can't wait until Wednesday when I can get some more of their phenomenal empanadas.  My favorite was the Caprese but I tried the beef, chicken, onion\/corn, mushroom and prosciutto ones too and they were all amazing as well.  You have not lived if you haven't had these empanadas.  This is by far one of the best places I have ever been.","date":"2018-12-04 03:39:15"}
{"review_id":"TdYYDnPzG1mzevJEzTSnrw","user_id":"0sCoAM1rwTrA7Co9WdOPWQ","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":2,"funny":1,"cool":1,"text":"The best empanadas in Santa Barbara! You can taste the quality all organic ingredients in the empanadas, from the chicken to the tomatoes! \n\nI would say get a dozen to try them all :) Our favorites are Pollo, Caprese, Carne and the Suiza.\n\nWe have tried both Salsa of the day and their classic Chimichurri (Italian Parley, garlic, olive oil, and vinegar) and both are amazing. \n\nSorry! No picture (because they disappear too fast! I will try to control the troops next time).","date":"2016-12-14 14:13:10"}
{"review_id":"J62woSIt5PjSs7uqomHNng","user_id":"44aidri6xsZhMVBYnTAaAw","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"I have the SBMenus app and saw this place had empanadas. I've been wanting to try them for some time now so I thought this was perfect. I got 2 quinoa empanadas along with their sauce. The empanadas were soooo good alone or dipped. Super tasty! I am very pleased with their service, it was quick and my food was hot! I also really liked their take out packaging, super cute! Definitely recommend this place! \n\nOh and they vegan option!","date":"2018-04-14 00:05:54"}
{"review_id":"iuuHScDcsZn4M7UK4iPmIw","user_id":"UB8-EyCq0Y829tBwRSrPRA","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":0,"funny":0,"cool":1,"text":"Stopped in to give this place a try and it did not disappoint. I had the pollo (chicken) and prosciutto, and if I was really hungry I could have eaten two more. Cool spot. Staff was helpful and friendly!","date":"2019-08-30 04:47:26"}
{"review_id":"0IUPHRYonTlhHFgpm7FNag","user_id":"z5672mz9Gau2SwDres-tsA","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"This was my first time trying empanadas and I was blown away. So good and so fresh. Thank you! : )","date":"2018-11-04 22:29:57"}
{"review_id":"VXBjHeO8XqYXuzcL4dCwYQ","user_id":"6ejDKRKnRniQ7sQCf45YYw","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"These are so delicious! Just went for the first time and ordered the Prosciutto, Hongos, Quinoa, and Suiza. All were extremely delicious. The Quinoa, in particular, was super satisfying. Also loved the dipping sauce that they came with. \n\nAnother plus, not good related, is that they have their own little parking lot.","date":"2019-02-27 22:14:38"}
{"review_id":"xltv7T2Ydei2HnpJwhGWsg","user_id":"g-5Urdj2K3kj7qVtfL-uwQ","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"I love empanadas and I found this gem on my walk down State st. I was welcomed and greeted kindly by a lovely and super cool human being, Sophie, who took the time to describe the options and her favorites. I ended up getting the Chicken, hongas, and carne. I definitely would order the chicken and hongas again. The carne was good but i liked the other two better. Overall, they are super filling and flavorful! The sauce that comes with the empanadas is amazing and adds to the flavor. Empanada love was complete. \n\nShoutout to Argentinian Sophie! You rock!","date":"2019-05-02 04:16:47"}
{"review_id":"NRdLU-wmwTKgF1O9mshK2Q","user_id":"ZSn-67mFZZaoiacWPZY3Jw","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":1,"funny":0,"cool":0,"text":"Excellent empanadas. The chicken and the vegan ones are my favorites. It tastes just like being in Buenos Aires.","date":"2018-08-23 23:11:44"}
{"review_id":"IytXcau1_n_SloNjbJRo1w","user_id":"VpXRuYDoJbzmwUWpqk6YXg","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"Surprisingly yummy. This is the first time we try this snack and we immediately love it. I like the beef flavor. The seasoning is just right. Came out of the oven hot and juicy. So yum.","date":"2019-08-01 03:44:00"}
{"review_id":"Fmhv3sBt6enZy_fRtqskqw","user_id":"X-v59fzE40RP85wU6_KSrA","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"These are the BEST empanadas in Santa Barbara!  I buy a dozen for my freezer to have on hand, as well as I take fresh ones to potluck parties with the chimichurri sauce and they are the first to go!\n\nCheck them out...it's more than worth it!","date":"2018-07-31 22:38:23"}
{"review_id":"oatvh30iC0HlmDovK-c4kw","user_id":"DJiJauO6V7zFRf7i-41NbA","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"Wow, these are some of the best! Lots of choices, and even a vegan friendly one. I'm definitely coming here again!","date":"2018-11-25 00:41:38"}
{"review_id":"R9Ox8v3Y7lyTh026uEPnEA","user_id":"KZvkTACnoMh_GVKrg6bXbg","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":4.0,"useful":1,"funny":0,"cool":0,"text":"Cute and tasty empanada spot in Santa Barbara!  The smell was amazing! Aqs soon as we got out of the car it made my mouth water!  \nThe only thing that kept it from 5 stars was the wait...however empanadas were fresh!  I loved the cozy little eat-in courtyard!  However if your a large group, order ahead and take them to the beach and enjoy! I will definitely add this to my places to frequent!","date":"2018-06-10 02:57:12"}
{"review_id":"kQpYaoQjSVlJrFuep1E3jA","user_id":"tccqmDYtgvBpAjRD09i_ow","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":1,"funny":0,"cool":0,"text":"Who knew this was here. Wonderful! Best pastry dough and multiple filling choices. Can't wait to try them all! Had the Caprese and the the prosciutto. My friend had a pollo and a Carne...both excellent. We'll be back....soon","date":"2019-11-02 19:54:18"}
{"review_id":"KU1YwKa_OH4TaVuJtLWfhw","user_id":"AOC9sOWK-KJnGeQIBlih5w","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"they will make empenadas to order! i don't like olives, and it's normally in the ground beef empenadas.","date":"2017-09-20 14:15:01"}
{"review_id":"rbfUsVgc2ezAwo0HmhLj0Q","user_id":"l1v5QX6HGnzQN8y0FkGqrg","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"Best Chicken empanadas I've ever had in my life!! Got a delivery to pure order brewery around the block! Great customer service .","date":"2019-07-21 01:21:51"}
{"review_id":"u_yWcjgQcW5AXlbt9f2CgA","user_id":"A-8NRTkVMDcU4a5WXscqUg","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"Loved it! Everything tasted fresh and homemade. They came out piping hot and even still tasted good a few hours later. I can't even say that any one flavor was my favorite because I liked all the ones I tried. I will definitely be returning!","date":"2019-10-12 00:17:56"}
{"review_id":"hrNxsNK0_OqULjgIjioXFg","user_id":"HA7WfvOfewUl6ht0de5-ZQ","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"Fresh. Delicious. Don't forget to get the chimi papas. Outdoor seating ambiance is cool, and the music being played was pleasant. Great place to bring a small group and order a half dozen empanadas since they offer a good amount of options.","date":"2019-08-27 23:46:35"}
{"review_id":"qhjvG-tmusFbe1jJNguctA","user_id":"iOnTw66MvStkGi5sQLPoig","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":4.0,"useful":0,"funny":0,"cool":1,"text":"Tried the chicken, carne, and proscuitto empanadas. I liked the carne and proscuitto ones, the chicken not so much. I really like the gooey mozzarella in the proscuitto ones. I'm not a huge fan of chicken to begin with, so there's that. Minimal seating, but I heard that they're working on increasing that. Indoor bar seating and outdoor tables with heaters (brought the dog too!). The place itself is a bit tucked away from the street, but there's a small parking lot which is nice since it's not always easy finding street parking. Service was great too.","date":"2018-09-30 02:06:30"}
{"review_id":"_hgYM4Fr85RIZomgPsvKFg","user_id":"ktu1CewxzQzQQjPCt8FKuw","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"Everything about this place was great! The outdoor seating was really cute and the food was delicious. I got the pollo and carne and I think the pollo was an all around favorite for everyone I was with. Only downside was how burnt my tongue was after because I was too impatient to wait for the food to cool down!","date":"2019-07-05 18:11:39"}
{"review_id":"rznTaeeU-DA4yLC3Won9dg","user_id":"WoFRcMgTu4KXOiuasdIAKA","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"Though the service is leisurely, the food and atmosphere are great! The corn empanadas were to die for, and everything was incredibly fresh. Sitting outside made the experience all the better. So nice for a late lunch, highly recommend!","date":"2019-07-21 21:20:24"}
{"review_id":"5xck3eiIQRhyCL9Fb7thKQ","user_id":"AbDi7tix74wiVLRgszo33w","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"I'm Crazy about this place, they're food is outstanding, the service is spot on, I would recommend this place over most in Santa Barbara!","date":"2019-07-07 02:25:50"}
{"review_id":"gRPUnXxQvQ6dtQDUzRaOqw","user_id":"RtOOUWw6OjqehpC-q9yM2w","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"These were amazing. Caprese were the family favorite. Prosciutto was too salty for me, but I think that's the way it's supposed to be. Also loved the quinoa with goat cheese. We took a dozen to the beach for a picnic. Awesome!","date":"2019-07-25 15:52:03"}
{"review_id":"bET-uVaFI7eMsrsB6fxNAw","user_id":"l1v5QX6HGnzQN8y0FkGqrg","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"These guys know how to make an empanada let me tell you! I came across this place about a year ago and was surprised with the great customer service and entrepreneurship this place was filled with! Being a small business owner myself,  I can totally say these guys are on the right track! Keep up the good work ! See you guys soon (:","date":"2018-08-09 11:24:46"}
{"review_id":"05n1FVa5esHLdDIVf3Ci6w","user_id":"3BG_pWdTfHK09enLLrPnpA","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"wish i had found this place sooner! easy take out. good food, good vibes. will definitely be back. super stoked on this neighborhood family run spot. I think the pollo empanada was my favorite but the quinoa one was up there too!","date":"2018-01-20 03:14:46"}
{"review_id":"4f9jo0qOwRIyb4E-ux5cMw","user_id":"8SvYUOC_d51ko1AyLeybUQ","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"Real good stuff here! Empanadas are real fresh and very tasty. The people serving are very nice too and very reasonable prices...","date":"2018-10-07 00:52:52"}
{"review_id":"4IUD7UCLMKlX4xTlOLAGCQ","user_id":"DcASFSPGIQfpogj34tXjPw","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":1,"funny":0,"cool":0,"text":"Stopped by here on our way home to LA from a day trip from Santa Ynez.\n\nOrdered the beef empanada and it was amazing. Specially when topped with their chimichuri sauce.\n\nWill surely go back and grab a dozen.  They have niice cozy outdoor patio seating w\/ Patio heaters. Great place to hang out and grab some empanadas and Mexican Coke this summer.","date":"2019-06-02 17:37:38"}
{"review_id":"tPLU0Hj-d9Ah1WriPkcHjw","user_id":"cVNOxKXZ4xMGea355YcI4w","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"These are the best empanadas and chimichurri I've ever had and I eat here EVERY TIME I'm in the area, sometimes I come all the way from Goleta lol my favorites are the humitas and veganas and I DROWN each empanada in an entire container of their churri  EAT THERE NOOOOWWWWWWW","date":"2019-11-23 01:15:47"}
{"review_id":"qBG2m7CNnGhTgb7bAtB1NA","user_id":"J-1GYe6Ogq5tMixaUOFafA","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"Best empanadas outside of Buenos Aires. Traditional flavors of Argentinian cuisine. Will definitely be back.","date":"2018-11-10 19:27:51"}
{"review_id":"kONGQHdFOLHB8DecDO8vxw","user_id":"yqk7_xc2bO0Rs7PHygnlIw","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":3.0,"useful":0,"funny":0,"cool":0,"text":"Meh.  Price is good but not great. Empanadas are good not great.  Variety is lacking.  Parking is around the corner and is free if you stay less than 90 minutes.","date":"2019-06-15 01:40:03"}
{"review_id":"hqRp_tfeh3iWG9YUgcFY8A","user_id":"YcgH7TqJHfF1V-uump8gng","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"Great!!! Honestly sooo sooo good! Cute little location on Haley street. Some seating and lights outside.  I shared 4 different empanadas and honestly loved each one! Good service.  10 \/ 10 recommend and will return!","date":"2018-10-05 05:41:47"}
{"review_id":"vzdKPT9SUHisLh4c4rWGEQ","user_id":"yrZTGZU_aHtVeDO-P7chKA","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"This place is amazing! The guy at the counter is always the sweetest and super friendly! In addition to the great customer service, the food is so good. I came here once with one friend and we ordered half a dozen. This time with 2 other friends, we got a dozen and it was more than enough for us. My favorite empanadas were the prosciutto and caprese one!! We weren't really a fan of the quinoa one. It's also really cute how the empanada shapes match the menu so you can try to match them up if you forget which is which! Would recommend this place to everyone!!","date":"2019-05-03 22:46:26"}
{"review_id":"JIpVWNnybVrBORKzhek1jA","user_id":"ijV7Ik3xtgxcTv9KmJ_-rQ","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":3,"funny":0,"cool":1,"text":"This is the hidden gem inside Santa Barbara. I first found this place at the food section in the park during a festival in town. Wood oven empanadas hand made??!! Yes please It's run by some super friendly people who really do craft quality food made with love and it can be tasted in the food they make. It is a \"pop up\" restaurant so you'll have to order your empanadas online and then pick them up, some days they offer pick up in store but the inventory sells out fast. I have tried all of the empanadas they offer and can say they are all worth trying. From their veggie offering to the chicken or beef you will be pleased with the empanada you eat. I would suggest ordering at least one dozen at a time and eating them through your week. Great food made by great people. 5\/5","date":"2016-05-29 02:51:06"}
{"review_id":"-Zkfi0O3OWFK-gpfhA6YHg","user_id":"EleQKGrUDo_-zvpfOVHYMQ","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":11,"funny":4,"cool":9,"text":"location easily passed it twice while driving, so decided to walk and found # 724, as there is no sign outside.  It's set for a pick up of orders but with a nice table outside, a true dive.  The gentleman that took the order was very pleasant, looks like his wife is making the empanadas fresh to order and his\/her mum manning the oven.  A true little family operation.\n\nOrganic beef, chicken and prechutto  are fabulous!! Crispy from outside, great tasting meat, and the chimichurri sauce is fresh and tangy.","date":"2016-11-12 01:40:09"}
{"review_id":"67s8vHcozWP8Op6yKp-Sbw","user_id":"d7uWrNKUAgywq3Tus6Hc5w","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":4.0,"useful":0,"funny":0,"cool":0,"text":"Lovely hidden place it's a cool area. It feels like you are somewhere also. Also, close enough to walk to other spots also.","date":"2019-08-18 01:07:07"}
{"review_id":"woGgHCNFw0i7u0JafILdzQ","user_id":"6kL752YA-cVbcwSqX0GsRg","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":1,"funny":1,"cool":1,"text":"This place is ridiculously good! Ordered one of each on the menu and they were all amazing! The customer service was great too as they gave us a map and advised us on where to go get drinks and have a good time! Above and beyond service and food!","date":"2019-02-24 18:08:42"}
{"review_id":"pvbPMCHt7lG-QFZ3Scvg-g","user_id":"f01GXCvVk3Ciu4muG9lYeg","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"Satisfying. Family style family loved. The carne is juicy, savory, delicious and not over seasoned. The pollo is like homey chicken stew. The mushroom is savory with yummy greens. The prosciutto was delectably cheesy, as was the caprase.  Nice people. The pastries were light and tender.  Highly recommend.","date":"2018-12-29 03:30:15"}
{"review_id":"DUrhqT-SlJf-KXmfwrPr_Q","user_id":"slhaL04_HKsEsTtmaCpfsA","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"Wow. These empanadas are insanely delicious. Ordered a dozen for delivery last night, three different flavors. Each flavor became \"my favorite\" - all so flavorful and baked perfectly. Today, I ate two of the leftovers for lunch, and the only reason I'm not eating more this very minute is because I want the rest for dinner. Will DEFINITELY be getting more empanadas from these guys.","date":"2019-02-28 22:51:29"}
{"review_id":"oEFLzrCJWvNh6j3cD0ozsA","user_id":"VlWLg90NVjpVHYr1QZSJNw","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":8,"funny":2,"cool":8,"text":"Wow! I just discovered this place and gave it a try for the first time yesterday- it was AMAZING. They make each empanada to order so they always taste hot and fresh! I ordered a half dozen to share with my boyfriend and we split them and tasted 6 different empanadas. I wish I could give a recommendation for a specific empanada, but the truth is, I was impressed with every single one that I tried (I'm sure the few we didn't get to try are just as good). I would say though, order multiple different ones to split and share with a friend or two so that you can get a little taste of all of them!\nA few notes about this place: their isn't a ton of seating so I'd suggest ordering for take out or have it delivered. I'd also suggest calling in your order ahead because sometimes they're a bit busy and like I said above, everything is made to order so it takes a bit. For those with meat\/animal product restrictions- they have vegan and vegetarian options so there's something for everyone! They have strange days\/hours they're open so I'd check before you head over.\nOverall, I'd recommend this place to all my friends and family looking to fill that empanada craving or just looking to grab a small bite!","date":"2018-10-25 20:22:39"}
{"review_id":"pvHVROBu3-jbsJEFrqVYXA","user_id":"YLQbiqEm64_kCGHrpPQqbw","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"We got 4 empanadas all of which were awesome. We tried the Caprese, Suiza, hongos, and Vegan. My favorite was surprisingly the vegan. It had the nicest seasoned flavor for my tastes. Of the cheesy ones I think I liked the hongos it was very savory. The others were nice to but my main stay would be the vegan. Careful it's a one way street and those are tricky for dumbasses like me.","date":"2018-09-02 03:25:32"}
{"review_id":"6zfvOxK2njJ0Zry5o_34nQ","user_id":"NhVRpzznqo7jky-MSwCphw","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"10\/10 would recommend this place! I saw this on Yelp and it had great reviews so I decided to try it. Wow, that was the best decision I have made. The empanadas exceeded my expectations and more! The best part is it is very reasonably priced and such a hidden little gem in Santa Barbara!","date":"2019-07-18 04:56:21"}
{"review_id":"8UZoy5qWZfHh5_PNzILLSQ","user_id":"_VcXcsgNpvm41g0CN8XlKA","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"What a great find!!  The food is excellent, wait is not long, place is clean, people are helpful--what more can you ask for? I had the chicken, beef and a special pork one and would order them all again. The sauce is to die for. Great cold also the next day. Do wish you could somehow label them in the box to tell which is which. YUM!!","date":"2019-05-02 19:06:09"}
{"review_id":"s1swbAX_8afKxE_1YUDsoQ","user_id":"FBt7YqWFDhDHUyKyd75P_A","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":0,"funny":0,"cool":1,"text":"Very yummy and comfort food. It's not to heavy and great flavor! Very happy we found this little gem!","date":"2020-10-18 00:32:01"}
{"review_id":"kueveDPZyQeTBbWb05QYGg","user_id":"PA7wh5pQK6NuqlxTGXyvYA","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":1,"funny":0,"cool":1,"text":"I've enjoyed their empanadas more than once. The first time we were enjoying a trivia night in the Laguna district area and had them delivered. Delicious and reasonably priced. I met a friend at Mosaic Locale and enjoyed a beer with my empanadas that time. Great combo. I've tried most every flavor and have have never been disappointed. The sauce is a nice touch but also good without it! A friend and I walked there for a bite one day-she hadn't been and her husband isn't an empanada fan so we went. Again, delicious and will go again.","date":"2020-01-04 17:40:20"}
{"review_id":"sQ4qTb5CQ-vvBd7blAhJ7w","user_id":"WaSxJ12DLd8j9fBspniJbA","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":0,"funny":0,"cool":1,"text":"Oh my goodness - these Brazilian empanadas are fantastic! I love almost all ethnic dumplings but these are the best. Great selection of both meat and veg choices. Fast service and they even give you a map so you know which empanadas are which!","date":"2020-09-02 22:37:44"}
{"review_id":"Ut2uiFVsOsDo-fSxuTS3ig","user_id":"ZQnn0lz7Aebawx1GPne0sA","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":4.0,"useful":0,"funny":0,"cool":0,"text":"Sooooo worth it. These empanadas are super good- the only bummer is that they're pre-made (and just cooked, I think) so there aren't any substitutions available. Get the caprese!!!","date":"2019-05-26 18:56:49"}
{"review_id":"hFXvXUOGOiAinSvQIpKNuA","user_id":"OhECKhQEexFypOMY6kypRw","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":1,"funny":0,"cool":0,"text":"We were looking for a quick lunch with kids, and found Buena Onda on Yelp. My husband had tried some of their empanadas because they've catered at his work. We tried the Bondi (daily special - pork, onion, green pepper) and the Prosciutto (prosciutto, cheese, and arugula). We made them combos (1 small combo and one large combo easily fed our family of four - 4 yo and 6 yo). One combo with the salad, and one with papas. They had great customer service, delicious food, and good prices. Great experience, and will be visiting often!","date":"2020-02-08 20:40:22"}
{"review_id":"Btec08jW7NdfvI0rOXFcRg","user_id":"87L_amkNITmdmLhuCgUZmA","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":4.0,"useful":3,"funny":2,"cool":3,"text":"Our cousins rented a place 2 blocks away and we're craving for good food on the third day. We googled nearby places and Bueana Onda popped up. Walked over or lunch and the Matias and Elena were like the best host\nWe chose a table inside and proceeded to place our orders, We selected Pollo, Caprese, Suiza and my cousin went mad after Carne. Food arrives promptly and was vanished very fast as well :)\nCravings satisfied.. A delightful experience and a loving memory\n\n@Matias\/ Elena , Keep ppl taste buds thrilling :)","date":"2017-05-29 00:46:43"}
{"review_id":"09shxzs1kmBnEf-whNrfYg","user_id":"2LS-bKsDeFaTTA386bKX9g","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"Great atmosphere, wonderful food and a relaxing feel. We both loved the prosciutto one the best, the caprese is a close second! Yum!","date":"2019-08-13 22:51:40"}
{"review_id":"NuAehOd4PTl2AoCn0rSstA","user_id":"NCBTmNacUlbBEfl-XILjGg","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":2,"funny":0,"cool":1,"text":"In retrospect, it's probably for the best that I don't live within an hour of Buena Onda, or I'd likely turn into a caprese empanada. DELICIOUS. My husband and I grabbed a half dozen to take back to Los Angeles and enjoy... only two were left by the time we got home, and that was because we forced ourselves to save one each for an afternoon snack. Other favorites: humita and serrano","date":"2020-07-03 19:20:20"}
{"review_id":"RsBl1svdB1TuXABEERL7Yg","user_id":"eL8pacheOrs2UTkHuFoktA","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"There is seating!  Its limited but since its not too crowded of a place, it was pretty easy to snag one of the tables out front.  The ambience was lovely.  There are a lot of pretty plants surrounding the place and they play nice Spanish music.  The service was great.  You order inside and then sit outside and they bring it to you. The empanadas themselves were top notch.  I would recommend the carne and the corn one which was a special. I usually don't eat meat but they use ethically sourced meat such as Mary's free range chicken and grass fed beef.  I am always happy to support businesses that show compassion in how they source their products.  I look forward to returning to try more.  I hear they will have salads soon.  Oh and the empanadas are all slightly different shapes so you can differentiate which is which.","date":"2018-05-27 03:26:38"}
{"review_id":"NSQpV08zqjCTwUsNpEvLkQ","user_id":"H_nBhMeFhQiDndbBsMx6KA","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"Just saw 101 5 star reviews and love empanadas so couldn't resist. Wow, every star earned. Food is fantastic. We tried many varieties and all were really good. Highly recommend.","date":"2019-01-26 22:12:24"}
{"review_id":"rc2e4NNuV61S0pFjv3Rl1Q","user_id":"Yf0JwS-Zr2DQlk73TDzVLA","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":4.0,"useful":0,"funny":0,"cool":0,"text":"Missed seeing the driveway on my way past but it was pretty easy to find street parking and the lot only holds a few cars anyway.  Found this spot on Yelp hoping  to pick up something easily transportable after a long day in SBA to bring to my mother's as a treat... and it was!  \n\nWe're trying to ease off of meat so I got 2 hongo, 2 suiza and 2 caprese.  They serve them to you warm in an eco-friendly box and will even forgo the bag if you want.  I normally don't like sauces, but the chimichurri dip is a must to fully enjoy these treats.  The pastry is a delight.  Strong enough to contain their contents yet delicately thin enough not to overwhelm their flavor. \n\nThe only issue is that I discovered how lactose intolerant I am and sadly can only tolerate the suiza which is not my favorite.  Loved the hongo but sadly, can't eat them anymore.  :(  Old age is killing me!","date":"2021-01-20 05:07:36"}
{"review_id":"OEIaJgstGY3Rxcj4gOl_jA","user_id":"0Bn6vMATtHJF863JjXCFdw","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"SOOOOOOOO DANK. I ordered the Beef EmpanadaChicken Empanadas& Chimi Papas. Can't go wrong with that.","date":"2020-10-06 23:37:52"}
{"review_id":"PabRECw02zIzCcvzBF6X5A","user_id":"vQunuZSxXr3vFv_L2QYRSA","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"I tried 6 of the empanadas and they were all fantastic. Really light, flaky delicious dough and fillings. Awesome vibe and music there. Will come again","date":"2019-04-14 02:27:40"}
{"review_id":"OI6VA9rrGP2_3w-coNQGtg","user_id":"Irn3NQUJpOd_DYbFlgkJxg","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"Out of the way location Delicious empanadas and very welcoming service. No real indoor seating but The outdoor patio is great cool.","date":"2019-07-17 03:23:29"}
{"review_id":"7oh1QWaqmn6kkuwErvlNXw","user_id":"356LYZ6AY2rtOZeuBRIgmw","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"This place has super bomb empanadas. It is relatively inexpensive, but super filling. I've tried all of the empanadas and each one is as good as the one before. Notable mentions are the Gaucho and the Carne which I make sure to get every time. It wasn't a problem for me, but the cheese empanada had A LOT of cheese. There is another location on State street that I have been to too, and it's still really good, but they heat up the empanadas there whereas at this location, they make them in house, so I definitely recommend going to this one. I have definitely talked about this place to both my friends and family and highly recommend that you give it a try!","date":"2020-03-04 02:22:37"}
{"review_id":"0Sgiap5U-cZY1aBTCbtfIw","user_id":"HuvQoWqM3-CWX0cdBmGgzw","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"Best empanadas ever. Not greasy at all. We had the caprese and the hongos empanada with the chimi papás. Absolutely amazing. Their homemade coconut and dulce de leche alfajor is the best way to end the meal. This is our second time here, and we are coming back for sure.","date":"2021-02-20 21:07:38"}
{"review_id":"26bKxqQGH7GgoDJ1jYVP0Q","user_id":"ThRpODVRfDiqBLnSxpxY0A","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":1,"funny":0,"cool":0,"text":"Amazing empanadas, and the fact they sell Havana Alfahores is pretty cool, they're the only place i know that sells them in the US.","date":"2020-01-04 16:36:05"}
{"review_id":"w_IeCuKr_POZyc1qBJ6G6Q","user_id":"E-7M1tJJkOIJlxYzxItd_w","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":1,"funny":0,"cool":0,"text":"Definitely met my expectations and more. The empanadas were super fresh and flavorful. The smell of the empanadas are to die for and the taste is even better.","date":"2021-01-21 04:08:59"}
{"review_id":"levo5pbackgwHYBDQ0X2Sg","user_id":"71xrAG-ULA2Or7mr4Tpm-Q","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"So glad we stopped at this place. Empanadas carne was my favorite, especially with the Chimichurri sauce. I'm regretting not going back for more when we got into town. We were just passing through going home. Definitely when going up north we will make a stop at this place just for the carne. Get it! Try this place you will be drooling for more.","date":"2019-01-04 19:15:06"}
{"review_id":"JefAhKG0ltQwqnRfcKr-oA","user_id":"yxqHA0SYDPC3n9cHBriwSQ","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"We are from San Clemente and just had finished up a road trip from up north and had been headed home. We decided to stop in Santa Barbara for some lunch and Buena Onda popped up. We decided to give it a try and I'm so happy we did! We had some amazing food on our trip but I have to say the Empanadas from here were the BEST!!!! Such friendly staff and some of the best food We've eaten. I'm bummed we don't have one further south because we will be craving these until we have them again!","date":"2019-05-30 04:48:33"}
{"review_id":"nl4jjBS6-YzZe36SNdSmIQ","user_id":"I39nMOoh6HZX-tnBE33BoA","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":3,"funny":0,"cool":1,"text":"The vegan ones are DELICIOUS. I am not vegan, but I just preferred to order these ones and  they were to die for! They were fresh, and hot and cooked to perfection! Thank you, thank you, thank you!","date":"2020-07-13 04:10:35"}
{"review_id":"_JBuecOE_r6mr-TxMaoE2g","user_id":"CLhNk1qxzZIdcYNkF-OTjA","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"I like to try empanadas wherever I can find them, these are the best ones Ive had and cant imagine you could get any better.","date":"2019-07-17 21:30:56"}
{"review_id":"fIDVFsjdnJtfyo0gz6tYxA","user_id":"v2FTblR3oMdnYiPezt0k0w","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"Super delish and some of the best empanadas I've ever had. Don't skip this place. The prosciutto was the ultimate BEST!","date":"2019-10-08 03:16:36"}
{"review_id":"AFX2YA3JvHxIQ4ie2-RxRw","user_id":"b9T-i2R7zgQRT2prY6iJ3Q","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":1,"funny":0,"cool":0,"text":"So yummy! I ordered 1\/2 dozen. The caprese, honogos and  pollo! Excellent. They were ready before I got there but still warm and yummy. Their Chimmichurri sauce is so great.","date":"2020-05-03 01:15:35"}
{"review_id":"XFRO4EOFAfG575PuFfmEFA","user_id":"t6mmKaKsMxaVuC7dfYSkQg","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":1,"funny":0,"cool":1,"text":"I love these little empanadas and I could eat dozens of them.  So delish.  I'm glad they have a little outlet space where the old Peet's coffee used to be.  It's great to pop in for a tiny little meat pie whenever I need one.  Yum!!","date":"2019-05-28 02:53:34"}
{"review_id":"ZMICWiyORFGXsBn2_wu8Hg","user_id":"e_JaAUhYhFv2oX693T0wLg","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"This is a cozy oasis away from all the crowds and the food is great! Good experience.","date":"2020-10-13 22:59:01"}
{"review_id":"uVimwtg7jAqJNLPbUnZE_Q","user_id":"ukFWwNmnz7XApCrLCRn0Pw","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":4.0,"useful":1,"funny":0,"cool":0,"text":"Amazing empanadas! Great flavor and liked the many veggie options. Missing one star because I was expecting to dine in their outdoor dining area, however they were just loading\/unloading a truck there and there isn't really a \"dining area\" worth mentioning. It's just a couple of tiny tables. This place is great for take out or large orders though!","date":"2018-09-04 20:55:58"}
{"review_id":"bJQj6FcHIYvPXeks_k74CA","user_id":"GPbrpBUHUPaWPMvaQ5dPxw","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":1,"funny":0,"cool":1,"text":"Amazing empanadas and really great customer service. There were a couple issues with our takeout order but they showed excellent service and helped us out. The vegan empanadas were outstanding. And the caprese was out of this world.","date":"2020-08-02 01:55:48"}
{"review_id":"hHaLRrmhD4tbeCusc6j5Wg","user_id":"6oacxCF2qqokHd-BxEbi7A","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"Love these oven baked empanadas. The fillings are great, and the dough is standout for sure. Price is reasonable, staff is friendly, and they are great to share, take on the go, or reheat! Definitely a go to spot for a little comfort food :)","date":"2019-10-02 20:22:32"}
{"review_id":"2_436v3Ktbmcq-jTLfk0qg","user_id":"qmVXmbchh1V-PYSpvWU_rw","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"Yep... perhaps the best empanadas I have ever had.  Both the chicken and the prosciutto were delicious.  Wish the prosciutto had more meat in it though.  Deeelish!","date":"2019-04-23 02:14:31"}
{"review_id":"L4Fjts0LvKJfRkVG-IFJOw","user_id":"K_HUte4Iw2xikIp572tdPg","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"Yummy empanadas! The Brie and fig one could have used more Brie, but otherwise a tasty and interesting lunch.","date":"2019-06-30 07:52:05"}
{"review_id":"HBHupTNOxQYEK6d2nsOQ_g","user_id":"nlSuwdc-dXD9ju4VzBBS3Q","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":1,"funny":0,"cool":0,"text":"Their empanadas are consistently tasty. Today, I picked up an order of assorted empanadas and a huge salad for an office lunch. The staff was friendly and helpful upon arrival, and all of the food was ready to go on time. My coworkers thoroughly enjoyed everything!","date":"2020-02-26 19:51:14"}
{"review_id":"XLqe8tWfxoi0dmhS6GwVPA","user_id":"Id8kGg65eRafZJkpMuNiFw","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"This place made me fall in love with Santa Barbara. We stopped in for lunch and had the best meal. Split the half dozen empanadas and the next one was better than the last. We will be back :)","date":"2019-08-30 00:57:51"}
{"review_id":"MuvuyX6oc-ReSRZCTgHuEQ","user_id":"8bT9rvL1_AymCSqrFhGEEQ","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"Yelp did not let us done. We got the carne, pollo, shredded beef and onions all amazing. Carne May have been the favorite. No complaint all around. We will happily return! FYI they have two locations: one here and one in mosiac on state street","date":"2019-07-20 00:41:20"}
{"review_id":"bpXokyQDwsbE6jt6JAWeNQ","user_id":"x68S57nhOyKx9yreWjPgfA","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":0,"funny":0,"cool":1,"text":"After having a bad experience with a sushi place my husband and I wanted to eat something that would be awesome, thank goodness we found this place! The staff was super nice, seemed to really like their job, and very helpful describing the choices. Make sure to order ahead of time since the empenadas are fresh to order and take a bit to cool down. We only got two, the carne and the special. They were so good! So much flavor, the pastry was flakey and cooked well, loved the sauce, can't say enough good things about them! It was lightly raining so no one was sitting outside, my husband and I had the whole patio to ourselves and sat at a little covered table. It's probably really nice in the summer with the cute lights stringed across. We will definitely be back to try more!","date":"2019-05-21 14:28:06"}
{"review_id":"BfZ0U_HXfR4wUsguobukyA","user_id":"WbRXPcc8oqc7ic6u19d9jg","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"Empanadas are Delicious! I always go here when visiting Santa Bárbara. You must try you won't regret it!","date":"2021-02-22 06:32:31"}
{"review_id":"GyEnEIWdtfXKW2Wxe5VQnQ","user_id":"lSwpXTjQ18uF6MvuVihccg","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":1,"funny":0,"cool":0,"text":"Amazing find! Love the patio seating, Service was awesome and empanadas were amazing! We will definitely be back. Try the Carne, Prosciutto, and caprese!","date":"2019-09-15 01:54:07"}
{"review_id":"jpVVnXULplsjsY3-NmfjLA","user_id":"IOrPERI0w_xxONS1miCpyA","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":1,"funny":0,"cool":1,"text":"Best empanadas I've ever had and the ambiance was 10\/10. We ordered one carne, one chicken, one corn, and mushroom. DELICIOUS.","date":"2020-09-26 15:46:03"}
{"review_id":"IVXlbaY9qVmjhnKrIWn8tg","user_id":"KnWeN-B8XngG0BUoOx6t7g","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"Really delicious empandas.  We tried the chicken, beef, and mushroom.  All were excellent.  And the chimichurri sauce was tasty as well.  They were also accommodating as we placed our order only about 20 minutes before close.","date":"2019-07-11 18:41:03"}
{"review_id":"ofCA2c_GYssDz9KPkzPBhQ","user_id":"wFfh9ao4js9qj-76d4S_Rg","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":1,"funny":0,"cool":0,"text":"Have been enjoying their empanadas for years now, they're amazing and always hit the spot. Love being able to sample a 2 or 3 different choices each time!","date":"2019-12-18 00:44:03"}
{"review_id":"Y9BzrRH2qkOnZyFETpAgyw","user_id":"X0SeYRvGMEmeriH3Hu4SfA","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":1,"funny":0,"cool":0,"text":"Super yummy food here! I loved the potatoes and aioli that the empanadas came with. I have to admit, mine were a bit soggy when I got home, but I did have a 20 min drive home. I know if I had opened the box on the drive they wouldn't have been soggy. I got 4 empanadas for lunch because I was starving and along with the potatoes, I was completely full all day, didnt even need dinner, so they are well filled and super filling. I would definitely come back here again","date":"2020-04-29 01:40:02"}
{"review_id":"lCleVS-p3JZvWSLqoptFOQ","user_id":"lBPVRHrdJIu6erUTKgNUdQ","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":1,"funny":0,"cool":0,"text":"Great food, great service. Found this place on Yelp, and it has the cutest outdoor seating by a few unexpected parking spots. Their current special, the Bodhi(sp?) was really delicious. They also had vegetarian options and a new vegan option.","date":"2019-08-29 01:19:45"}
{"review_id":"NfweWH27Pa9IBsOSUIgD4g","user_id":"WHCDO-XWui_Dds48a6e3-A","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":2,"funny":0,"cool":0,"text":"Little hidden gem in the santa Barbara area.\nIf you expect a quick ready to go bite please do not come here because here they make the empanadas fresh for best taste and quality (how a real place should operate), best tasting empanadas I had in Santa Barbara, the price is reasonable since the taste makes up for it (I be returning here one of this days when I have time). Next door they is a little corner store they sell a drink called boing that pairs up with it super well. (I forgot the name of the market)","date":"2019-05-16 18:02:22"}
{"review_id":"LiwdsO_LnREnWgAI-CcMgQ","user_id":"yrmd2kn4wrnvz8zYhJNh_w","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"This is my favorite empanada place! I went often during fall and now I go back once a week during spring during my lunch hour since it's half a block away from my school.","date":"2019-03-27 03:23:40"}
{"review_id":"_U2P_tDIlzEd3bFkFnd7BA","user_id":"A8BDR0hevzv9pOklEpU_DA","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":1,"funny":0,"cool":0,"text":"I bet the locals wish they didn't have to share this little hotspot. I could see myself navigating here 2 to 3 times a week because these little bake at order bad boys are mouth watering deliciousness! Don't be afraid to be greedy. I would encourage you to try one of everything on the menu. I don't eat meat so I tried all of the meatless options, which they have SIX, and a couple of them are vegan. They were ALL good. I will say that the Batata was my least favorite only because I'm not a huge sweet potato fan unless it's edited for pie, but it was still tasty enough for me to gobble down. I couldn't pick a favorite, drooled over every one. Hot fresh and flavorful. My aunt had the chicken and she's already planning our trip back. We live about 35 minutes away, it's definitely worth the drive! They are nice size I would say you can eat 4 meatless ones easy. Go with your appetite , I ate my six  in moderation within a few hours with no problems. The spot is super inviting too. If it wasn't for COVID it would have been nice to sit around. Will be frequenting here often!","date":"2020-12-13 18:15:30"}
{"review_id":"65ojbHjp6F78syRXbdhvUg","user_id":"3qQaiKXC7eIhhMWWToXa_A","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":4.0,"useful":1,"funny":0,"cool":0,"text":"First time coming here and I must say empanadas were so good! I will come back again and try more of the menu! Recommended!","date":"2020-12-18 00:50:35"}
{"review_id":"JModNbNDabg6FQqPewtdSA","user_id":"5PtKXAWTRQknT9W0woOTvA","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"Really, really good empanadas!! My friend and I only got a couple to try since we were just stopping on our way back home from a trip, she got the mushroom one and I got chicken. Everything was very fresh and delicious. The spot was a little difficult to find since the sign was small and the actual building sits farther back in a lot. When I'm in Santa Barbara again I'll definitely be back!","date":"2021-01-14 17:10:06"}
{"review_id":"I8p4N4KtXXme1tJOI8H5ag","user_id":"EQT1VqOJNxMHfkp9yjbXHA","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":2,"funny":1,"cool":1,"text":"I know tacos are big in SB,  but these empanadas should really be more popular too! This is a really cute local up and coming shop about a mile off of State Street :) \n\nFriendly and personable employees, pretty differently shaped empanadas based on the different fillings, and piping hot little pockets of yummy = I'm sold\n\nrecs:\n- check in on Yelp for a free empanada with purchase of 6+\n- their patio outside is beautiful if you want to eat there \n- best empanadas: pollo (tastes like a chicken pot pie! and the mushroom one\n- that chimichurri sauce brings a fresh kick that's really good \n- if you like calzones, their caprese empanada really reminds me of one (gooey mozzerella cheese and all) \n- find easy street parking if their lot is full\n- don't be put off if many people seem to be waiting in front of you; lots of people do take out and service is quick! we had our food freshly baked within 10 minutes\n\nI'd be super excited to come back and try their different seasonal specials (I had my eye on a fresh corn one from the past, and I think some dessert empanadas would be good too)","date":"2019-01-12 21:02:54"}
{"review_id":"EvnfDS-64MrGHoxtboL0nw","user_id":"_n5Sa5SgX9Cs7ZAktpZp2g","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":4,"funny":0,"cool":2,"text":"I've never tried empanadas until this place and I'm hooked. It's flakey and the pastry is so delicious. \n\n I can taste quality ingredients inside. It's filling and the price is right. My favorites are the prosciutto and gaucho. Their chimipapas are also delicious! I would recommend.\nIt comes out HOT so be careful! \n\nHighly recommended :)","date":"2020-01-10 20:50:09"}
{"review_id":"rwKUdvwTKAowyUk82AG9cA","user_id":"afEiAqtdpGoqGOH9SXVJtg","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":2,"funny":0,"cool":1,"text":"Amaaazing. Crst is somehow flaky and bready, I don't understand. All the fillngs were balanced, herby, well-salted, refreshing, savory.\n\nFavorites were corn one, ham one, and caprese.\n\nLiked quinoa one least, mostly tasted the goat cheese. (Though I'd still eat 10 of them!)","date":"2019-12-14 13:34:45"}
{"review_id":"BVRUnLn8vyrw1GaY5vxwyg","user_id":"YwE_VkhMPO7a4LXQi3FfRg","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":4.0,"useful":3,"funny":0,"cool":3,"text":"Little hidden gem combined with a couple other companies downtown behind Core Power. I had the Gaucho and I couldn't look at anything else once I saw pulled pork. The meet was so juicy and delicious with a bit of a crunch from the grilled onion. You definitely have to try the herb aioli drizzled on top. My friends got more ( and different ones), all of which they said were delicious. You can take them to go to heat up on your own, or have them heat it up there for you to enjoy. They have plates too where you can get 2-3 with papas (potatoes) on the side to make it more of a meal.","date":"2020-01-27 04:15:24"}
{"review_id":"i-ya7cQ2cuWbAuRZUz00FA","user_id":"iPAF9PhkyJWtP13TIfSQvw","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"I LITERALLY SIT AND THINK ABOUT THESE EMPANADAS! A bunch of people at work would always talk about this place so I just had to give it a try. Lets just say I was not disappointed at all. I would recommend calling in and ordering because I ordered online and they did not see it. They bake everything fresh so I had to wait until they were done in the oven... no worries though at least it was fresh!","date":"2019-07-15 22:31:30"}
{"review_id":"MpKU_iIYUZM5U7mq8f70kQ","user_id":"8hDgHQa5gNHT2KAYEgsBVA","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"Easily the best empanadas I've ever had. Definitely a must try in Santa Barbara. They're all so delicious.","date":"2019-04-17 19:54:15"}
{"review_id":"eB1Wyfg4OLawMgIk8vI4_g","user_id":"wqj2QYPam7jkOpdQEV_U_w","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":1,"funny":0,"cool":0,"text":"Best empanadas ever!!\n\nThe Hongos are delicious! That's my favorite. A close second is the humitas. The other empanadas are great too, but these two stand out!\nIn normal times the seating is also very cute.\nDuring COVID their prep times are very fast, usually within 10 mins.","date":"2020-12-27 09:45:08"}
{"review_id":"FF0RgjAG0VGzQPG0OZwQcw","user_id":"234KJvTJ6Qy--UiDJgif0A","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":1,"funny":0,"cool":0,"text":"Legit empanadas. Some of the best I've tasted. In my all time top 2 empanada spots ever. Buena Onda is amazingly good. Not bready (which unfortunately, so many empanadas fall victim to), made with a flaky dough that is just so YUM! Highly recommend. Parking is scarce, but I will deal with the horrible parking to eat these again and again! I can't believe I haven't gone sooner!","date":"2018-10-11 20:53:30"}
{"review_id":"xVZVZYmgwr3tnFbbEKD-_A","user_id":"tLGf95Avo-PxWarAEC6OBA","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":1,"funny":0,"cool":1,"text":"Their empanadas were so freshly made and delicious! It took a while, but it was so worth waiting for them. The pastry and the filling had nice balance and was very flavorful!","date":"2020-07-29 23:20:22"}
{"review_id":"bcVpLURpCnl51Dp0AUOeSQ","user_id":"ZMoeqLmOff_P3d6r4XlYWg","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":1,"funny":0,"cool":0,"text":"These Empanadas were fantastic.  As well as being very inexpensive, they are super flavorful and the ratio of filling to pastry is perfect.  It is about $3-4 per individual empanada, and two or three can definitely fill the average person up.  I tried the chicken, ground beef, and the \"gaucho\" special.  I thought that the gaucho special was the best; it had brisket and potato inside which was to die for.  The empanadas themselves are excellent, but what really puts it over the top is the side of delightful Chimichurri sauce that comes with the empanadas.  It adds a lovely freshness to the empanadas that otherwise they would be missing.  They also do phone orders which you can pickup in store.  Definitely going back!","date":"2019-03-12 18:36:24"}
{"review_id":"ZG_g2MKXdQWLY0TiBEp4qQ","user_id":"VdP-WUVmLogbDzw0CEjIbg","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":2,"funny":1,"cool":1,"text":"My wife and I found this lovely restaurant during our stayed in Santa Barbara. I have never eaten an empanada that tasted this good; i didn't know it could taste this good. The empanadas I've had in the past had a flakey crust that is sorta dry and tasteless. But this beautiful place creates a tasty, chewy bite in their bake of the dough. The fillings are these delightful treasures, from cheese to delicious meats. I can tell they take their time in developing flavors in their fillings. They fold their empanadas differently according to the filling you order. If there is a reason to visit Santa Barbara, Buena Onda is a good reason to do so.","date":"2020-06-28 02:59:14"}
{"review_id":"ySrWdPUh1OVi1cn74B5fhQ","user_id":"VHUkeCDW7Z4qhCe4va5xBA","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":3.0,"useful":0,"funny":0,"cool":0,"text":"I really love the empanadas and chimichurri sauce! For that I will give it three stars, however I was really disappointed with the service the last time I came in (past weekend). I had been waiting in line for about 15 minutes and I noticed they have a lunch special that ended at three, by the time I got to the counter i had asked if the special was still on as it had just turned 3:01 as I was ordering and I pointed to the sign next to the counter with this special. The cashier immediately said no and flipped the sign. I would've hoped they respected the fact that I was already in line for 15 minutes and obviously cannot rush the customers in front of me or speed up the line. I would've been fine if they had at least told me in a respectful manner no the lunch special ended, sorry, but because they were rude I decided something had to be said. I hate writing bad reviews but if something is not available, ensure the signage is taken down or respect the folks that have been waiting. If it were ten minutes after three, again super understandable but if the time turned as I was ordering, how is that my fault?","date":"2020-06-02 16:40:38"}
{"review_id":"4LwuCWs-rM1ZvUvz8yVMXQ","user_id":"VeeYAny2FFU6W0IkEH2peQ","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":2,"funny":0,"cool":0,"text":"Literally the best empanadas you will ever eat.  Owned and operated by a local Argentinian family, they make everything from scratch including the dough! They take no short cuts.  We're talking slowly braised beef, pork and chicken.  And they did not forget about you vegetarians either.  The kale and mushroom is insane as is the corn empanada and the caprese empanada (filled with super melty cheese, tomatoes and basil).  But I always get the chicken too!  Top them with a little of their homemade chimichurri...heaven!\n\nThey just opened a new location at 1131 state street in The Mosaic Locale with Draughtsmen Aleworks and Hook & Press Donuts.","date":"2018-11-27 13:02:24"}
{"review_id":"8mehz_5MtyewM-jHFtLwMg","user_id":"0ciR5KCKt6nafFyS0JQ42g","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"Empanadas are delicious and the staff were super nice. The outdoor patio is really cute with string lights. We got the carne, pollo, hondos, and the Chile verde. We also got a side of potatoes and everything was super tasty! The hondos and carne were our favorites!","date":"2021-02-06 23:00:20"}
{"review_id":"BujJg3-8d7L-C24T1jHOLA","user_id":"4V5-wggNEUTUdH2W4qQO4Q","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"Great empanadas from a local business. I personally like the prosciutto and the classic beef empenadas. The chimichuri sauce is great.","date":"2020-10-12 21:00:07"}
{"review_id":"aXY32SwyoUYsUzL_Uu78Vg","user_id":"CUDOQDxbVEmkwuer6iz5cA","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":1,"funny":0,"cool":1,"text":"If I could leave 6 stars I would. Delicious and fresh, you can't go wrong with any of the many types of empanadas here. They have a rotating special empanadas that they get creative with. Would definitely come back here in the future and recommend to anyone who wants a hot fresh empanada. Also they do to go orders of half baked or frozen to take home for later","date":"2021-09-17 22:53:36"}
{"review_id":"zUNUBp_dN6fS7ejWDcfGKg","user_id":"oTz7zc5Ytbr3dG1Gy4Hjng","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":2,"funny":0,"cool":0,"text":"Without a doubt my favorite empanada spot. I order half baked and even frozen. The yummy sauce that comes with your emp order is SO good. My faves are the Caprese, Pollo and Breakfast. Definitely recommend!","date":"2021-04-03 18:54:15"}
{"review_id":"zs8tvTNNp7w-mu6RWKxQuA","user_id":"_TCq803obGXdGZg3WfUJ8Q","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":4.0,"useful":3,"funny":1,"cool":2,"text":"$30 we ordered a half dozen of different empanadas and Chimi Papas. Wow! I was pleasantly surprised at the whole experience. Buena Onda has a very welcoming Argentina flair to the store and front patio. Issa Vibe! We ordered 3 Guacho special (short rib & potatoes), 1 Pollo(fee range chicken), 1 Humita (corn & onions), 1 Hongos (mushrooms & mozzarella), 1 Carne (grass feed beef) and Chimichurri Papas. We took our order to go, and I greatly appreciate how they provided small plates, napkins, and wooden forks and knifes. We split the food between three people and we had leftovers to take home. I honestly did not have a favorite because they were all so good! The Humita was just corn and onion but it was sweet and delicious. The Gaucho reminded me of a pot roast, Hongos was cheesy goodness! I would order them again. It was the prefect food to take on a picnic. Can't wait to go back and try some more. Adding this spot to my Santa Bárbara Favorite Eats!!","date":"2020-01-05 23:21:55"}
{"review_id":"rAld137rF_1Kt6e3iUKasg","user_id":"JKcG7DK5umP_ID6Vk1Bdqw","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":1,"funny":0,"cool":0,"text":"This is the greatest spot in the whole world. I cant believe how good these empanadas were. Get the honga!!!!!!! Love this place\n\nHonestly freakin considering making a two hour drive up to santa barbara from la just to get my hands on these things rught now","date":"2021-01-01 02:00:57"}
{"review_id":"0QSaCAstfdWA2wxadCq7Qg","user_id":"IuMJ0E5G_FgQFsvdC7N6qw","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":2,"funny":0,"cool":1,"text":"I came here for the Holidays on Haley event and tried the mushroom empanada, soup, and sampled their brownie. The empanadas were the best I've ever had. The crust is amazingly flaky and tender and the filling was generous and perfectly seasoned. For the mushroom filling, it wasn't your typical generic gray pasty filling. You can see mushrooms and whole ingredients used so it tasted homemade and rustic. The soup was delicious as well and I highly recommend getting it to accompany the empanadas. I'd say get 2-3 for dinner. If I was in the area I'd be here every week. There's plenty of seating outside with heaters at night. The staff were very friendly and fast. I can't wait to go back to SB to pick up some more empanadas.","date":"2019-12-20 20:14:26"}
{"review_id":"omtZDrr6UgE8Sny4jOKk-w","user_id":"y6yL0xHRymMedM5221igsw","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"So, so, so good! This was a late night decision that could not have been any better. The staff was super friendly and everything was baked fresh for takeout only.\n\nI got the 3 empanada combo with chimichurri potatoes. Hongos (my number one), Serrano (da bomb), and Beef (bueno) we're my empanada flavors. My partner also tried the chicken and said it was his favorite.\n\nOne thing that I especially liked was that the folding styles for each empanada was different so we could tell them apart before we dug in.\n\nIf I could give more than 5  I definitely would. You need to try it, like right now.","date":"2021-01-30 01:00:08"}
{"review_id":"iEvaCBL_bjWwPg3pivIKqw","user_id":"Uux7fKKiUf2Cbqau8W9ixA","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"Great costumer service, food, and decor! We ordered the half dozen but only got 5 empanadas in the box. When we went back they threw in an extra one to make up for it. \nI definitely felt some of their choices are a head above the others. I absolutely loved their chili verde (delicious, but was only an option for the week), batata, and pollo. I wasn't too hot about the serrano, which was mainly cheese with some strips of ham - way less packed than the other options, and therefore not worth the price point. Overall I was very impressed with their vegetarian options and will recommend them to my friends. \nTheir outside patio is very cute and is a great environment to eat in. There are benches and little candles at evening surrounded by plants and lights. Between the customer service, food (especially now that I know which ones are stellar), and decor, I would rate Buena Onda a 5 star.","date":"2021-02-27 20:17:07"}
{"review_id":"9qk3sY8DIoxeN0sfvK9VNw","user_id":"yrmd2kn4wrnvz8zYhJNh_w","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"This is my favorite empanada place! I went often during fall and now I go back once a week during spring during my lunch hour since it's half a block away from my school. The staff is really friendly, the prices are great, and the food is amazing.","date":"2019-09-22 08:29:37"}
{"review_id":"QgeQc8bWdlF_Xnl7P1Q-7Q","user_id":"5wnDdQcgdqUGaCeTfgn8dw","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":4.0,"useful":2,"funny":0,"cool":2,"text":"We ordered a dozen. Very fresh and toasty. Could use little more flavor to entice my palate. Friendly staff and clean place.","date":"2020-09-30 04:36:39"}
{"review_id":"tL-T2S7-7bc7YK89U-BBNg","user_id":"iCnbnZMYnkcs8oJMOERRIw","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":1,"funny":0,"cool":0,"text":"Soooo good! Soooo fresh! We were impressed with the empanadas here in this quaint little spot. We had 6 different empanadas to share with the potatoes and chimichuri sauce and it was delicious. Highly recommend if you are in the mood for something different. Enjoy!","date":"2019-09-25 18:43:44"}
{"review_id":"WuKm1gycKtSILu61qbQksw","user_id":"lHyXYKa33abP41kyotfDEQ","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"I ordered pollo, carne, sorrento and buen día empanadas and they were all delicious! They are authentic argentinian empanadas. It's also reasonably priced.","date":"2020-09-12 00:11:47"}
{"review_id":"7hJABRVoAIKFBQO9NgX7mQ","user_id":"wQ7FAfsrpWwtuaWs6KqTng","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"Great empanadas! Glad there's an Argentinian empanada restaurant closer to me. I really enjoyed the batata (sweet potato) empanada and pollo (chicken) empanada!","date":"2021-03-02 23:05:20"}
{"review_id":"rp0Kz-cvIlbdLmrVmdXyhA","user_id":"7rTMbqo2LA3c_l8IKEb6EA","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":1,"funny":0,"cool":0,"text":"Some of the best empanadas I have tried! Will definitely be coming back soon. I loved how each empanada was shaped differently to be able to tell what kind you were picking out of the box.","date":"2020-05-01 00:19:38"}
{"review_id":"WIKUx2qhJs20LOxWoX4yuA","user_id":"T9ygjtZsHoLNXiQhdoCXIQ","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":1,"funny":1,"cool":1,"text":"I've been wanting to come here for awhile and finally found an opportunity to do so. The food here is absolutely amazing! Highly recommend. Hands down, the best empanadas I've ever had.","date":"2020-09-10 21:22:58"}
{"review_id":"4ZDILjh-3yuqhqPMCI2_NA","user_id":"09Zyv36cb-Nh8hS0JHbS4w","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":1,"funny":0,"cool":0,"text":"Their Carne empanadas are so delicious that my children fought over them and we had to buy more.  My favorite is their mushroom empanada.  The corn and pork ones were just OK.  But the Serrano with mozzarella cheese was as popular as the Carne\/beef ones.  Friendly service and decent price.  We visited 3x in our 2 day stay in SB.","date":"2019-06-29 06:04:39"}
{"review_id":"8eGWPCvkFUxrX35SAmwkJA","user_id":"Cn4nZVpJqAyLk8dZOfKxUQ","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":3,"funny":0,"cool":2,"text":"I absolutely adore their mouthwatering empanadas, what more can I say? The dough is super  flaky, light, and hot off the oven. You can taste the love they put into making them and homestyle taste. And best of it all, you get to savor them in their quaint outdoor patio. Absolutely recommend, just one mile from downtown SB","date":"2019-11-23 22:12:07"}
{"review_id":"8xzVVMRjMZDPV3joZAh6UA","user_id":"OGvSJBahdOoseO0BKJ20xw","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":1,"funny":0,"cool":1,"text":"Best and freshest empanadas I have ever had!! They had fabulous vegetarian (and even a vegan).  The service was quick and friendly and the ambiance was nice and casual","date":"2021-09-06 18:18:36"}
{"review_id":"aYh13mP36jyQMMszHOmNEQ","user_id":"D4JHDISAtHlnaHf4jtvj8A","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":4.0,"useful":0,"funny":0,"cool":0,"text":"Wow. Delicious! We ordered 4 empanadas and I only ate the chicken one. However, it was delicious! The place is was easy to find and the empanadas come out piping hot. They also come with a chimichurri that is super tasty as well and a couple leaves from what you'd find in a mixed greens salad. \n\nWhen we ordered the empanadas we only ordered 2 at first. Decided that they were good and went ahead and ordered the 2 empanadas + salad or potatoes meal. We asked how much the potatoes were alone and it was $6, so you saved a dollar when ordering it as a meal. The order came out and there were not as many potatoes as I thought there would be. They also were just average. I recommend skipping them and just getting another empanada. It'll be less expensive and you'll enjoy it more. \n\nWill come back next time for more empanadas.","date":"2019-07-08 05:15:17"}
{"review_id":"9YGGOEHVmTrJ-or0c7GRJQ","user_id":"chhv5egoLSXHs4my1HCJeg","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":31,"funny":11,"cool":27,"text":"I was really curious to try this place out as it received five stars on Yelp. I also have been on paleo and was craving something carb based, which I know this would've fixed that craving. \n\nSince we weren't in SB for very long, we decided to take a dozen of these empanadas to go. \n\nThey sell half frozen and fully frozen empanadas to go, so you can enjoy them as fresh as possible. We ordered the half frozen, so the cook time was cut in half at home. \n\nThese empanadas are some of the best that I've had. My favorite were the hongos, which were the mushroom based empanadas. \n\nNext time I head up to SB, I'll definitely be grabbing some to go again or eating some there.","date":"2020-10-05 16:05:53"}
{"review_id":"MTAsnx-NNjvF9xjDC-X2Bw","user_id":"bMFqD4beGrt_LjNGG_7xng","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":1,"funny":0,"cool":0,"text":"Ordered delivery through DoorDash. Hot, fresh, very tasty empanadas and salad. If we're ever in the area again, we'll be back.","date":"2021-03-07 04:26:59"}
{"review_id":"m9SQDtPKaeGZVEflKGvjQw","user_id":"1OMTcgeVcV0nmqVMCnoeIg","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":7,"funny":3,"cool":6,"text":"What a find! You definitely need to use both your map app and the address to find the spot which is located at the back of the Village Catering Modern Foods parking lot. \n\nI decided to stop by based upon the 5 star tell reviews. Note, they only serve 5-6 type of empanadas Wednesday - Saturday from 4-8pm. It's best to call in the ensure they have enough and so you don't need to wait 15 minutes for them to make them for you. Rookie mistake!\n\nDon't get thrown off since it is a catering place that has a bench outside to sit. I suggest grabbing and enjoying these bad boys at the beach!","date":"2016-07-04 09:17:51"}
{"review_id":"S2Y568_55CtAiFnEpYjHpw","user_id":"jYz8bKLL0JZyuAKggoiVqQ","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":1,"funny":1,"cool":1,"text":"I came here while I was visiting Santa Barbara on a college tour and WOW these empanadas are freaking delicious. I was in town for four days and I managed to have Buena Ondas empanadas on three out of the four days I was here (one of these times I ate leftovers for breakfast...don't judge me.) I have to say my favorites were the Hongos, the Pollo and the Humita. This is definitely a place to stop by when you are in town.","date":"2019-07-29 19:50:52"}
{"review_id":"7xlv-50icWoXzS5IZZsGmA","user_id":"J11JEwvFIrevHIqo21Xm0w","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":2,"funny":1,"cool":1,"text":"Holly shit this place is epic! 39$ feeds a family of 4 & we had two left over: so unique & juicy!","date":"2020-02-28 00:55:05"}
{"review_id":"4l7vu-qCV5I-4J4OAoz4YQ","user_id":"PNqzRD5VNwNoHoL2ZdEbuA","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"Las empanadas are so good. You can't go wrong with beef paired with some chimichurri. There is a brewery conveniently located next to it inside too. I bought a half dozen empanadas to go. Good stuff!","date":"2021-04-09 04:17:32"}
{"review_id":"rPUYfwieJF-v3Kgyd2vMYg","user_id":"Ko1TFy4kdLU7rXuSeTqk5g","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":1,"funny":0,"cool":1,"text":"This place is the best!!!  The smell of baked goods and savory fillings are so enticing and comforting.  The empanadas have a perfect balance  of pastry to filling, and everything is cooked so expertly!  They have numerous vegetarian options and at least one vegan item that are all just delicious as the meat ones.  Empanadas come with the most delicious chimichurri dipping sauce.  The owners and staff are awesome.","date":"2021-07-12 14:25:22"}
{"review_id":"kuhhFSYEvA3t9kRddZvuqw","user_id":"xNTsufGcaY1AI-H5OWWApA","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"Ordered a dozen empanadas and enjoyed every one!  Carne, pollo, hongos, suiza, serrano, caprese and batata.  Delicious and made to order. You can order ahead for pick up or order there and enjoy patio seating. Dog friendly and they have outdoor heaters. Plus they allow you to bring your own drinks =] super buena onda!","date":"2021-02-07 03:36:13"}
{"review_id":"d6VFsgwVrCNCRbUgLvMzJA","user_id":"ymF3Kiju-Mr1mwUn2H1Vdg","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"Amazing! Love the empanadas! You can taste the love the person cooking puts in each of them \n\nYou need to try the Serrano one! My favorite Argentinian Empanada ever!","date":"2021-07-24 19:41:37"}
{"review_id":"HRoWj2PEAqK1DNCCzzhh6Q","user_id":"_6utPMTXkpiKOH1EHSVyGQ","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":2,"funny":0,"cool":0,"text":"I came to Santa Barbara for a weekend and I was very excited to try out empanadas from Buena Onda since it had amazing reviews. I was very impressed with the vegetarian options they served. I had caprese, quinoa, hongos and vegan batata empanadas and they were all amazing. They were baked and not fried.\nThe restaurant also has a very cute patio in the front and I loved their seating area.","date":"2021-03-07 21:42:02"}
{"review_id":"OnTyVyWS_CphBIiwHOqXVA","user_id":"gzaX7IaxyKhKAOZ-MGmDjg","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":4.0,"useful":0,"funny":0,"cool":0,"text":"Good pie and good taste. Not salty and flavor is just good enough. Pie is crispy and tender inside. If you are looking for salty pie, adding salt might be a good idea.","date":"2019-08-28 23:22:30"}
{"review_id":"O2E9WqBeARjZnrStVQub1A","user_id":"4jXXxK5cljqbnDlPGuMnsQ","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":4.0,"useful":0,"funny":0,"cool":0,"text":"Very yummy food, empanadas are light, flaky, very well made. Ingredients inside also very yummy. Just a little too pricey for the size. Id have to spend like $20 get a full meal here and empandas are kind of a street food, shouldnt cost so much. Chimichurri sauce heavy on the oil. Workers very very nice. Id be back for sure.","date":"2019-03-29 02:27:01"}
{"review_id":"4AXRUYqXGGq4MIFp9jD6ag","user_id":"79WAyrg3l_Yh6QY5If_Adg","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"This is one of my favorite spots in santa barbara. affordable and reasonably priced for high quality, delicious food. amazing parking and outdoor seating area is available as well as great service. can't say enough good things about this place.","date":"2020-11-15 03:17:19"}
{"review_id":"J8dBYmL6sTlwKrhwA5yqkw","user_id":"Z0SgsRerpqVH-uGuvBF7nw","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":1,"funny":0,"cool":0,"text":"Freshest Empanadas. Right out of the oven. Super yummy taste. Outdoor sitting. The only downside is that they are only offering limited options.","date":"2019-04-18 19:17:01"}
{"review_id":"R89jqSqFEKUtclG6_Gzz0g","user_id":"CdLPMPRsZYp3pRLkV6RL6A","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":1,"funny":0,"cool":0,"text":"The absolute best empanadas I've had in a long time. HighlY recommend all the beef ones stunner ups are the ham and cheese and chicken","date":"2020-02-07 18:17:02"}
{"review_id":"tSsWbP4UG-y8BUt-9ndshw","user_id":"2okJkbOmIOE8d8pa15QHmQ","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":2.0,"useful":0,"funny":0,"cool":0,"text":"The empanadas were above average, however many of them were similar in flavor, and many of the empanadas had cheese as the predominant flavor. The potatoe side we ordered were mediocre. Nothing to write home about. The chicken wings weren't bad, but needed more flavor. There was no zing. It needed something to elevate the taste. The salad was also another case of being okay but still missing that wow factor. Overall the food was fine, the staff were fun and friendly, and the prices were fair. The food just needs something to bring it to the next level.","date":"2021-03-25 04:10:37"}
{"review_id":"vu8Or7v3yYmM5p5-ymDciw","user_id":"gwt96JnEuUvBgPXp-jCq0g","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":2,"funny":0,"cool":0,"text":"This is such a cute little cafe, I'm visiting Santa Barbara so I'm not local which breaks my heart. I know I'll be back to Santa Barbara just for these empanadas. We ordered 5 different kinds. The carne, quinoa, pollo, humita and caprese. \nThe carne reminded me of potato balls from Porto's, ground beef and spices. The quinoa was fantastic, quinoa leper's and goat cheese, only order this if you like goat cheese! The pollo was my absolute favorite, shredded chicken and onions, it tasted like my mother's chicken tacos. The humita has caramelized onions and corn so this was a sweet savory item. And the caprese, she was cheesy and yummy and truly a mozzarella tomato basil ball of goodness. We also got the chimmichurri potatoes which were a great breakfast item to me. Also the staff were all super helpful and knowledgeable. I'm happy and I will be back soon!","date":"2019-12-07 20:02:42"}
{"review_id":"HmfHL2TqxrUT6Fdb1gy_EQ","user_id":"jB4-apiba0ePedjkWZqxJg","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":1,"funny":0,"cool":0,"text":"I had never tried empanadas before coming here, so with no expectations or points of comparison, I was blown away. The pricing is more than fair, with the ability to mix and match any of their different empanadas within your order allowing for great flexibility. It's worth noting that the restaurant is BYOB, with only a small area with 3 or 4 barstools inside and the rest of the seating outside (with heaters to keep warm). There is a liquor store right next door so drinks are convenient to grab while waiting for your order. The empanadas themselves come out fresh and hot, with vegetarian options available. Worth ordering for takeout or eat there.","date":"2020-01-04 21:36:52"}
{"review_id":"ug4qT_kDnVVWpHkVleMQkw","user_id":"B8F1vEv2Y5k0GIZdUsTB3A","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":0,"funny":0,"cool":1,"text":"Absolutely delicious! My fiancé and I couldn't stop talking about how good they were when we were eating them. I find myself thinking about them and wishing there was a location near us.  YOU HAVE TO TRY!","date":"2020-10-15 16:12:35"}
{"review_id":"El2wjjGTQrtDjkHw5tSzEQ","user_id":"lhdMfitQTUvf-imrColCNA","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":3,"funny":0,"cool":1,"text":"These are by far the best empanadas I have tried.....even after visiting Argentina a number of times.  The quality of the dough and filling is off the charts delicious.  The folks working there and the owners give you the feeling that they are truly passionate about what they do!!!  Recently I tried the family meals along with a dessert and once again I was sure impressed with the quality and service.  You cannot go wrong with Buena Onda.","date":"2020-04-25 04:02:18"}
{"review_id":"lAjJ-Dx7mc_RjUY-hAbRSw","user_id":"ijV7Ik3xtgxcTv9KmJ_-rQ","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":1.0,"useful":1,"funny":0,"cool":0,"text":"Sad to see this place has gone downhill from what it was. The empanadas are really doughy and the meat is under seasoned or maybe recooked from frozen or something. $3.50 per is too much for the small amount they are serving now. With the size of them maybe $1.99 would be better price since the quality of the products has gone down so much. There second location is nothing desirable, not much of an atmosphere or energy just a counter in a shared location. Doesn't make you want to sit and enjoy your food. I'd suggest passing this place by which is a shame as it was once not over priced.","date":"2019-03-25 03:29:01"}
{"review_id":"jeWydRHUHIpARS9vMpmT7Q","user_id":"MY3f15ASTWtJdlA9RdtvHA","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":1,"funny":0,"cool":0,"text":"Delicious empanadas! We called in our order ahead of time and they were ready upon arrival","date":"2020-06-21 00:21:21"}
{"review_id":"fpCAVhpvlsBesA9H_vhncg","user_id":"cA7zTfgplXeyOxhtxReuJA","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"THIS PLACE IS SO SO GOOD. My friend Ryan recommend this place, saying it was the best empanada place he's ever been to. I am a skeptic but I decided to give it a try. Even though my expectations were high, Buena Onda managed to meet every single one of them. They make the shapes of the empanadas different depending on the flavor which is a nice creative touch. Will definitely come back when I visit my friend Ryan again!","date":"2019-09-13 18:46:54"}
{"review_id":"KuaT59tUoBm_q-bKx8xklQ","user_id":"Ut6Fm1h9gRNBXd6RM0htjA","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":1,"funny":0,"cool":0,"text":"This place was sort of in a sketchy part of town and parking is limited.  That's literally all that can be said negatively about this place.\n\nThe food was AMAZING.  Me and my fiancee got a dozen empanadas, all different ones.  They all blew us away.  Is it okay for food to taste this good?\n\nNot a ton of seating but is okay for a group of like 2-4 people.\n\nDelicious, will definitely be coming back!","date":"2019-07-19 07:44:18"}
{"review_id":"Vk0Wod0R8SPKzN4JfEZfGg","user_id":"R8OgQ6wkmU2OeISs_957UQ","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":1,"funny":0,"cool":0,"text":"Wow! I just happened to walk by and check it out and I'm so glad I did! The empanadas are the perfect size - I got the chicken and it was wonderful! I will be back!","date":"2021-04-03 20:29:03"}
{"review_id":"s6gAfRjqlpG_rRhwqI0xcQ","user_id":"-7irGbPKrFXt8clXK_dGEw","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"Best empanadas outside of South America! Pastry was crispy and flakey. Filling was tasty!","date":"2020-11-06 08:27:58"}
{"review_id":"bSHDD6GMEUIPclGEZtwdVg","user_id":"D36edPvzc504tHFLXcVP0Q","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"The empanadas are great. And a group of kind, nice people. Once they made a small error in the order - and they went above and beyond to make things right. (But not like they make a lot of errors! I've ordered many times and there was only an error once - and they were too nice!)","date":"2021-04-07 02:17:46"}
{"review_id":"ndDhPQQSGa7Q5xZjyjgxQw","user_id":"qUULtZeSX2Wn6lo59HSrKw","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":1,"funny":1,"cool":1,"text":"Good Argentinian empanadas, good service, cozy place and supporting local business. Glad we came here and found it.","date":"2021-08-24 22:59:57"}
{"review_id":"mdv6URGm8mtNhZMtMNklKQ","user_id":"FiL31FVxlE6WIUZNUSt6MQ","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":2,"funny":2,"cool":1,"text":"My husband brought me home a box of pollo empeñadas!! I'd take that over a dozen of roses any day!! Wow! Sooo delicious! I've convinced him to have you all cater our wedding! We will be in contact soon!!!","date":"2018-05-18 03:14:52"}
{"review_id":"ZzopA_ixBlFnMedQw2EzQQ","user_id":"UlwxXoojyMy0Ky22p0qfuw","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":4.0,"useful":0,"funny":0,"cool":0,"text":"Each empanada is 3.95 and bake it upon ordering! Hongos was definitely my favorite. It's a MUST TRY, seriously it's hard to resist the melted cheese!! Everything was delicious, I just wished the outer shell was less dry. \n\nCurrently, there is only seating outside, but it is beautiful! There are so many tables with flowers surrounding the area. \n\nFYI- the parking lot is pretty small (5-8 spots) and hidden!","date":"2021-08-04 04:12:50"}
{"review_id":"qsSRMSrP_hBL0pa-H4BGPg","user_id":"yZDkdE9YNim2jqHD3WHTLA","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":4.0,"useful":0,"funny":0,"cool":0,"text":"There's nothing quite like freshly made empanadas! My friends and I had heard about this place months ago but never got around to trying it until now. Before coming here I read reviews saying it was difficult to find, but I didn't have a problem. The parking lot is limited but the side streets offer plenty of parking. They have the loveliest outdoor seating area that's nicely shaded.\n\nI ordered the Hongos empanada and their special empanada of the day the Gaucho. The Hongos was kind of lacking on the filling, but it had more flavor than the Gaucho. Neither disappointed though and I loved the variety of options they had!","date":"2021-07-25 21:23:51"}
{"review_id":"6DhYoNq3xnflv9P1Lofi9Q","user_id":"ppLsaThbKkcuefhZHEDweQ","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":2,"funny":0,"cool":1,"text":"Wonderful empanadas!  We tried one of each and they all hit it out of the park! The potatoes and chimichurri were awesome too! Save the trip to Argentina and go dine at Buena Onda!","date":"2020-07-10 00:50:48"}
{"review_id":"cwCkcQR5IEceb8nCNV1mLA","user_id":"oxZi4B25K8XSQEF2_blkTg","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":1,"funny":0,"cool":1,"text":"Kept seeing this pop up when I was looking for good eats while in SB. Ended up ordering a doz empanadas and a few of the deserts. The empanadas were amazing. Ended up eating way too many of them. Lol.  We will order more to take home tomorrow when we leave.","date":"2021-09-12 06:26:14"}
{"review_id":"CuscFm13wfXO6rEqrY7g8w","user_id":"xV60ByYN0DEwFdQYSEXDuQ","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":1,"funny":0,"cool":1,"text":"Grateful for Buena Onda's exceptional catering service for our recent event at Hope Ranch Beach. From planning to late revisions to our plan & then food service at the event - Matias & Mercedes were a pleasure to work with. While the chicken empanadas, chips & guacamole, and salads were the biggest hits - it was great to be able to provide gluten-free & vegan options. The food was delivered hot & the salads were fresh and tasty. Would highly recommend Buena Onda's catering!","date":"2019-08-15 05:33:34"}
{"review_id":"9h9qysv-G5efBqcjNm_xFQ","user_id":"yufKqYSRkyCJLObBW8ARQw","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":3,"funny":0,"cool":3,"text":"These are hands down the best empanadas I've ever had.  I would 100% stop by any chance I have if I lived near by. They have a variety of flavors, which definitely makes them more unique. The outside is nice and crispy, and the fillings are delicious and flavorful. We got a variety to share, and they were all amazing. Be sure to check in on yelp to get a free empanada when you order half a dozen. I didn't notice the check in offer until after we ordered, but they happily still honored the offer and gave us an extra one. The service is great, and the food even better. Can't wait to go back next time I'm around!","date":"2019-12-04 07:50:32"}
{"review_id":"tWvr-IFliAWU7YNDpSXBfQ","user_id":"v2NzpaUJMLCg75jhqcdLEQ","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":5,"funny":1,"cool":5,"text":"Empanadas fresh and ready here! \n\n* Wow, this place really set the bar for my day in Santa Barbara. First restaurant I ever been to in Santa Barbara and I knew I had to pick a good one. They have a perfect 5 star on Yelp and I wanted to see why. I got the 3 empanada + side combo $15. The empanadas were baked perfectly and STUFFED with goodness. They had a good crisp and weren't soggy. \n\n* Guacho empanada: beef brisket, potatoes, red onion, tomatoes. I started with this one first. I was super surprised with the amount of beef they were able to fit in it. It was really good, so I was surprised when the next two were even better. This special empanada is inspired by the UCSB mascot. \n\n* Serrano empanada: prosciutto ham, mozzarella, garlic, wild arugula. looked a little chubbier than the rest. This one was especially cheesy, which I appreciated. Definitely recommend for cheese lovers.\n\n* Hongos empanada: crimini mushrooms, spinach, peppers, red onions, mozzarella. Probably my favorite one. Lots of mushrooms and it was also a cheesy wonderland. \n\n* Chimi papas: this was side of potatoes that came with the meal. It was a little saltier for my preference but great nonetheless. The dressing went nice with the potatoes. \n\n* Az was my waitress, she was super informative and lit up the room with her awesome energy. I ordered the empanadas based on her recommendations and was not disappointed. Not only does this restaurant have great food, it also has wonderful employees. \n\nI see why this place is 5 stars on Yelp. Best empanadas I've ever had!","date":"2021-06-11 21:32:31"}
{"review_id":"70NOZ03OGF9GmF4BIqHWZg","user_id":"RIhFmwThAdM4UhxQcr0RpA","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"If I could give this place 10 stars, I would. First. The empanadas are are scrumptious! Crispy outside with tender, juicy  delicious fillings, with chimichurri on the side. I had a bottled Yerba mate, which I recommend. Next time I plan to order more empanadas to take home for later. Second, the staff were so kind. I had accidentally left my mask in the car so I'd rigged up a makeshift one with a cloth shopping bag I keep on my keychain. The lady who took my order discretely slipped me a fresh disposable mask and said something quietly about how it would be more convenient for me for the rest of my day in town. It could have been an awkward and really embarrassing moment but she did it in such a nice way that, instead of feeling embarrassed, I just felt taken care of. What a wonderful restaurant!","date":"2021-06-12 22:40:22"}
{"review_id":"BCmHlgo4H6KNfQT8S0CvAA","user_id":"zFh-VSXtJFaNBjkDd7AgVw","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":4.0,"useful":0,"funny":0,"cool":0,"text":"Local favorite. Great food. But parking is very difficult--even for pickup orders. If you go, don't forget one or more of their desserts!","date":"2021-12-29 04:22:19"}
{"review_id":"5yWBt2R-tIC4395Rq6r8Dg","user_id":"0tYy5decTS6NORB4zs84qA","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":1,"funny":0,"cool":0,"text":"Absolutely amazing at every bite. We tried the half dozen and got the yelp check in offer of one free with it so we had a total of 7, which was all the varieties they had that weren't already sold out. We loved them all but our highlights and ones we are so fast we almost bit our fingers were the prosciutto, the caprese, the vegan and the quinoa. Yum and we will definitely be back. Also reminder they are closed on Mondays as we craved it so much we tried to come back.","date":"2019-10-08 00:12:57"}
{"review_id":"psXH54pkcUQFtY59m8b-oA","user_id":"74SJ6ysz5hivJeSPqQkhVw","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"Found this great spot by chance. Definitely worth stopping and having lunch. It was delicious. We tried several different kinds of empanadas and loved everyone of them. We will definitely be back.","date":"2020-02-14 12:23:20"}
{"review_id":"xekUxcDNMBTqkf-z5RD82A","user_id":"-SWu-Y1QE4nytP_giTlBtA","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"We travelled to here from N. California. We tried the empanada in first day and decided to buy more frozen ones back home besides the ready to eat ones next day. These empanadas are so good!! We had beef, chicken, ham, mushroom, corn and specialty ( beef brisket), they are all good! My toddler girl loves them too! \nIf I visit here again, I'll definitely come again!\nThe cashier is so patient! I called to order. I don't understand Argentinian at all, cashier was patient and nice to guide me order the correct flavors! Big thanks!","date":"2020-10-09 18:59:10"}
{"review_id":"JTRircKult91vnmngLj7xw","user_id":"y2eUKpmIXqrAB7stgX5OBQ","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":4.0,"useful":0,"funny":0,"cool":0,"text":"Great tasing empanadas, sometimes a little on the burnt side. We've ordered over the phone and in person, and the staff was equally unfriendly. Good food, bad service.","date":"2020-02-01 16:05:52"}
{"review_id":"qjArGuUQoOKib6cGq89Deg","user_id":"bwr5uzJHnK3v9VnOFNdDXQ","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":3,"funny":1,"cool":3,"text":"I'd tried Buena Onda at parties a couple of times and really loved them but even though they're only one block away from my house, they were for pick up only. Today I saw an ad on Facebook that Buena Onda now has regular hours so I thought I'd go by and see they're spot. \n \nI didn't realize they had so many options so I was excited to try some new things. They have a buy 2, get 2 Axxess deal so I thought I'd stick with a classic, pollo, and then three new ones I haven't tried: prosciutto, fuggazetta, and the calabrese special. \n\nThe fuggazetta and special were my favorites, but all of them were excellent!! They also came with a delicious little dipping sauce. \n\nThe service was pretty fast and there were cute little tables in the front parking lot to sit at too! I had all four empanadas for dinner but they were pretty stuffed with goodness and so filling, so two would have been plenty, but hey it's Friday so I went for it!","date":"2018-03-31 03:49:34"}
{"review_id":"_gIPlxkqphyOfElz5MLVHg","user_id":"_g262bsDcTM0RduKcQZdYQ","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":1,"funny":0,"cool":0,"text":"It's an amazing place , food and people are very friendly ... I love outside decorations, it made us feel comfortable even it was cold.!","date":"2020-11-30 04:39:07"}
{"review_id":"OyPDty4c50PeVByClLiesg","user_id":"zJbIRkH-qlQ5IHO6-hpwVA","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":4,"funny":1,"cool":3,"text":"The ambience of this place was so cute! I love the lights they have up outside and all the plants. I could imagine this would've been a real nice place to kick back and enjoy a nice meal with friends when outdoor dining was still allowed.\n\nAs for the food itself, I wanted to mention first that I think it's super helpful that the to go order came with a little sheet of paper that had illustrations of the empanada shapes and the filling so you know which is which! The crust for all were fresh, warm and flaky. Here are my thoughts on what we ordered, from most to least favorite:\n\nSerrano: you can't go wrong with prosciutto + mozzarella combo. So cheesy.\n\nHongos: I'm a big mushroom fan so I really liked this mushroom and mozzarella one!\n\nCarne: Flavorful and moist, more of a traditional empanada if you want the og thing\n\nSuiza: I think the bitterness of the swiss chard got to me, so I didn't enjoy this one as much but it was my boyfriend's favorite\n\nPollo: We both agreed this was a miss. It needed more seasoning or flavor, and the shredded chicken inside was dry.\n\nOverall, it was great getting to pick and choose what empanadas we wanted! The staff was very friendly and upbeat, and the food was super fresh. I love cheese and all of them had a good amount to make me one happy gal- don't forget to check in on Yelp to get a free empanada with a purchase of a half dozen.","date":"2021-01-11 06:29:31"}
{"review_id":"xgbgUliTae2Ly_5wPicTFQ","user_id":"iXpq5oUOqxN0ybJkDGTOaw","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":6,"funny":1,"cool":3,"text":"I have been wanting to try these empanadas for so long but always seemed to pass it by on my way down Haley. It's located next door to a market and inside what looks like a drive way, so it's kind of hidden. \nBut, one you find yourself inside the scents that radiate from the kitchen lets you know you're in the right place. My friend, her husband & I ordered 12 empanadas to share between us- we ordered the Pollo, Caprese, Batata and their special that day the Gaucho. Each empanada was full of flavor and crunch! I especially enjoyed the Batata (it's vegan!) it was sweet and with the chimichurri dipping side it was a mouthful of flavor that made me want more. \nWith the consciousness of us being in a pandemic they offer orders to go and family meals that are cold\/frozen so you can enjoy whenever you eat dinner. They also had desserts but after eating my empanadas I did not have room for it. I'll definitely be returning to try them out, especially their tarta de coco! A coconut tart filled with dulce de leche! Yum!","date":"2020-08-03 22:50:17"}
{"review_id":"mi8fFmV-hZJrpvLYJW0W6A","user_id":"lEHUkvSNGzP0F8k7ZFdYqA","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"where do I start... their empanadas are great and so flavorful!! I will definitely be back here when in SB","date":"2021-08-08 20:14:51"}
{"review_id":"rE9VCiXWkpAmjl6C2I6ODw","user_id":"RgtbLaiU22zqaCk20HgbiQ","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":1,"funny":0,"cool":0,"text":"YUM! I love these. We tried the Vegan one tonight and even that was tasty. We sampled 4 other flavors and each was fresh and delicious. It's run by a nice young man and his family and I am happy to support them.","date":"2017-11-18 02:51:35"}
{"review_id":"EkmLIw5k-7kwK9LB5OJr9A","user_id":"CJ_KGFVV0XnPgFCB4cWUnA","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":1,"funny":0,"cool":0,"text":"Man, this place is so good. I ordered the half dozen empanadas and wish I had opted for the full dozen.","date":"2021-04-03 01:58:15"}
{"review_id":"RmfWTAW-G0KUlJL10KUo-w","user_id":"pgapesEnlfFNLniOiGgwuA","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":3.0,"useful":0,"funny":0,"cool":0,"text":"I just moved to SB 2 weeks ago from LA, and as an Argentinean, I was stoked to see that there was a place that I could get empanadas! I placed an order around 9am to pick up at 5pm, and they were ready just on time! The place is cute and clean, and the man in kitchen seemed kind. Though, I can't say the same for the cashier, who seemed like she definitely didn't want to be there. I was happy to see that they had single Havana Alfajores for sale, and that was a great nostalgic memory from my childhood. However, the empanadas weren't anything special and for the flavor they ultimately delivered, were way overpriced. I can definitely see myself stopping by for yerba mate and a box of alfajores, but I don't think I'll be ordering empanadas from here again.","date":"2020-05-25 01:09:51"}
{"review_id":"d9aaBSPhE7SrPVN_TfODnA","user_id":"LcG-WcuV4Ynv08chi1e9_A","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":2,"funny":0,"cool":1,"text":"Wow. I first tried Buena Onda empanadas when they were catered to an event and I was so impressed I knew I wanted to try them again. I then started seeing these empanadas popping up at other locally owned bakeries and businesses around town like Old Town Coffee. I was excited to finally go to the location and try all the flavors. We used an Axxess deal to try each one and they did not disappoint. So many unique and interesting flavors, you can't go wrong. The outside patio has a cute dining area. Great place to stop for a snack.","date":"2019-11-18 21:20:50"}
{"review_id":"cDL6Sn67L8vg3SklFs4TKA","user_id":"6ZEIvCcj3xCx8TNH7-R64A","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":4.0,"useful":1,"funny":0,"cool":0,"text":"Beautiful little gem with outside courtyard seating (would make a great casual date location).   All of the empanadas were good but we found the following in taste:\n\nVegetarian, better than \nVegan, better than\nMeat\n\nYes, the vegetarian options with melted cheeses were the best.   They said the Carne was the most commonly ordered, but I found it the worst tasting, surprising. \n\nMy favorites were the Caprese (1st) and the Mushroom (2nd), and my wife's was the quinoia and goat cheese.\n\nPro-tip is get a half dozen plus one free (with the Yelp coupon), then share among two people.   You will likely be full but not stuffed.\n\nI would absolutely come back here if I wanted empanadas, but we weren't so blown away that we would eat here multiple times on the same vacation.\n\nI would probably budget $15 per person when eating here.","date":"2021-05-16 21:28:55"}
{"review_id":"J8zKvTqbIJ7P4Q9FEBFkeg","user_id":"TGDCii6alNZQf5SP9mNsHA","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"Great empanadas. I spent five years in Latin America and these were as good as any I had South of the border. Will come here again!","date":"2019-12-11 01:32:10"}
{"review_id":"vkC-TQbVqi3dHgKUhH1hEw","user_id":"4182vOVCn1OTskFaz-mRBA","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"Incredible Empanadas! Friendly services and great dining experience! Food was incredible, make sure to try out some desert empanadas!","date":"2021-08-12 20:13:57"}
{"review_id":"ycx_Y3tGaAa7v8_YsHMd_Q","user_id":"-ug7jKL4EKXIPqoFPp9-sg","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":1,"funny":0,"cool":0,"text":"Catered our wedding! We love the staff and there presentation I would recommend buena onda for any event","date":"2017-05-25 19:32:44"}
{"review_id":"GXPTwJOCg89urykI4-NLpw","user_id":"t2MBvqhOQV3ug8iUFfivCw","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":4.0,"useful":2,"funny":0,"cool":2,"text":"Have been meaning to stop and try so on our drive back from Southern Cal we stopped to order a box to go. Due to the Covid-19 outbreak they only serviced to go orders. Business was slow as expected so you would think they would be happy to see us. Not really! And for this a 4 star rating instead of 5. The empanadas were though absolutely delicious. Reasonably priced and a wide variety to choose from we found it a great choice. I do wish to return and am hoping to have a better experience. Wanted a side salad not available so looking to mix it up a little next time.","date":"2020-03-24 15:46:46"}
{"review_id":"c2JZG16K83qn0sk-5P5yLA","user_id":"IV4nONh1dewwoK7PXu_bWA","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":1,"funny":0,"cool":1,"text":"Yum yum empanadas. Vegan options appreciated for the dairy sensitive. Cheesecake is just right for those like me who don't like too much sweet but might be too small for a sugar fiend. \n\nThe Serrano was my favorite.","date":"2020-07-26 01:38:25"}
{"review_id":"zIPEqvXf3rfWrN8MSzGu4Q","user_id":"kdyaHiAFqKB0Lh1bozR1Cg","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"This was my first time trying Argentinian cuisine and I must say... the food and the restaurant's ambiance is amazing. If you're coming on a completely empty stomach, don't be shy, order at least five empenadas! You won't regret it. And if you have room left for desert, give the cheesecake a try. It's the perfect soft and fluffy texture and has an intensely rich flavor.","date":"2021-06-22 20:36:23"}
{"review_id":"2hUtnbAyHxL1ogV92CVXJQ","user_id":"DLWTBF-aagsogslDuM3ncA","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":1,"funny":0,"cool":1,"text":"This was the first thing I tried during my trip to Santa Barbara and these empanadas were sooo flavorful and well done. It's everything you wish a hot pocket tasted like. \n\nIf you eat meat definitely try the Serrano (Ham) to die for!!!!!\nIf you don't eat meat try the Hongo (spinach, mushroom) \n\nThey're closed on Sundays sadly so if you go on a Saturday definitely get a few to go!","date":"2020-10-06 07:22:20"}
{"review_id":"-G3E7bBbo2BaISeh6vTCrA","user_id":"epj4YwV5NmNwZJvDSW0VGg","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":1,"funny":1,"cool":1,"text":"I was craving empanadas and my wife and yelp saved the day!   I don't know what the difference between Argentinian empanadas are, but these are some of the best empanadas I've ever had.   They're folded in different patterns to help you distinguish which fillings are in which empanada.  My favorite fillings are the carne and the pork verde.  Great flavor and nice flaky crust.\n\nWe showed up close to closing time and they were very accommodating and friendly.  If you are ever in the area, the place is a little hard to find and we circled around a couple of times, but I think there are some trees with white Christmas lights out front!","date":"2021-12-15 01:08:53"}
{"review_id":"EN6vptoHgPA5lUqeUgr4vg","user_id":"zf4ad7BOkX50q5mehNI7CQ","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"Hands down best empanadas I have ever had were here! Their menu has great options and the prices are reasonable. I was vacationing for a few days in Santa Barbara and found this place and it didn't disappoint! I only wish I had ordered more to bring back home. Salad was so good! Empanadas were so delicious! Flavor is on point! The sauce on the potatos just makes them taste sooooo good. I should have asked if they sold it! I wish I had a place like this where I live, I would be eating there frequently. Check them out if you get a chance. Oh and their customer service is EXCELLENT! They go above and beyond! If I'm ever in town I will make it a point to eat here again! And bring back an order for home!","date":"2022-01-10 02:04:20"}
{"review_id":"IDD_a2FCFey2aZ-NkYaV6w","user_id":"IzkHZPK_tRE1LWruc3AgwA","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":1,"funny":0,"cool":2,"text":"Amazing empanadas!!! Every flavor is reach and satisfying! We come back every time we visit Santa Barbara! We usually get it as takeout and eat at the nearby park. Highly recommend!","date":"2020-09-20 23:04:07"}
{"review_id":"zHxh0iLrfZDq2B-bI2QusQ","user_id":"R15f16KMgZoVPWiJdVdO7Q","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":2,"funny":0,"cool":1,"text":"I got the pollo, serrano and carne empanadas and they were all damn good. Would recommend this place if you're in the mood for empanadas","date":"2021-06-25 22:50:58"}
{"review_id":"pOVHpd0dpVfl-69JLKPKuA","user_id":"mRIMMbqALambba2brJ25Kw","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":2,"funny":0,"cool":1,"text":"The best empanadas in town! After hearing great things about this place, I decided to order a few dozen for a work event and called ahead a couple days in advance. \n\nOrdering was super easy, the person who answered the phone made some great recommendations and helped me pick some vegetarian and non-vegetarian options. When I came to pick them up the day of, they were just coming out of the oven - hot, ready, and fresh. They came with extra sauce containers and the employees even labeled each box for us! \n\nMy personal favorite was the quinoa empanada, though the caprese one was a top contender too. Everyone was impressed by the quality of ingredients and several people asked where the food was from. 10\/10, would definitely come back!","date":"2018-08-05 07:46:57"}
{"review_id":"FIZp-U9TbL9n5AiYAzISDQ","user_id":"vdYjx3eWJnGN3E2p1OOCgg","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":1,"funny":0,"cool":0,"text":"Just wonderful and a great treat right now! We ordered six empanadas, Carne (2), Pollo (2) and Serrano (2), and a side of the potatoes. The Carne has amazing classics Argentinian flavors. The Pollo is in a delicious red sauce. The Serrano (ham & cheese) was the break out winner and surprise. It's light in a certain unbelievable way, with a perfect spice from the peppers. You can absolutely eat these for any meal of the day! We are already planning to pick up a dozen on New Year's day for the following morning.","date":"2020-12-15 22:02:56"}
{"review_id":"ziix8NETFclqVnTwSurvzg","user_id":"jV4gCtakqbV8rIaGn_A4bw","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":8,"funny":1,"cool":6,"text":"Delicious! We ordered a half dozen, and it seriously did not disappoint. Every bite was so, so heavenly. Their delivery through GrubHub is very convenient - they arrived right on time and still fresh out of the oven! Also, their chimichurri is on point. They have a variety of vegetarian\/vegan options if you are under any dietary restriction. \n\nAlthough they're a little on the pricey end, if you have someone or a group to split a half dozen with, it's fairly reasonable - unless you have a huge appetite. It's $22 for a half dozen, not including tip and tax. I can't say much for the actual restaurant as I only did delivery, but I am planning on checking them out in person! \n\nOverall, great, great place and idea. I'm excited to see them take off! Buena Empanada!!!","date":"2018-11-04 06:10:26"}
{"review_id":"liEiZRO8us5-GSVOc_WboQ","user_id":"tvt_zGLlQ9Lg-uPdI_DcCA","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":1,"funny":0,"cool":0,"text":"It was my first time here and I was kinda overwhelmed by the options at first. The worker was super nice and gave great recommendations! I got an assortment of empanadas and they were all delicious and piping hot! My favorite was the beef empanada with a little bit of chimichurri stuffed inside. I would definitely recommend!","date":"2021-06-20 23:24:24"}
{"review_id":"CssXXF0oWZ02I-tbaZtkuw","user_id":"ECCqgviDjw579i_LaAwc2g","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"Absolutely amazing place to eat. Great dishes and using sustainable options for cutlery and plating. Would highly recommend this place for anyone living in or visiting Santa Barbara.","date":"2021-03-18 20:32:13"}
{"review_id":"QZdyx7gG-cR0OCGQRKR_Wg","user_id":"nAfIOZK3EfwbSW95g-PVAw","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":2,"funny":0,"cool":1,"text":"Best empanadas I've had (granted I have never been to Argentina). Lots of mmmms and yums happening throughout the meal. Staff was friendly. We got the 2 empanada meal each and ended up getting a third. Highly recommended if you are in the SB area!","date":"2019-12-27 00:20:02"}
{"review_id":"sSrxhsFaJc9ER0semdMy4A","user_id":"xDfdt3mG77y5Wb3M8l5vUg","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"The man candy and myself were spending time in the big SB for a few days and ended up getting these bad boys in pollo twice. Let me tell you, they were bodacious. The moist chicken hit me with that spice spice that I oh so love, and was complimented by that warm breading, MMMPH.  And the potatoes with that garlicy good good were just enticing. Get that 3 empanada and side combo for a good time. Eat happily my friends.","date":"2019-12-19 17:02:46"}
{"review_id":"b7rGyyzcLrr7I3XsMm38Qg","user_id":"iaf_YTW9hFLUD5U02BsTyg","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":1,"funny":0,"cool":0,"text":"These were the best empanadas I have ever had.  My husband and I were arguing over which one was the best.  I loved the caprese one, he loved the mushroom one. The chicken and corn ones were great too. The salad and potatoes were delicious.  There was a great courtyard to eat in. We will be back.","date":"2021-09-23 16:28:20"}
{"review_id":"j4iLl1jckx87bcCzO4zabw","user_id":"i9fpIqsFEmwAUShQ0ZGBKQ","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":3,"funny":0,"cool":1,"text":"Empanadas were fresh and yummy!  Baked not fried, so lighter and less greasy.  We tried the prosciutto, beef, and chicken and my favorite was the prosciutto - the melted cheese was delicious.\n\nVery friendly and prompt service.  Empanadas took about 15 min to make.\n\nParking is a bit tricky in the neighborhood as it's parallel parking only and there are a lot of driveways and fire lanes.  However, the cafe has a tiny little parking lot right out in front, fits 3-4 cars.  It's easy to drive right by the entrance if it's your first time here.\n\nThey have a charming little outdoor dining area with heaters and string lights.  Tables are spaced 6+ feet apart.","date":"2021-03-05 02:20:05"}
{"review_id":"feGEFhFCJ5Naeyt4Dy6WNA","user_id":"XNb9Hbk7CBRoADHSh7crWw","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":1,"funny":1,"cool":1,"text":"come grab an empanada and a beer from draughtsmen. A+ bites to go with great beer! love this little spot","date":"2021-06-05 20:39:07"}
{"review_id":"KE_4ofnaMJW2fSuuKGC8Uw","user_id":"5Rs0NUITmx2mR1814Yx0cw","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":0,"funny":0,"cool":1,"text":"Recommend the Capresse, Mushroom, and Quinoa empanadas. High quality food. Outdoor seating, meal specials, friendly and helpful staff.  Small parking lot but there's bike racks available. Entrance god for wheel chair but bathroom is small.","date":"2021-02-14 21:13:49"}
{"review_id":"0OJH1hD_2LMlNTaVJKQpvg","user_id":"1lk9t5tZuuIHoqelizk-dQ","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":4.0,"useful":1,"funny":0,"cool":1,"text":"Delicious pastry and chimichurri sauce! I got half a dozen and it's enough for two people. I tried the chicken, ham, corn, mushroom and caprese. My favorites are chicken, ham and caprese. Corn was my least favorite. Caprese is very much like a stretchy cheese hot pocket. Get at least two chickens.","date":"2020-08-26 02:28:16"}
{"review_id":"vXGHN19ujQhP0IcBVXhTqw","user_id":"j57UDGg2R9PWlsAzPpaEvA","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"Delicious empanadas with nice outdoor vibe dining in SB. I'll definitely come back here and recommend this place for breakfast or anytime","date":"2020-11-12 02:10:54"}
{"review_id":"v2puhvHg93r9L_UdEW8niw","user_id":"K-v8eB2Z-X8HbFMGY2GuuA","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":1,"funny":0,"cool":0,"text":"\"Artisan fresh baked Argentinian  Empanadas\" \n\nFood:\n\nThese are Delicious! I've come here quite a few times. The Hongos and Buen Dia are my go-to's. They also serve these empanadas at the Mosaic on State Street. Just as delicious if you can't make it to the Haley Location and need an empanada fix.\n\nThe Chimi Papas are a must and a hidden gem are their sauces. Garlic Aioli, Spicy Garlic Aioli, Chimichurri, Spicy Chinichurri, and a Salsa that goes great with the Buen Dia.\n\nNone of the salsa are overly spicy and stay true to Argentinian flavor profiles, so enjoy! \n\nParking:\n\nI've only come on Sunday mornings so keep that in mind with this review.\n\nThe parking lot is quite small, if needed there is also plenty of parking along the street.\n\n\nCustomer Service:\n\nYou know how I know about those salsas? Because I am sauce boss? Maybe.. but moreso because the employees here are knowledgeable and friendly and informed me.\n\nGreat food, wonderful service!","date":"2022-01-09 20:39:19"}
{"review_id":"TeMFKixYOFLy9U9GYCZ7Pw","user_id":"Y_L55UvEd4Hn2lV8szWm5A","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"What an AMAZING place!!! A must go to for the most delicious empanadas, potatoes & coconut + dulce de leche tart!!! Highly recommend!","date":"2021-11-24 21:19:29"}
{"review_id":"d2M7T7enTiw-xuXS8Pssrw","user_id":"omil00i3YWlmSuyxn31H5g","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":3,"funny":0,"cool":1,"text":"Stopped by to grab some empanadas to-go while on my Santa Barbara trip and they were phenomenal! Service was quick and the staff were happy to make recommendations. Seating is mostly outdoors and there is a small parking lot for customers. \n\nWait time was about 15 minutes but I don't mind at all because the empanadas were made so fresh they were piping hot! They had plentiful vegan and vegetarian options which is always appreciated.\n\nI got a half dozen (make sure to check in for a free empanada with a half dozen!) and they came with a delicious herb oil to dip. My favorite flavors were the carne\/beef (super flavorful and spice-y) and the pollo\/chicken. My friends really enjoyed the hongos (mushrooms and mozzarella) and humita (white corn and onion). The folding on the empanada indicates the filling and theres a helpful guide provided.\n\nOverall, it was a bit pricey but justifiable for me. A must to stop by when you're in Santa Barbara!","date":"2021-09-16 16:00:48"}
{"review_id":"SPT5opsi-ZXXVra_SCo6CA","user_id":"5QpyILNeiHUYNYlqeEwI1A","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":1,"funny":0,"cool":0,"text":"Stopped in with a friend on our way up the coast and it was so good! The empanadas are the best I've had seen since South America","date":"2020-03-09 02:03:38"}
{"review_id":"o2yFv1BriPEk6TSI3g2l9A","user_id":"AoSkKXkeqp9qGd-AElXaag","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"Most amazing food in Santa Barbara. We tried quinoa, humita and chicken empanadas- all awesome. Chimi papas good too but paled in comparison so we passed it the 2nd time.","date":"2021-06-04 01:35:55"}
{"review_id":"aRDrEs_KPifWFAQtk2PklQ","user_id":"-43Qw0dZRaO7dZY017pp_w","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"amazing,, incredible, Best in the west.the pastry is flaky and delicious.  The salad I'd tasty too. Just amazing.","date":"2021-10-23 05:43:29"}
{"review_id":"KMFe60gnsogSiOL-V7WWNQ","user_id":"DhFSh5r6BqEgwg8QbYVroA","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":4.0,"useful":1,"funny":0,"cool":0,"text":"Chicken and beef are really good. Moist and not dry. The ham one could use more ham, and less cheese. Their Chimichurri sauce is a delicious condiment for these empanadas, but they are also good without it. The preorder thru the yelp app was amazingly convenient and it was ready to go when I arrived! Great service! Stop by and support this small shop if in town. They are not open certain days of the week, so check before you go.","date":"2021-12-26 20:25:23"}
{"review_id":"KtJQ_Bhu1LAaJhqcLMrliA","user_id":"9JqC9eEToAOeVqyeLZ7VjA","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":1,"funny":0,"cool":1,"text":"Great find in Santa Barbara. Cute patio, great service and amazing empanadas!  There are a lot of types to try and you can order a half dozen or dozen. Really good!!!! We will be back.","date":"2021-10-24 18:48:58"}
{"review_id":"Jc7YkOGZnvAOL0XeWE38eA","user_id":"69qAxnG2ARbolXNHphbhyQ","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":3,"funny":1,"cool":2,"text":"I've gotten to try almost all the empanadas at Buena Onda and my favorites have got to be the carne (packs an intense punch of flavor) and serrano (prosciutto & mozzarella - so cheesy and delicious). Nothing beats having them freshly baked and golden, slightly crisp on the outside and steaming and tender inside! \n\nI got to visit the storefront itself for the first time recently and I expected just a small grab and go situation but it has a great outdoor seating area with even a large TV!","date":"2021-10-13 02:50:48"}
{"review_id":"B8_chd2aSQzddpcdANL4Cw","user_id":"NKRgQwaKNbRXXSj2Nf9YLw","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":2,"funny":0,"cool":1,"text":"Made to order, so the empanadas are incredibly fresh in addition to being delicious. I didn't realize this isn't really a dine-in establishment. There are two counters to sit at inside or there's seating outside in a courtyard. Normally, sitting outside would be fine, but we went when it was cold and windy. \n\nI'd recommend getting 2-3 per person if you're hungry. They're $3.50 each, so super affordable! Yelp check-in gets you a free empanada when you order a half dozen or more.","date":"2019-12-02 00:49:06"}
{"review_id":"72cuJGR4wdfaqYMIcINIiA","user_id":"QtGoTMUolvf1RDTd2lHNUg","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"These empanadas were  especially the mushroom and beef ... they were out of chicken when I went but I imagine it would also be delicious.\n\nThey have a great deal of 3 for $15 but is also are served with either a side of potatoes (yummmmm) or a garden salad  \n\nThe outside is nicely decorated but we took ours to go and ate at the beach for a nice picnic. \n\nIf you are in SB definitely make a trip to try these out.","date":"2021-05-31 02:18:58"}
{"review_id":"ocF_1BrKrW2axKiUbCictA","user_id":"X-rdf2BAcnhbfz8U0bRAWQ","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":4,"funny":1,"cool":2,"text":"Empanadas, YUM! Who doesn't want a little delectable treat with so much variety? We ordered from Buena Onda while we were at pure order brew co., and how convenient that we can have it delivered to us. These empanadas are on the smaller side than I'm used to, but they are oh so delicious. With the size, it just means you can order more and more flavors! \n\nMy go-tos are carne, prosciutto, and of course the caprese. The Caprese is my favorite and I wanted 10 more of them! The prices are good for the authenticity, so next time you want a snack, order a few!\n\nSYOY,\nJess H.","date":"2018-09-25 22:54:28"}
{"review_id":"iV5m3aIFrITI1YOjlujWuQ","user_id":"o22x7tpqwrTPIDUpnrR4lg","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":3,"funny":1,"cool":3,"text":"Our first stop on our trip to SB. They have a really nice outdoor seating area. \n\nLove their menu options, which caters to meat lovers, vegetarians, and vegans. \n\nT had the combo of 3 empanadas and chimi papas. They are very generous with the chimi papas, which were delicious. Of the carne, serrano, and hongos, T's favorite was hongos. \n\nI had the humita, hakuna batata, and quinoa. My fav was definitely humita. In the quinoa, the goat cheese was all loaded on one side, so I didn't really get a taste of it until I'd eaten half. Hakuna batata is on the sweeter side due to the sweet potato. \n\nIf I were local, I could definitely see myself becoming a regular or ordering to take home and bake on my own.","date":"2020-09-11 01:26:14"}
{"review_id":"4bLoELIrTWWfOFID8SYi4w","user_id":"rbiEdLObwLdBg2SD_tHUqA","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"Always ask for their special! Their roasted potato is a must too! Definitely will be coming back from South Bay!","date":"2021-08-30 04:07:31"}
{"review_id":"uaqVsDqIjDszhvhSJ2kwcA","user_id":"N44pU2gHQ-Ax4gyRevt3Tg","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":2,"funny":0,"cool":1,"text":"Beautiful courtyard to enjoy best empanadas around. Favorite was the caprese. Wishing we could spend all day here.","date":"2020-07-11 20:31:03"}
{"review_id":"JDKWVgxfey_R3NLhp2cK7w","user_id":"aXWRg6or3g4vHj52v_l-QA","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"Fantastic empanadas, very authentic, the atmosphere is great. Highly recommend the place.","date":"2018-11-10 19:59:34"}
{"review_id":"ENgdWoi52uigpTPSGsk8nw","user_id":"asXgHS43jPMmitthBEC38g","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":1,"funny":0,"cool":1,"text":"I accidentally found this place trying to get to Hook & Press next door & I am so glad I did! We were on our way out of SB and I took a dozen empanadas ($45) to go. I chose half chicken and half Gaucho (shredded beef). \n\nThat same day I ate one hours later cold and it was delicious with the Chimichurri sauce they give you. But the next day I heated them up per their instructions in the oven and they tasted like they were just made. It was flaky, buttery, and they don't skimp out on the filling of delicious shredded beef with seasoning and potatoes. \n\nI've had Argentinean empanadas in Spain and these were better. I actually liked them more than the ones from Portos in LA. They are pricey but my family was super happy to have this treat from SB so it makes a great gift!","date":"2021-06-11 19:25:17"}
{"review_id":"zTX5PmdJ-VEf7Hy80r50Gw","user_id":"MoB8IJKg3QMpTHG8BppiqA","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":3,"funny":1,"cool":3,"text":"Excellent.\nFriendly staff and quick service. Truly delicious and not overbearing empanadas. \nIt took a lot of restraint to not take home a frozen batch for later, but this is definitely a place I'd come back to if passing through SB. \nThe other reviews on this page were initially what caught our eye in coming to try Buena Onda. My expectations were exceeded. \n\nWonderful outdoor dining experience. Probably a good idea to pick a cooler hour to come here. We were there on a temperate evening, around 6pm as the sun was beginning to set. I think that kind of climate is the best time to enjoy the warm food here. But that's just my personal taste. \n\nDon't sleep on the vegetarian and vegan menu options. They were some of our favorites we tried.","date":"2021-10-02 20:11:55"}
{"review_id":"HpkZzvilVJwkmPe0tviMZw","user_id":"2Ajwle6egT9nWq2VaTVxiA","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":4.0,"useful":5,"funny":1,"cool":4,"text":"SO GOOD! I finally made it to Buena Onda; the empanadas are just so tasty. Even when coming in at the end of the day, the cheese is soft and melted and warm, the vegetables are soft and flavorful, and the wrap is flaky and satisfying. My only grumble is the price, but for such a delicious, made-from-scratch empanada (especially in the Santa Barbara area), it's unbeatable. I'll be back for sure, to try the rest of the incredible array of flavors they have to offer!","date":"2021-10-07 03:15:46"}
{"review_id":"AyjgwgwRbOZDeW-KxemadQ","user_id":"fDzO-WaofnCShu-CqE3u7g","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":6,"funny":1,"cool":2,"text":"YUMMY! I'm so thrilled to have found this place!  We were passing through Santa Barbra and decided to make a pit stop for lunch. My husband found this place through yelp and seemed like we could have a quick lunch here. They had parking which was a bonus as we didn't have to drive around looking for a spot. \n\nWe ordered half dozen empanadas, and after waiting for just 10 mins they came in hot from the oven! These were the best empanadas I have ever tried. All empanadas were crunchy on the outside and had generous filling. My favorites were Pollo and Carne. The chimichurri served with empanadas was yummy too. \n\nThe place is really small, they have.5-6 tables outside. It wasnt busy when we arrived. When you walk in, you order at the counter and wait for your food which is great for quick meal.","date":"2018-12-27 21:50:02"}
{"review_id":"ns6e8rRY-GuDWWH8bwvmjA","user_id":"7cEMc27p5J9Xx0ccXpCGTg","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":3,"funny":0,"cool":1,"text":"I'm a huge fan of Buena Onda and I love their empanadas, and I'm so happy that they've now extended their menu! I got some of their meals to-go and wow, I was not disappointed. Hands down the BEST LASAGNA I have ever had! My husband and I ate the whole tray and could have eaten another, that's how good it was! You can tell they use really high-quality ingredients. On another occasion, we got the eggplant parm and the veggie lasagna which were also DELICIOUS, we totally didn't miss the meat. Great portions and prices overall. Make sure to grab some dessert as well, the tiramisu and the cheesecake are to die for!","date":"2020-04-12 23:55:28"}
{"review_id":"gDfm5mKuLUl8g9tfzBS-5A","user_id":"k-X8b7ikZxVPKhHZj82kfw","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"Delicious empanadas. Highly recommend. When we are in the SB area we love to stop at Buena Onda to get some empanadas. I love the Humitas and the Serrano with some fresh chimichuri.","date":"2021-04-26 22:15:22"}
{"review_id":"md6WOgTLneZ3tQVgNqEoUQ","user_id":"NvZpKcQp_ISDcZKqlAe8ww","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"This place brought me right back to Argentina with my grandpa. I love the food and can guarantee its authenticity. So happy I found this hidden gem. 10\/10 recommended","date":"2021-07-25 20:29:15"}
{"review_id":"Sgdr63fXXufpw_wfv7a19w","user_id":"yNYMJJYptMcjFFg-NPkP3w","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"Lovely spot for a quick bite to eat! Called order in ahead of time and the workers were really helpful. Ended up getting 3 different empanadas- all were great!","date":"2021-05-21 06:01:51"}
{"review_id":"KVoUooTs6jJ_rrcXBdQyRw","user_id":"wiY9NSHXX19jchvBVBal1g","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"Comemos empanadas argentinas muito gostosas e um preço justo super indicamos lugar muito agradável .","date":"2021-12-30 20:26:44"}
{"review_id":"w9t5ZsZ1E2YGwvu9M8hYJA","user_id":"41m9Kp_HCztXMr_Fx7eKQw","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":1,"funny":2,"cool":4,"text":"It's getting five stars because no reason not to! Not the type of food I usually go for, but it was delicious! We had empanadas and some potatoes. They were really great. And the place is neat like a little villa for outdoor dining. I had ordered ahead. Food was waiting. Not over priced. Excellent friendly service. I'll be back again in the future.","date":"2020-09-08 18:17:49"}
{"review_id":"1ze4ko9wYLpQUbnt59IPzw","user_id":"z1XnHAEhzfTcVo7In-glRg","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":1,"funny":0,"cool":1,"text":"Delicious food and a great vibe. \nWe ordered ahead, thinking we'd take it to go, but changed our mind when we saw the dog friendly patio in front. The staff very easily swapped our order to eat there. We didn't have to wait very long for the order to come out, and the trash cans are out front so we were easily able to clean up after we were done.\nWe got 6 empanadas and the chimi papas. The empanadas were really tasty and soft, and the fillings were very good. We got humitas, hongos, carne, and the special chile verde (pork).  The humitas were my fave, and the bil said he liked his meat pies. The potatoes were very flavorful, not to greasy,  and the chimichurri had a really nice herb-forward flavor the balanced with the empanadas without fading into the background. I personally would have appreciated a touch of acid, but regardless it was very good.\nWhether you're local or just passing through, it's a great place for a quick lunch for a decent price and good service!","date":"2021-09-11 22:03:54"}
{"review_id":"DB1BgTmrTZRsziAY8PWwtA","user_id":"IhIGIkdeGtF2kb42prIT5Q","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"So amazingly delicious!!! Reading all the positive reviews, we thought they either have a lot of friends, or it's really good. Now we know it's true! Being adventurous, I got the daily special, which was the Gaucho - brisket, potatoes, tomatoes, and red onions. With or without the chimichurri sauce, it was a heavenly meat pocket! I also got the Serrano and the sweet potato & spinach one (I forget the name) and they were all delicious!!! Husband had the papas and I had the salad, and we need a wheelbarrow to get out of here, but worth every bite!","date":"2021-04-10 00:06:00"}
{"review_id":"hShWrrX5XVMNuOBujo8j_g","user_id":"o_CawrLclOg8SZZZOfgktw","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":1,"funny":0,"cool":0,"text":"AMAZING. We tried four different empanadas. Pork, beef, corn and chicken. The meat in the empanadas was tender and succulent! Ordered two entrees, one with a salad and one with potatoes. The salad had a really nice, light tasty vinaigrette and the potatoes were sublime! Can't wait to go back!","date":"2019-12-29 04:13:00"}
{"review_id":"9OWo87rP6DOSstb4pwIJEg","user_id":"GOb0HwvkHiXtAaGccaEteA","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"This was delicious. I would definitely make the hour drive from home just to eat these. If you're in the area or even if you aren't you should come!","date":"2017-07-30 01:53:47"}
{"review_id":"1rkiBjwrouy-Jeiuk14cow","user_id":"w_ERwqX3yEyDwmdZwvaOlw","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"Take the vegan empanadas to the beach and enjoy a Latin vacation getaway right in your Santa Barbara backyard. The most comforting, doughy, flavorful treat it is almost nostalgic.","date":"2021-05-27 12:54:12"}
{"review_id":"d4JT8Yr9K1lxnWZphm4cpQ","user_id":"dGIT8U0gHKsxIDbsPfkbUw","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":4.0,"useful":1,"funny":0,"cool":1,"text":"The caprese and ham empanadas were delicious!! The beef empanada was alright but less flavorful \n\nVery cute decor and seating here. Easy parking on the street. \n\nSlightly pricey for each empanada, but would come again","date":"2021-08-18 18:26:23"}
{"review_id":"VmnhVLfnSbLfIO0YVtgKbA","user_id":"bbulrtJIjvW11lG-c9q4Pw","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"Mindblowingly great empanadas. I was shocked how great these were, even with delivery. Look no further for a place to go in Santa Barbara. The fillings were creative and very well executed, and the chimichurri was great. If we find ourselves in Santa Barbara again, this is the first place we'll go.","date":"2021-11-20 04:46:08"}
{"review_id":"KS1bmG1lIcfqbACrkX-X8Q","user_id":"q7kVcrge-rn9dE0FNGDLWg","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":4.0,"useful":0,"funny":0,"cool":0,"text":"Great empanadas! Baked and the dough is soo good and well made. \n\nRanked with favorite first\n- Serrano: wow full of flavor, nice and airy lightness to balance the heavy cheese and salty prosciutto \n- carne: full of yummy beef. Goes great with the chimichurri\n- caprese: also very good, have to give the edge to the Serrano though if you're vegetarian this is a great option! \n-  pollo: flavored well. Not a fan of the white meat. This was decent but wouldn't get again.\n- hongos: this one was bland. Needed chimichurri to make this a chimichurri flavor lol. It was only mushrooms and cheese, I didn't see any spinach or onion nor did I taste it. Disappointing as I LOVE mushrooms.","date":"2021-10-09 20:44:51"}
{"review_id":"3TZV4wIH_p7sF7MP_GazFw","user_id":"Bll3fTLbEonipPpIq8JAGA","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":1,"funny":0,"cool":0,"text":"I ordered three different flavors for a total of 4 Empanadas. They missed on but that can easily happen no not a big deal. I'm sure if I call and say last time you missed one they would gladly add extra one to make up. The special was Turkey, it was a bit too dry for me but my brother loved it. The cheese basil and they house special was amazing!","date":"2021-12-28 00:18:59"}
{"review_id":"1eVa8nm-bW4yKnobcviTgA","user_id":"nMm_0OssCjBINUYCx2NohQ","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"Tired of the same thing for dinner.  Try these Argentinian Empanadas.  They are great.  My 91 year old mom had never had empanadas before and now she is hooked.","date":"2021-12-24 20:44:14"}
{"review_id":"ONQEmNXHaV-QkSkHQZE-pQ","user_id":"EGULPu2yT62INTLV0A47hw","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":4.0,"useful":1,"funny":0,"cool":0,"text":"This place is definitely a hidden gem. The ingredients are super fresh and both empanadas we tried were awesome. Very vegetarian friendly. Keep in mind that it does take 10-15 minutes to get your food, so it's not a quick stop, but so worth it. Would definitely call ahead and get a few ready to pick up if you're in a rush.","date":"2019-05-18 20:18:43"}
{"review_id":"kBiImVW054O-jxNntMG19Q","user_id":"4SuXd-p4bDgLyPUZHYCCbQ","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":1.0,"useful":0,"funny":0,"cool":0,"text":"My sister and I wanted to like this place but service was bad. Waited almost an hour for our food, our order was wrong twice and our food was lukewarm. It wasn't even busy. An hour and a half wasted at Buena Onda on food that was just okay. The one star rating is given only because the hostess was nice and apologetic enough to offer a refund for the entire order. If not, I would have not even given a star at all.","date":"2020-09-28 04:33:17"}
{"review_id":"R4gFoEO7W3g6w4wvDLdLiA","user_id":"JcyUuN7Raro0chG0R440pw","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"Stop what you are doing and eat here.  We ordered a family meal - 3 beef empanadas and 3 Chicken Empanadas and an order of Chimi Papas.  The food is so damn good.  Crispy light breading and perfectly seasoned meat. And the service was so warm and friendly.  We got it to go but they have a great outdoor seating area.  Cannot recommend highly enough!","date":"2020-11-15 03:52:18"}
{"review_id":"zLLSCKrvt725mcBVYNON0g","user_id":"SvwD0zPT9So6cqgEsAhmWg","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":3,"funny":3,"cool":3,"text":"WOW! I did not know a piece of Argentina existed in Santa Barbara! All that was missing was a cold glass of Quilmes, or my friends passing around la bombilla. \nI ordered a half dozen for NYE and everyone loved them! If I can recommend two absolute must-get\/must try is the carne and the pollo. The carne empanada taste almost like the way my neighbor use to make them. And the pollo tasted just like the ones I use to have down in Buenos Aires. Both empandas were extremely flavorful and had a good amount of meats in them. I also ordered the Bondi, which was a special. That was incredibly delicious! The beer braised pork was so good, and the meat was tender and delicious. If they have that on the menu, it's a must get. The prosciutto was really good too. It was very cheesy, so when you eat it and then realize there's prosciutto is like a nice surprise. I also got the potatoes which came with a type of salsa golf, or a mayonnaise sauce with habanero. It gave a nice kick to the potatoes. If they start serving choripan, I would be here like everyday.","date":"2020-01-02 19:53:22"}
{"review_id":"5UXs1NX3wefXFuO9yTEicw","user_id":"NwaDnHL1xlFXTHv3_se_Vw","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":6,"funny":1,"cool":5,"text":"Very good empanadas. I've tried different kinds locally but these have a light and fresh taste to them. Our order was baked while we were there in about 15-20 minutes, while we sat in the cute patio area out front.\n\nIf you've never had these, it's similar to a mini version of an Italian calzone. \n\nWe ordered the half dozen + 1 free extra for Yelp check-in of the following fillings for a family of four:\n\nCaprese... 5 stars... the tomato, basil and cheese combo was very familiar to the kids and these were gone in no time\n\nHongos...5 stars... mushroom, spinach, onion and cheese filling were popular too. Glad I ordered 2 of these and the caprese\n\nHumita...5 stars... the corn and onion combo was delicious for me \n\nQuinoa...5 stars... quinoa, soft cheese, onions, peppers, and spinach was also really liked by the hubby and me. Not so much by the kids\n\nVegan...4 stars...our least favorite of the bunch. A vegan version of the regular quinoa empanada. I think since the cheese lacks the melt of the other empanadas, the flavors didn't meld as nicely. \n\nPatio area...4 stars... keep in mind that they make the best of the industrial area they have. The pation is in a parking lot, but how lovely to be able to sit outside in a cute space!\n\nBut the price point and vegetarian friendly offerings are great - it allows you to take a chance and not regret trying something different. Lives up to the high reviews. We shall return!","date":"2020-12-03 07:47:30"}
{"review_id":"aWG_zM2ZyOg6fFamCTKDog","user_id":"MICO1G49b4kCrKDqOMpsxQ","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":12,"funny":7,"cool":13,"text":"The best pastry dough I have ever had! So soft, pillowy, yet flaky and crispy at the same time! \n\nI definitely recommend getting 3-4 per person and mix and match flavors! Maybe even get one of each! My personal favorite was the hongos and the customer favorite is the carne. Whichever flavors you get, it will be delicious! Also, the filling to pastry ratio was just perfect. Not too much filling not too much dough(: \n\nAlso, can we please applaud their packaging and how eco-friendly everything is? I should have taken a picture of the togo bag they gave me but it was so cute and recyclable!","date":"2021-04-11 15:46:20"}
{"review_id":"Ak20D8j0aEsaph2bWV50xw","user_id":"c47O_0nY1v39zW788UV_Yg","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":0,"funny":0,"cool":3,"text":"The empanadas were amazing and the atmosphere was so relaxing and inviting. The staff was very kind and helpful with their suggestions.","date":"2021-11-02 18:20:21"}
{"review_id":"iEGfXeP8fNKg28bWQlAscQ","user_id":"Z96cSgfw2zohLlNndgKSiw","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":2,"funny":0,"cool":1,"text":"I really liked these empanadas, very good flavor. We had 3 different ones : hongos, ham and capresse. My favorite one was the hongos!!!","date":"2020-06-19 19:03:35"}
{"review_id":"BHsYYLvRLntNSo_P7Zg0qQ","user_id":"yDPCuQ3KHatfxCqVo4aOjQ","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":2,"funny":0,"cool":4,"text":"We have nothing like this in SB.\nThe 6 empanadas can feed 2-3 people.\nThe mushroom empanada has a lot of cheese in it, very good, but I was expecting something creamier.\nThe chicken and beef were mouth watering!\nAnd the customer service was great!","date":"2020-07-31 02:31:56"}
{"review_id":"iStLMNXtjXECgNLRNHnOSA","user_id":"smne9gc6UEzIvW_46f00bw","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":4.0,"useful":0,"funny":0,"cool":0,"text":"We were visiting the area and needed a place to eat lunch. The empanadas were great. I liked the chicken most of all. My kuds liked the Caprese, whiche they likened to pizza. We were able get even my uber picky older son to eat the Caprese. My wife liked the mushroom one best. The only flaw was the that the wait for our meal was a little longer than expected.","date":"2021-05-23 20:14:58"}
{"review_id":"PibmRmLGbPkVL0vF2h69Sg","user_id":"IM7OahH2_Flm4D_3TlhoQQ","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"We ordered 12 empanadas for 4 of us - that was enough and we loved all of them. Mushroom is by far our favorite. They were delicious and hit the spot. Highly recommend!","date":"2020-11-08 03:45:13"}
{"review_id":"IxWTAWEM_ORPYnQOPXwJpg","user_id":"qE2pBcnkXWPRqRgFVyOTEg","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"My brothers GF had heard of this place, so we decided to check it out. I was expecting just a small little place that sold just empanadas but was surprised to see they have full on meals. I ordered the 2 empanadas combo, which is your choice of 2 empanadas and a side. I ended up getting the special empanada of the day, which was the Gaucho and the chicken. The brisket in the Gaucho was mine and my brothers favorite, it was tender and moist with lots of flavor!! That's not to say the chicken was bad, the chicken was also delicious, and moist with lots of flavor. The potatoes that come on the side were also packed with flavor and they give you these sauces on the side that you can dip your potatoes in and put on your empanadas. If you are looking for delicious empanadas I suggest this place.","date":"2021-01-16 02:25:23"}
{"review_id":"YgIVqelddSZFyLK3BEObAg","user_id":"HlWjyvji7f9x8A3cy4r1DQ","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":1,"funny":0,"cool":1,"text":"This place is awesome.  I had the beef empanada and chicken empanada and I cant figure out which one was better, both were great choices. My wife had the Buena Dia (breakfast empanada) which was good but she said the beef and chicken were better.  The outdoor seating was great with plenty of shade and a cool breeze.  I saw a couple bring their dog so it is dog friendly.  I will definitely come back here next time I am visiting Santa Barbara or nearby.","date":"2021-06-27 18:32:02"}
{"review_id":"Q-tKh_2nMTfFPbQtBWIqzg","user_id":"rxrAJIJ7X2p0Up4Jg2FtZg","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"Really fresh and delicious and fairly priced. Also the staff was friendly and the outdoor dining is really cute. Highly recommend! We'll be back.","date":"2021-04-10 17:19:08"}
{"review_id":"D2Gp7p0DvUfgLpzjVxpMpQ","user_id":"G0pJkhMYuZpaoy9RJV0SYg","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":3.0,"useful":3,"funny":0,"cool":0,"text":"The food is 5 stars and the vegan and vegetarian options are great. The service is pretty fast and friendly, but check your takeout box before you leave! \n\nLast time I went I ordered a half dozen and only received 5 empanadas despite paying for all 6. My fault for not checking the box before leaving the store, but still disappointed given that it was not busy and I haven't ever had issues before.","date":"2020-07-13 18:26:23"}
{"review_id":"B_ionaaqT9H6JTUNXJUyVA","user_id":"zi_m_lK4eHKFbULHvOA6jA","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":1,"funny":0,"cool":1,"text":"My wife is an incredible Argentine lady from Buenos Aires. I spent so much time in Argentina before the pandemic that I am a permanent resident. We know what great Argentina empanadas are. This restaurant is top 1% of empanada restaurants in the world., We were in Santa Barbara last week. We found this incredible restaurants. The empanadas were juicy and \"out of this world.\" The staff was a lot of people from Cordoba, Argentina and great. We had an unforgettable experience. We will be back. Our great regret is that tye cannot deliver to the San Francisco area.","date":"2021-05-07 22:50:51"}
{"review_id":"9GUB5hJpjSeLq0OPru50-w","user_id":"-OyNOS_vcwoUI5_MUjoGfw","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"OMG, I am gluten free and havent had empanadas in years because of my intolerance issues. I had the most amazing empanadas and felt so much joy from being able to indulge. The other people I dined with felt the same way about the regular empanadas, amazing! The sauces to top them are so delicious with such great flavors. Their menu is quite large, something for everyone. Dont miss this special gem run by lovely caring people.","date":"2021-07-01 02:07:36"}
{"review_id":"-UcX_ifNEql7y8aLqY5izg","user_id":"FbLvwpXVBbDaYJ7rNqhp2w","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"My friend and I stopped by here on a whim to try someplace new. As soon as we pulled into the parking lot we noticed how lively the ambiance was outdoors, with a flat screen TV showing some soccer game and plenty of people having a good laugh.\n\nWe were pretty hungry so we started with half a dozen empanadas - Serrano, Hongos, Suiza, and a few other flavors. Each and every empanada we tried was a bite out of heaven, and the chimichurri sauce elevated the flavors to another level! We had to go back in to order more of the Serranos along with some tiramisu to wrap things up.\n\n10\/10 would recommend to anyone for a delicious brunch and top-notch coffee with a side of soccer!","date":"2021-07-05 16:32:41"}
{"review_id":"w5J_EwpZraku5CrdlKZHCQ","user_id":"a6mjGwJ92f9CZARXjGqYrg","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":1,"funny":0,"cool":0,"text":"So so so good!!!! I live 2 hours away from Santa Bárbara and I'm already finding excuses to go back just so I can eat these yummy empanadas again. The mushroom ones were my favorite.","date":"2021-08-25 02:53:43"}
{"review_id":"lo4uKr8SGLPwZ-5zecFZzA","user_id":"PXA--g8iXLM4JgSOQGviWw","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"This place is amazing! Not only is the food delicious but the staff is super friendly and ordering online to pick up is easy peasy! They always have our order ready when promised and I have never ordered something I didn't like. It's a little hidden gem on Milpas Street, and now they have another small location on State Street. In addition, they have family meals and you can order things frozen\/cold to re-heat for later! Highly recommend!","date":"2021-04-02 13:51:01"}
{"review_id":"MnvnDSgV69pkaNPk-t4Y8Q","user_id":"qpBm91LQ2Tq-reEBN0kfIQ","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":1,"funny":0,"cool":1,"text":"Nice vibes with great foods and service.  Must visit.  Street parking is hard to find but they have a small parking lot in front.","date":"2021-09-08 00:34:39"}
{"review_id":"cTIeqCV9SfIQ4IbXpz4qIQ","user_id":"38zj5fV5ZpsivA1z1FLPig","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"The food is outstanding and the staff is very professional. I highly recommend the authentic Argentinian cuisine!!","date":"2021-02-07 04:13:11"}
{"review_id":"KBfdlr6eihI3GOCMSiUBdg","user_id":"uIRi2CQ69hg0QDGkr-ViQg","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":4.0,"useful":0,"funny":0,"cool":0,"text":"The empanadas here come fresh and piping hot out of the oven! They were very light and not heavy at all. \n\nI ordered the combo plate of 2 empanadas with a salad and my boyfriend ordered the combo of 3 empanadas with chimi papas. Loved being able to get a combo plate. Between the two of us, we tried the pollo, serrano, and humita (seasonal). They were all pretty great, with the serrano standing out in particular. The dough was the best empanada dough I have had, but I think the flavors could be rounded out a bit more. In particular, the pollo could have been more flavorful. \n\nThe outdoor seating was also lovely with a great atmosphere. Would recommend.","date":"2021-08-08 17:37:06"}
{"review_id":"wnYZRUkfTD6hCN0c14OByg","user_id":"3c2Qtsf941eVQKYlV_PL6g","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":4.0,"useful":1,"funny":0,"cool":1,"text":"Delicious empanadas, can understand why it gets 5 star. Really loved the food and service was great too","date":"2020-09-06 00:36:00"}
{"review_id":"KS36yGiy7YYf4u9VnB8NOA","user_id":"l1ZJAY0ivE5UTdJCoGM0Cw","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"Very tasty we know,how to choose them had the caprese off the beaten path wanting to order a dozen","date":"2021-03-06 20:10:10"}
{"review_id":"j68XyCplP6tf-2joF1tj1A","user_id":"iJQtNnEcrxdpaD132v26nQ","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":14,"funny":4,"cool":12,"text":"What can I say that hasn't already been covered by Buena Onda's stellar 5 star reviews? I don't know but I'll try!\n\nBuena Onda tastes like it is made with love. It has that homemade, fresh-baked, family-meal feel. Upon first bite, I'm momentarily taken away from my surroundings and transported to an Argentinian dining room. The flavors, texture, and aroma ooze with culture. My favorite empanada is the Carne. I love dipping it in their Chimichurri and aioli sauces. \n\nI highly recommend ordering a dozen and trying a variety of empanadas. They reheat well on the off chance you cannot finish a dozen in one meal. It is not that they are small, it's that they're so delicious you'll want to keep eating them even after you're full. \n\nThe outdoor patio is very inviting for being wedged in the middle of a busy urban street. It's a lovely place to dine alone or gather with friends. You can also enjoy live music a few nights a week under the twinkle of hanging outdoor lights. \n\nIf you don't feel like dining out, call ahead and place an order to go, or have them delivered right to your doorstep via Grubhub. \n\nFor those who have a sweet tooth like yours truly, the fresh baked cookies they sell are a must try! Easily the best cookies I have had in Santa Barbara. My favorite cookies are the Sprinkle and Turtle- moist, chewy goodness!","date":"2019-11-08 21:06:27"}
{"review_id":"PsCk7_Zyzzpr6AsTj5IUmQ","user_id":"4Q6NJ2xJPE7EvTz0CIcnGg","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":4,"funny":1,"cool":2,"text":"Very pleased with Buena Onda's catering service and food for my 150 guest event in Goleta. First off, Matias was great to work with on this! He was great with discussing what fit best for my event such as the number of services, whether to bring the oven onsite or not, and placement. His team even came onsite once to check the venue\/spacing and provided to-go boxes for our guests to take leftovers.\n\nHere's what I ordered: \nCarne - my favorite empanada! All are crispy, soft, and filled with delicious filling but the carne was just extra juicy and tasty. \nPollo - the seasoning on the chicken was spot on\nCaprese - imagine a melty cheesy pizza roll but 10x more cheese \nVegan - we picked the quinoa option and it was rly filling\nGF - didn't try this one \nChips & guac - lots & lots of guac! \nGrilled veggies \nSalad with grilled chicken on the side - we had 3 guests on a low carb diet so Buena Onda came up with this great option\nAlfajores - generous dulce de leche filling sandwiched between two cookies (kind of like short bread) I wish they had powdered sugar coated on the outside but that is just me being alfajores-obsessed. \nPeanut butter cookies (GF) - SO DELICIOUS! It was filled with chocolate chips, moist, and had the perfect amount of peanut better. The cookie still tasted good 3 days after too. \n\nYerba mate - they have their own special recipe! I recommend it. \n\nMy guests were obsessed and went back for thirds! Buena Onda needs to expand so I can have them cater all my events (to the Bay Area especially)!!","date":"2019-06-10 06:09:58"}
{"review_id":"NZ09s4hj9qTnh6lniPyqTQ","user_id":"wQPx_JmBcK-Rfk79xkvt3A","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"Great customer service! Everyone we talked to was extremely nice and the food was delicious! Cute outdoor seating area with lots of shade.","date":"2021-08-13 23:22:26"}
{"review_id":"3Aw5_6mQGTrY6QPWLnVJ_w","user_id":"fqEIQc1OyHj_XihpMOxiyQ","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":2,"funny":0,"cool":0,"text":"Empanadas? Yes, please! You won't regret it. \n\nDough is nice, flaky, and buttery. I love how it's not too thick and when I bite into the empanadas there's little flaky crumbs that get stuck on my face. That's when you know it's legit and the person next to you doesn't even say anything to you. Savage!\n\nTried 3 flavors and rated in order of what to get. \n-Chille Verde - special of the day and the favorite of the three. The meat was tender and the flavors were rich.\n-Carne - ground beef with that taco seasoning type of flavor that was really yummy. \n-Suiza - creamy. If you like that rich, white sauce. You know you do.","date":"2021-04-02 00:07:03"}
{"review_id":"sWeoloXKHJ0-xpoiNbmPow","user_id":"GA3jjUWQQKArsIeuoNJ3OQ","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"These empanadas were great! \n \nI grew eating home made empanadas and these did not disappoint.  They tasted like the real deal.  \n \nI highly recommend Buena Onda empanadas.  We had the mushroom, chicken and beef varieties.  I would definitely try the others next time we're in town. \n \nWe also had the potatoes as a side and apple desert empanadas - both were awesome compliments to the empanadas. \n \nThe aioli dipping sauce and chimichurri were also great!","date":"2021-07-24 17:03:02"}
{"review_id":"RdRSla1EAQLcf9j6_ByS6g","user_id":"4Y-ST1g3KeoUGy8fpZyf6Q","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":2.0,"useful":0,"funny":0,"cool":0,"text":"Overpriced. Tiny empanada. Blah flavor. I had high hopes and was not impressed. Don't recommend","date":"2021-11-14 19:17:09"}
{"review_id":"qiEGf8HDK5m8joGrB4CHBw","user_id":"E5p6Zo3bgxLepIS0zUuERQ","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":2,"funny":0,"cool":1,"text":"First we had them as a gift to our office and I had to try the real deal. \nSo we went to their location on Haley st. We ordered their combination of three; The beef one chicken one and a special that they had with potatoes was amazing. It took about 15 minutes but the wait was worth it everything was so hot and delicious definitely recommend this place. They have a small parking lot and street parking is a little crazy. I can now say that this restaurant will be added into our rotation of good eats in Santa Barbara.","date":"2019-12-31 20:11:37"}
{"review_id":"zCZCK_y4zXS2x6ftOeB-VA","user_id":"B-X9ad2JasJEBM381pKS9g","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":4.0,"useful":0,"funny":0,"cool":0,"text":"Empanadas are yummy!! I especially like the chicken, my husband preferred the beef. Great atmosphere and location, service was great!","date":"2020-08-08 20:14:31"}
{"review_id":"oVCz6WCivJET6JqOS1vS_Q","user_id":"TzfIuq_55Bk2sGtZNRBYSQ","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":1,"funny":0,"cool":1,"text":"Such incredible empanadas! The staff is friendly and the outdoor seating is great! Parking is pretty hard to find on the weekends so plan ahead and grab a spot on the street!","date":"2021-08-29 19:35:59"}
{"review_id":"h1DPrZd0AMV2PXrwzUJ_9w","user_id":"LcBZt_bpU5CqwtDJwB3OCg","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":15,"funny":8,"cool":12,"text":"I remembered Buena Onda used to be a popular popup in Goleta and the first in the city to serve Argentinian empanadas.  Unfortunately, I haven't had as many chances to go there after they moved to Santa Barbara.  The empanadas are delicious, and some of my favorites are sweet and creamy humita, garlicky ham and arugula, and tender savory chicken.    They also have many none meat and none dairy varieties to satisfy everyone.  Empanadas are big and filling, 2-3 are plenty per person for a meal.  They now sell family meals and frozen empanadas so you can bake them at home whenever you like.  I hope they make it thru this pandemic and come out better than ever.","date":"2020-04-12 05:26:18"}
{"review_id":"69rUf7qDKBrnaAQ-xh2VtA","user_id":"j9N1Yjj6IdDKiBXV6aOXeg","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":3,"funny":2,"cool":2,"text":"Tucked away on the far side of Haley street, doors down from the Carl's Jr., lies the charming hidden gem called Buena Onda. It's no wonder this spot has 5 stars, as it has a delicious variety of empanadas, a fun vibe, and reasonable prices. \n\nI tried several of them tonight and loved the ham empanada and the mushroom empanada. The breakfast one was also a hit with my almost 8 year old. The service was super friendly and it wasn't crowded, even on a Friday early evening. I do wish they offered an IPA or a Hazy IPA, but at least they had a Coke Zero. Looking forward to returning soon for another batch of goodness.","date":"2021-05-29 03:20:13"}
{"review_id":"-ALOvw_5Urg3UQ81PW9_ug","user_id":"lweKWgRJHEpv8WHsq_f_pg","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"After eating California and Italian cuisine for 3 days in a row we wanted to try something different. We found this restaurant on yelp and decided to walk all the way from downtown in the hot weather to this place which is tucked away from the main touristy place.\nWe ordered one order of Combo plate between the 3 of us (were not very hungry) which included 3 Empanadas QUINOA, CAPRESE, HONGOS and side of CHIMI PAPAS. \nThe Empanadas were fresh and felt very light not oily and the chimichurri potatoes were very tasty. Would definitely pick up the same next time we visit Santa Barbara or would recommend this place to others visiting SB.","date":"2021-08-03 23:09:59"}
{"review_id":"Oe4qe53bm79bn-bOcBtAVA","user_id":"2tDf4iMzs_mWosQwIWAVoQ","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":1.0,"useful":2,"funny":0,"cool":0,"text":"Service was terrible from the kitchen hands \nWe came at 12:40pm and waited longer than 35 minutes for just 6 empanadas. The lady at the counter said 10 to 15 minutes , she's not at fault. \nI observed The guy at the kitchen had a snail's pace when preparing everything. One guy I heard that he was confused with different orders. \nFood might be good but service is the worst. Need improvement.\nScratch that, food was not good at all. \nNot coming back to this location.","date":"2021-06-27 20:26:26"}
{"review_id":"RtZ_zkVKwq2xjn0WSfYSXQ","user_id":"3gttbrA01XbQBNYu2-1Cug","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":4,"funny":0,"cool":3,"text":"Breaking in 2020 with champagne, friends and 36 Buena Onda's empanadas is the way to go!! All my friends were in love with the golden delicious empanadas. I think I made some new friends because those yummy pockets of love made me look so good.\nThe owners of Buena Onda knew I was having a party so put extra special touches in the bag that made serving easier. \nThank you for coming to Santa Barbara we needed you guys and your incredibly tasty food!","date":"2020-03-12 05:07:22"}
{"review_id":"rnjU_7BJRCZp6VrUPjBpKA","user_id":"4n_KhKvKRuUfCjlASsTlsA","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"Buena Onda was our last stop on our way back too Orange county after three days of wine tasting in Los Olivos and Santa Barbara. We were traveling with a dog so we wanted a dog friendly restaurant. \n\nBuena Onda is a fantastic place to eat. We were a party of four. We ordered almost every Empanada on the menu. We loved them all. My favorite was the Carne. The Carne is savory and rich, with a bit of heat that warms the throat. The Caprese was like a little pizza, the cheese was creamy and the basil and tomato nice and herbaceous and slightly spicy. The Serrano was a ham and cheese delight.\n\nIt doesn't often happen that we take out more food following a full dinner. We certainly were full when we were ready to settle our account. We couldn't eat another bit. But we wanted more. Thank goodness Buena Onda understands their customers. We ordered an additional dozen empanadas to take home for the following day. Buena Onda knows its customers want take-out. You can order take-out fully prepared, half-baked, or frozen, as fits your needs. Our breakfast the following morning? Emapanads!\n\nThis will always be a stop when we are in or traveling through Santa Barbara.","date":"2021-03-25 20:34:11"}
{"review_id":"vJdzlzOl7E1rQQv4XTQLtg","user_id":"WbwIkp963OtxLHQQH1HEZw","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":1,"funny":0,"cool":1,"text":"Great empanadas. Great desserts too.\n\nThe seating outside is beautiful. It is not the fastest place if you are in a hurry, but we didnt have to wait too long. We got chicken wings also. We enjoyed it a lot.","date":"2021-07-05 19:03:32"}
{"review_id":"cZi0brClUoNHQujDRIOuBQ","user_id":"s7p1SFQbXioldEXuVbt9-A","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"Amazing fresh empanadas. The chimichuri potatoes were amazing.  Loved the outdoor patio and vibe. Will definitely be going back.  They serve beer and wine","date":"2021-06-19 17:41:15"}
{"review_id":"EgYCLcncUlO-iYe_9eP61w","user_id":"F9fJWCyuUWPptXpCd_WnUQ","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":1,"funny":0,"cool":0,"text":"I LOVE BUENA ONDA!!! I came up to Santa Barbara for a little weekend vacation having set reservations at some fine dining restaurants and completely blew them off for this place! I happened to find it for lunch on our first day there and it was so good we went back for dinner the following night! The staff were so friendly and helpful!! Please try this place out! It's so worth it! Also they have vegetarian and vegan options!!","date":"2021-02-17 03:50:19"}
{"review_id":"ZHnk4vQzacQ_xOOzInIAhQ","user_id":"hlACjWemtXa-_dKRUE68gw","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"This place is amazing!!! Came to visit from LA County and probably the best empanadas I've ever had. I must come back for a visit with a full dozen next time. :)","date":"2021-03-14 08:50:59"}
{"review_id":"vKarZBDnLQNHpj_jOxYl-A","user_id":"bUtI4l7Nc37i0y7dpBxOUQ","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"Food was incredible and easily earned the 5 star status. We ordered the dozen empanadas and the potatoes and it fed our family of five amd we had leftovers that we are looking forward to already. It was so delicious and so filling. We thought it might be risky since the kids had never had empanadas before but they loved them as well! Don't think twice! Eat here. :)","date":"2021-03-12 03:49:24"}
{"review_id":"2lRPGnHXfocjy50Wpr-WAg","user_id":"Wo_rIBVKjEiZB2MJ5NPt5g","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"Best Empañadas in SB. Super friendly and Well priced. Keep ordering from them again and again","date":"2020-06-21 18:30:30"}
{"review_id":"ir9UXUTzjH9rwHLVvqcq-Q","user_id":"NUzzWQjSFFMtBkhqr6uxvQ","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"DELISH!!! Delivery is prompt as well. Someday we'll make it to the location and eat on site.","date":"2022-01-08 01:22:43"}
{"review_id":"0RupPwhrOq3atlzD1bDBgg","user_id":"2BNdqsXz4FUuW0DyKKfwcg","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":4.0,"useful":2,"funny":0,"cool":0,"text":"Travel Post! Came here after a long day of hikes. It was a perfect small lunch spot. We ordered an assortment of different Empanadas. I really appreciated the vegetarian options for my parents. The Chicken empanadas were delicious and  spicy. If you like spice this place doesnt hold back! There spicy chimichuri sauce was really was delicious and really had a great flavor. The textures of the empanadas was exactly what we were looking for.\n\n\nIf you are in the mood for a quick snack or a light lunch I would definitely recommend this spot.","date":"2021-08-15 06:38:54"}
{"review_id":"np_6Xdggll4D7CrE153PKg","user_id":"ex4atFeVMiQ5UWOvbA1wKw","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"After reading some of the reviews posted previously my girl and I decided to venture to this quaint spot to see if the high ratings were deserved. I'm happy to report they were. We tried a half dozen empanadas priced at $23. Although we found the special flavors they offered flavorful we were most impressed with their traditional flavors like beef and our favorite chicken. We would recommend this spot if you are in serious need for an empanada fix.","date":"2022-01-03 21:45:44"}
{"review_id":"ekJQRz7uOBLxNwJONY9TNQ","user_id":"7Na1pUcEv3oF_QTRwZ-2iw","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":2,"funny":1,"cool":2,"text":"Who doesn't love homemade WITH LOVE empanadas?! This place has amazing, delicious food that is a must when visiting Santa Barbara! My favorite go-to empanadas are the beef, the pollo and the gaucho when it's in stock. Sooo good!","date":"2019-06-22 20:02:05"}
{"review_id":"rL1wc-iVjNdd3Dx5028Bhw","user_id":"bkEa9qsM2Y5iPWL6d-78lQ","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":3,"funny":1,"cool":1,"text":"OMG COME HERE NOW! i am not even kidding this hands-down one of the best places i have ever eaten at in my entire life, and i eat A LOT of things!! (#follow me on insta @chubbydumplingkc). but like literally, i don't even know if i have ever had anything better than these empanadas.. this is the most insanely delicious, perfectly hand-crafted, and flavorful food i have ever had. i cannot express how much love i have for these empanadas and this place.\n\neach empanada is homemade, hand-crafted, freshly-baked, and authentic!! they are like little, pillowy, golden balls of treasure - the perfectly crisp but soft-inside crust layer is quite literally to die for, and the fillings are so savory :)) i wish i could have tried them all!!\n\ni loved watching each one being specially back in the kitchen!! this is a local shop that i wish i could come eat at everyday, you can just tell how much individual care and thought is put into each and every empanada. from the way each different empanada is specially folded to the beautiful plating.. i was thoroughly and incredibly impressed by buena onda!!! i honestly think i would move out to santa barbara just so i could come here everyday, or maybe i'll just make the three hour drive every weekend for these extraordinary empanadas!!\n\nnot to mention, buena onda is actually the cutest little restaurant shop that you'll find here in santa barbara, i felt like i was in a little Pueblo in argentina!! the building and the seating areas and the decor - all so beautifully authentic and adorable. i LOVE it here!!! the atmosphere is a perfect 10\/10, and i just love the vibe. 100000000\/10 for the best meal of my life.","date":"2021-07-14 08:01:32"}
{"review_id":"7_Za1uVNbwfP-e2c-7gubg","user_id":"yKZDqkjI_OA6ZzhVFjSLAg","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":2,"funny":0,"cool":0,"text":"Had chicken empanadas and papas. Fruit empanadas for dessert. Fresh baked hot and tasty! To go is also a fantastic idea. Outside seating with welcoming our dog and bird. Great food and fantastic seating outdoors. Parking area  right in front of restaurant!  I highly recommend Buena Onda!","date":"2020-02-19 00:08:47"}
{"review_id":"7OMhcqQIIPVIJl9kEDGMCQ","user_id":"4X_56v6uJHRywgitYfPNoA","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"Great little surprise. Visited Santa Barbara with my wife and hit this spot due to the 5 star reviews. Basically just empanadas but many to select from. Nice little outdoor seating, draft beer. Simple basic place but worth the visit.","date":"2021-07-04 01:28:55"}
{"review_id":"OPEiZlpPcHD0BsbXOQDCkQ","user_id":"1ZidDKuKG-yJNOrEmeidMw","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":0,"funny":0,"cool":1,"text":"I ordered a cheesecake, 3 empanadas combo and a half a dozen to go. \n\nThe waitress put my Togo order over the oven while we enjoyed our brunch. So kind of her. When I went inside to pick up, the male staff was very friendly and offered spicy chimchurri sauce in addition to the regular chimchurri! I did not know they had that. \n\n\nThe customer service here is so great and friendly. Thank you to the two kind staff working on Sunday at opening time :)","date":"2022-01-11 04:45:53"}
{"review_id":"FAudJ4wMlcTPnFl69wHAOg","user_id":"86Oe8OA4QG2bGcsFek_C4A","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":3,"funny":1,"cool":3,"text":"I've managed to have Buena Onda empanadas on many occasions without actually ever visiting their location.  They often do pop-ups or servings in different other businesses such as Old Town Coffee and Draughtsman.  Even though they're now located in eastern Santa Barbara, I'm glad that there are still places where I can enjoy them in western Goleta.\n\nThey have a great variety of empanadas, and they're all excellent for different reasons.  I recently had the ongos empanada for the first time and it was excellent, full of delicious pieces of mushrooms cooked in herbs.  Their different meat ones are excellent as well.\n\nI seriously need to head down to their location on Haley sometime just to check it out (and bring back bags of empanadas).","date":"2020-09-03 02:19:16"}
{"review_id":"X6XTlSY1HbZbl-F36NSwUg","user_id":"YbojxHr1yP61o2DPDMwXog","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":4.0,"useful":0,"funny":0,"cool":0,"text":"Nice little surprise when looking for a quick bite to eat before driving home. Definitely will have to eat here again or get one of their take and bakes. Bf and I shared the 3 empanadas with 1 side of potatoes. All delicious.","date":"2021-11-26 02:18:13"}
{"review_id":"8IcQJ2kvUKgUo9ZkdFEmsw","user_id":"TGDCii6alNZQf5SP9mNsHA","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":2,"funny":0,"cool":0,"text":"Great empanadas. I spent five years in Latin America and these were as good as any I had South of the border. Will come here again. Often!","date":"2020-04-08 22:25:58"}
{"review_id":"TcxxngnVX23XwkIY4AKbpw","user_id":"sNVSa4xK-QDfiyTLhzspDA","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":3.0,"useful":0,"funny":0,"cool":0,"text":"The empanadas are amazing but the service this time around was terrible. I scheduled 8 empanadas to go over the phone and was told they would be ready in 15 to 20 minutes. About twenty minutes later I got there and was told that they would be ready in 2 to 3 minutes tops. I stayed waiting by the counter. A few minutes later that same person asked me if I was there to pick up for daisy. I said no. 10 minutes went by and I asked about the empanadas. The person managing the orders\/cash register apologized and said they had a few big orders before me. But he continued to chit chat with his coworkers about random things without the slightest concern for the delay. Finally someone operating the kitchen asked what the guy with the two pellegrinos was waiting for and the that same person who took my order didn't know. I was baffled and said I was waiting on the 8 vegan empanadas. A few minutes later I got my order but was dismayed by the lack of customer focus, empathy and politeness in handling an order that was delayed. I get that things get delayed. But the lack of communication and customer focus were unacceptable.","date":"2021-06-27 03:16:46"}
{"review_id":"CYG5k6vTkhdTGMdhTsAtPw","user_id":"d0dC96GNwVdASRHbkBLIew","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":2,"funny":0,"cool":1,"text":"Four of us buddies met here to try some alternate, ethnic food.  This place is great to try out a few empanadas.  We had the Caprese and hongos, as they were vegetarian.  \n\nThe empanadas are great, and I will surely recommend this place.","date":"2021-11-07 15:40:30"}
{"review_id":"IuUIJXuBVOAUhoqKpPXUgA","user_id":"ycwlpi4SeRd2-Om0KLxQMw","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":2,"funny":0,"cool":1,"text":"This place has been one of my favorite places to pick up food in Santa Barbara. Amazing food, friendly staff, and great value. Keep it up Buena Onda!","date":"2020-05-17 16:47:35"}
{"review_id":"oVm1nuQFd7W45S4GbsltWg","user_id":"4HHN2S9mXrmasXOgk5OghQ","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":0,"funny":0,"cool":1,"text":"Yum yum yum! Fantastic empanadas here.  They had many varieties including vegetarian and vegan options.  They were all outstanding, but the vegan ones were terrific! Very reasonable prices too. Highly recommend stopping in for great empanadas!","date":"2021-07-27 22:58:32"}
{"review_id":"UmX7D453RdN3C8t-sr2T0g","user_id":"RSdcbwLrBkP2kCknWF6CXg","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":4.0,"useful":1,"funny":0,"cool":1,"text":"First experience for me to have empanadas. Very enjoyable.  Had the combo with 3 empanadas and side salad.  Just the right amount for a light dinner. Order a few more if you're really hungry.","date":"2021-09-02 00:07:29"}
{"review_id":"8ONQce4T4j_SkAuOONzhbg","user_id":"VbaWjypRggcBhEG4bn3Gjw","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":2,"funny":0,"cool":0,"text":"Love love love their veggie empanadas! They offer this great deal where you can buy a dozen frozen empanadas to bake at home as well as other refrigerated or frozen family style dishes (lasagnas, eggplant parmesan, soups) that I want to try now. The mixture of veggie empanadas included I a quinoa and vegan cheese flavor and I've never really liked vegan cheese a ton, but this was AMAZING - just like a creamy ricotta. All three flavors in our dozen were great with the Caprese a standout as well!","date":"2020-12-09 04:01:08"}
{"review_id":"i-PMWx-j6icF_r-3CG74ZQ","user_id":"RRLiOeZgG5-QI3hAKjo-ug","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"Was driving down from San Francisco and came across this down to earth Argentinian restaurant. Food was super delicious! Atmosphere was amazing, who doesn't like to eat outside with a nice breeze. Service was great, got our food in a decent timely manner. Would recommend to anybody that has a hankering for some good tasting empanadas!","date":"2021-10-18 05:46:51"}
{"review_id":"jV3rV5POl2tMGCbkMzI5Ow","user_id":"pxM-wnZsPZknEkfJx6X7eQ","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":1,"funny":0,"cool":1,"text":"I had originally ordered food days in advance for my sister in law's shower in Santa Barbara but got the days mixed up. Luckily I called the morning of to check on the order and to pay which is when we realized my mistake. The owner was kind enough to quickly check for availability on the items that I needed.  The food ended up being ready on time despite the mixup. We got empanadas of various kinds, lasagna and pascualina for dinner.  Everyone at the shower enjoyed the food very much.  Thank you Buena Onda for your help and delicious food!","date":"2021-05-19 02:08:32"}
{"review_id":"u8DBkJV-X5bOgU_3LRbpVg","user_id":"oiVvbd22pvY_VC9pmZflMw","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":1,"funny":0,"cool":1,"text":"The place looked cute and the service was very good. We tried the verde empanadas, they were brought to us piping hot and perfectly yummy. We ended up wanting more and reordered the same things. Even the vegan option, batata vegan was lip smacking. Overall a must try place when visiting Santa Barbara","date":"2021-06-20 23:27:07"}
{"review_id":"bmQo1iJLvDvLPgAfF79nfA","user_id":"wzatQTNBj1_wJy3Zyx1E6w","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":2.0,"useful":1,"funny":0,"cool":0,"text":"This review is solely on the food, not service.  Cute little place and great service. But the empanadas had no flavor the dough is more like a pizza dough. The spinach pie was old and dry.  \nHaving had Argentinan neighbors growing up.  This definitely does not resemble Argentinan flavor.\nWe ask for a salt shaker and she also suggested spicy mayo sauce. \nIf you want really good empanadas try Titos Market in Los Angeles! Delicious! No sauce needed.","date":"2021-08-05 05:58:35"}
{"review_id":"XkXZhJKqkkc7t1Vp9wGNeQ","user_id":"NOvbwDPu0FaS1SpkXvHdAQ","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":4.0,"useful":8,"funny":5,"cool":7,"text":"YES, Lort...\n\nthe caprese empanada is worth the hype, so you can rest easy.  You can relax and believe what people say.  It's good.\n\nThey dice the tomatoes and somehow the tomatoes don't interact in a bad way to make the cheese rubbery.  Nope.  The cheese is still creamy, smooth and all melty...and the tomatoes and basil are just fresh and popping with flavor.  I don't know how they do it...how they make the tomatoes work together with the cheese instead of against it, but every ingredient is being a team player, working TOGETHER.\n\nYou know...we as people could learn something from this empanada.  #MESSAGE\n\n4 stars for now until I try everything","date":"2018-11-27 12:17:15"}
{"review_id":"RfNprttW3hM3DXPo-NzxXg","user_id":"v2Rk5lQWal8ane1Slx5nqw","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":4.0,"useful":7,"funny":3,"cool":7,"text":"Really yummy empanadas! We tried the carne, pollo, serrano, hongos, humita, chili verde, and the buen dia. All of them were pretty good but I think my favorite was the chili verde. One downside is that I found the filling amount was not very consistent. The carne and pollo were pretty filled on the inside but the hongos and chili verde seemed like they barely had any filling. \n\nThey have a small parking lot in the front (about 5 spaces) but you can also find free street parking in the area as well. They also have an outdoor patio for dining. Service was ok. The cashier taking my order kind of shrugged his shoulders when I asked him which empanadas he recommended. Our server was much nicer though. Overall, definitely would recommend checking this place out.","date":"2021-08-18 04:47:09"}
{"review_id":"HYyGf2kqlBKpL86IKaDOpw","user_id":"SaXBd6UDxidqJuMC6CaqzQ","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":4.0,"useful":2,"funny":0,"cool":1,"text":"TBH, the meat empanadas were not the best. They were piping hot and had delicious sauce, but the chicken was a bit oily and the beef was overcooked.\n\nHowever, my girlfriend got the vegan empanadas and those were AMAZING! Especially the quinoa one. Super good.\n\nComing from a heavy meat eater, I would encourage people to go for the vegan options. Honestly, more flavorful and delicious than the meat ones.","date":"2020-07-13 04:11:58"}
{"review_id":"YJnCzrF7oYc_zsyL0z0MFQ","user_id":"S26Ky1wSCD9Aa_SQSB5-Wg","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":1,"funny":0,"cool":0,"text":"Delicious Empanadas!  They are the best in SB.  Every one I got was delicious.  I think my favorite was the prosciutto and cheese one.  I liked the vegetarian ones better than the beef one.  But they were all super good.  I hope they are around for a while.","date":"2018-02-21 20:03:12"}
{"review_id":"itvggbBmdbWQbU5DFctt2w","user_id":"CPXxevC-p2UC7Ke2XsVmeA","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":2,"funny":0,"cool":1,"text":"WOW WOW. I can see why this place is rated 5 stars... EVER WELL DESERVED! I had the chimipapas as well as the beef, chicken, and Serrano empanadas. All I could say is al can't stop thinking about how delicious they were!! The beef one was hands down my favorite one. I love how authentic this place was, you could tell how much time and effort goes into their food and you can taste it too! The food is freshly made when you order which makes it even better!\nUnfortunately I'm not from the area so I can only wait until I visit but if you are in the area, PLEASE GIVE THIS PLACE A TRY. \nYou will not regret it","date":"2021-06-29 18:51:50"}
{"review_id":"Pyuh2_2f4OGjVgCX_ZzpbA","user_id":"95GOfKoCDfeGkX2l8n8Lfw","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":144,"funny":90,"cool":142,"text":"Buena Onda is located in Santa Barbara and it is famed for their traditional Argentinian empanadas. You know...empanadas... a fried turnover pastry with sweet or savory filling. Well I got wind that they had a few vegan options, which gave me all the more reason to swing by. I arrived during the evening and when you walk in you can almost taste them in the air. There were two people ahead of me and a few behind me. I had already placed an order over the phone so once it was my turn I simply said the magic words and paid my bill. \n\nThe options were vegana quinoa (peppers, spinach, quinoa, and vegan cream cheese) and Hakuna Batata (shallot, sweet potato yam, and spinach)--I ordered both. They also have meat empanadas and they are all oven baked to order. Both were quite delicious but of the two the Hakuna Batata stole the show--it means no worries, am I right or am I right? My order came with a herb\/grassy olive oil dressing for the empanadas which was nice and I was quite full once I finished my meal. They have outdoor seating and twinkle lights for an elegant look. \n\nWhat I love about them is that they are authentic and organic. Their dough and fillings are housemade. You can purchase in bulk or family meals for a better deal. They also have frozen empanadas that you can take home and cook at your leisure. They even serve soups, salads, and desserts. After a few years the secret is out fresh and bake to order empanadas right here in sunny Santa Barbara. Thank you for making the world a little more wonderful. \n\n\nCovid compliant","date":"2021-06-04 11:51:18"}
{"review_id":"NApzO3yCJ5jCD0Czwdwdpg","user_id":"HjMMLa0oKmJFYBrk8t9phA","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"The empanadas are extremely delicious. It's also such a cute lunch spot. Definitely coming back here!","date":"2022-01-09 21:40:31"}
{"review_id":"3uCUFUXFWDiuJwihwkATrw","user_id":"8CvCYBCO-2exT3ykIJqE1A","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":3.0,"useful":1,"funny":0,"cool":0,"text":"The food was absolutely delicious. The empanadas were fresh, flavorful, and hot. \n\nThe service was definitely a bit lacking, but I understands that things are a little odd with Corona. Took 15-20 mins for food to come out and despite being one of 2 customers present he pretended to not know who I was when I inquired about my order. \n\nThe food was great and fairly priced, so I'll still go back!","date":"2020-12-09 20:29:16"}
{"review_id":"UxYt5mviisbUT22BAJi6zQ","user_id":"i0H7L30pFvAyNQLPKoMfvg","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"Excellent empanadas! Large selection and the pastry was flakey and buttery and the fillings were delicious! The potatoes were just a bit spicy and cooked very well. Wish we were staying another night just so we could come back!","date":"2021-07-15 23:52:26"}
{"review_id":"xlbz6tGBp8pH3kwPiFwicw","user_id":"OKAuku3juZeOjlxZJG61Dg","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":2,"funny":1,"cool":1,"text":"I lived in Argentina for a year and have been craving an authentic empanada ever since, finally I came across Buena Onda and I'm obsessed! The hongo & caprese are my favorites and are so delicious. Highly highly recommend eating here and trying their delicious food. Their chimichurri is spot on as well!","date":"2020-09-23 20:42:13"}
{"review_id":"M8JIKbqsvwEieuQN3DbXug","user_id":"sHcJ_njuX6RWb7e5wbLaog","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"This place has the best empanadas ever!!! I definitely recommend :) the price is pretty reasonable \nCome here!! GREAT food!!","date":"2021-01-18 04:52:00"}
{"review_id":"Bfcat_aX2pL0mq1n41gvSA","user_id":"gax9SJVp_wntm4R4P9gCoQ","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":1,"funny":0,"cool":0,"text":"Such a lovely restaurant and the people working there were so sweet and friendly. My favorite two were the hongos and beef ones! Also loved the outdoor seating area","date":"2021-04-02 21:01:31"}
{"review_id":"qNF9owRO0t3qTT0AIxhKqw","user_id":"UPIFWKdA1VJ9aiu3MsOcdg","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":3,"funny":0,"cool":0,"text":"I love empanadas.  And, these don't disappoint.  \n\nFrom the fresh ingredients to the flavor punch, to the chimichurri sauce, these little dough homies are on point.  Authentic empanadas that taste just like rural San Rafael I had in Argentina.  \n\nJust a small operation out of a shared commercial kitchen, these guys put love and authenticity into their product.  The fact that they are not fried, makes a huge difference.  \n\nThey are like mini scolding hot pot pies, with love.","date":"2018-05-16 20:50:53"}
{"review_id":"rLfg-cx3bArqIl8d7fSU_g","user_id":"hsbOnv5ocz5en7S0RDzKhA","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"A friend recommended this place and it was super cute, the workers are super nice and the food is delicious. The empanadas are very reasonably priced and each one I had was juicy and flavorful and even my Argentinian grandma approved of them. Great place to go.","date":"2022-01-09 21:12:25"}
{"review_id":"NKAaG_PooS0CqJOtqJ3ZwA","user_id":"hQMpYaiQkZ2FQveIvcxJ3g","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"Loooove their empanadas! As a vegetarian, I always get the caprese, hongas with mushroom, and sometimes the corn one if they have and it never ever disappoints. The chimichurri aioli is also amazing. I really love their eco friendly utensils too!","date":"2021-06-14 01:34:46"}
{"review_id":"AKLDT5-Ju94Jz6yTsZs2Qw","user_id":"OP41d2EVMY9KxwNpddprLQ","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"Finally they've got it right. Not oily, and the empanadas have f been filled all the way. We are vegetarians , so the mushroom one which used to be very hollow I side, is packed with the filling inside and we also love the vegan option. Please keep it up and we will keep buying. Only suggestion is the make the dip less oily now. Thanks","date":"2022-01-11 01:26:45"}
{"review_id":"XL1MbjhaYMt1AXWKoLVfXw","user_id":"-DAvekwnUbCP1JUcONn_tw","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":1.0,"useful":1,"funny":0,"cool":1,"text":"3 combo orders to go, all with ice cold potatoes. We are from out of town and going to a hotel with no microwave. Totally unacceptable!","date":"2020-03-10 21:10:48"}
{"review_id":"GHWG-paD_1Ov0hPSgNVkfw","user_id":"39QIOa3wF48x1oVwIbCFnA","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":1,"funny":0,"cool":0,"text":"The empanadas were mouthwateringly delicious. Best I've ever tasted. Pickup was easy for takeout. Food took about ten minutes to be ready, as promised. Perfection!","date":"2020-11-26 00:59:30"}
{"review_id":"7NQWo2iTcXQFtELcRbqAuA","user_id":"Hhe-2d6I4Roit0tg4E-QyA","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"Perfect Empanadas for every occasion!\nWe've ordered a couple dozen for a wedding appetizer; for a Family Thanksgiving appetizer and we just ordered more to bring up to Paso Robles for our family holiday festivities! They're the perfect party food and can be served with wine, beer or cocktails. First of all they are very authentic and come with an amazing chimichurri sauce. The owners show respect to the culture by creating these perfect hand pies with lovely pastry that is neither too doughy or heavy and their flavor combinations are just wonderful, especially when complimented by the chimichurri sauce. My favorites are the Quinoa and Hongos but the carne and the brisket are the real crowd pleasers. These Empanadas are requested by my family members all along the Central Coast for a reason- they're made with care and respect and are simply the best!","date":"2021-12-18 21:41:26"}
{"review_id":"doXuhArVdS57PDfL3qIATQ","user_id":"M6kG4gWh6skQghF2hJCGTQ","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":1,"funny":0,"cool":2,"text":"Wow, they have done empanadas soooo right. I tell you, this empanada can do no wrong sis. Their beef empanada is just so tastey and juicy & don't get me started on their breading for the empanada. They hit the money with this one. Just a side note, don't forget to use to ur offer for a free empanada w\/ a purchase of half a dozen empanadas! Good job y'all, keep up the happy tummy time!","date":"2020-07-24 06:25:36"}
{"review_id":"FDQ3rvIgjgy5v_6XfpDkEw","user_id":"J1-7a2N_4CCtr4cj1Ubk8A","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":3.0,"useful":2,"funny":0,"cool":2,"text":"We ordered the half dozen, were very excited to try it out given the high and raving reviews.  \nFor us the food was mediocre, lacking flavor and could use incorporating more ingredients, pairing meat and poultry with different kinds of cheeses  and perhaps adding more spices. \n\nOther than that, very nice staff.","date":"2020-01-11 05:57:06"}
{"review_id":"fqqf8xXG4_lTBHQzDQYnGQ","user_id":"3oBotdW-8J_ydtJkZBb_Xg","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"Amazing favors! The dough is flaky and the fillings are so flavorful! Everything is so well. alanced and perfect satisfying as a snack or order multiple flavors for a meal. This place is a gem. I will recommend this to anybody!","date":"2020-10-04 05:50:49"}
{"review_id":"mbV6uWvQAZlqJ-mRirNzMA","user_id":"_jNJSY3GP7bIhPmXgPs6lg","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":4.0,"useful":1,"funny":0,"cool":2,"text":"Homemade empanadas. Had to stop and try. The beef one was good. Hard to find good speciality food like this. Cultural food","date":"2020-09-18 23:26:52"}
{"review_id":"7ey2udh55z7RUe5NZmc-Og","user_id":"wXZ0Os4M3vWO216Tq-qTBQ","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":3.0,"useful":0,"funny":0,"cool":1,"text":"I got the 2 empanada with the papas ($13 combo) and they were good! There is limited seating outside. They use compostable plates and utensils which I particularly like. Parking is very tight and there are only a few spots, so come early during meal times!","date":"2021-05-22 03:23:07"}
{"review_id":"OtjcYU4j38WOxipCHy11lw","user_id":"vUNrrAS3IVecgjma7EIrzA","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":2,"funny":1,"cool":2,"text":"Scrumptious Argentine empanadas  in Santa Barbara. Buena Onda sends out great vibes with at least 11 varieties of empanadas.  Stuffed with Mary's chicken, crimini mushrooms, Quinoa with goat cheese, sweet potatoes, white corn, prosciutto.   They even have a breakfast empanada with bacon, eggs, cheese, potatoes and onion. All come with there house-made chimichurri  sauce.","date":"2020-08-21 17:51:57"}
{"review_id":"sR4W9w5D28k5uO6Qw7Ud6A","user_id":"lciqr23cDpcrGHmleerG6g","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"A family favorite! Amazing empanadas - you can't order wrong.\n\nOn a personal note they offered \"Thanksgiving Empanadas\" during Covid ( think turkey, stuffing, gravy dipped in cranberry sauce) with complimentary home delivery AND had homemade apple pies available on the menu. It was DREAMY. When I say 2020's Thanksgiving with Empanadas and surfing was my favorite,  I mean it... we hold this local business close to their hearts with this memory and so many others. \n\nGrateful for this crew and all they do for SB- dine in or pack them up and head to the beach like we do :) ALSO if you're looking for loose fresh Mate to brew at home locally this is our go to!","date":"2021-12-11 06:39:56"}
{"review_id":"lGIQP4v9jf8L-ckrpYaFyA","user_id":"oHUbCAxLn2AFncj4KHBz5w","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":3,"funny":2,"cool":3,"text":"This place was recommended to me by a really good friend. I order 60 empanadas for a graduation party. I tried basically all the fillings they had. I LOVED EVERY SINGLE ONE OF THEM!!! Everyone at the party was happy and impressed with the empanadas. Customer service was awesome! Can't wait to go back and try everything they have","date":"2019-06-30 02:49:07"}
{"review_id":"ICxdjFZnYujfPQQP7fj4SQ","user_id":"LseJV3IsEWyalvWa0mb2WA","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":2,"funny":0,"cool":0,"text":"Fantastic empanadas!!!  I think the best I have had.  The dough is super flakey.  I love that they put more filling than dough.  The empanadas are cooked to perfection and served piping hot.  I've tried three kinds, chicken, beef and their specialty one(the name slips me at the moment).\nAll incredibly delicious!  Their is cute rustic outdoor seating too. I really love this place and will make a stop every time I am in Santa Barbara.","date":"2019-07-29 22:04:32"}
{"review_id":"rtZ04EzWS2L50egcoKtysA","user_id":"IDCVIPzpUCuT8Vwxct9jYw","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":12,"funny":6,"cool":10,"text":"A friend and I ordered empanadas for pickup from Buena Onda a few weeks ago. The ordering process was smooth via their foodbooking.com ordering website. We called on the phone to ask about daily specials (Pro tip: always call and ask, as these often rotate!) I also asked about dietary needs, and the person we spoke with was helpful and friendly. As a vegan who is allergic to cashews, I wanted to make sure the restaurant's vegan cheese wasn't cashew-based. Our friendly employee was kind enough to get the package and read out the ingredients (it's soy+coconut-based, so I was in luck.)\n\nThat kind of customer service already had me thinking 5* and then we tasted the food. I ordered one each of the Vegana (organic red quinoa, peppers, onions, vegan cheese and spinach, wrapped in vegan dough made with Earth Balance) and the Hakuna Batata (sweet potatoes, spinach and shallots in vegan dough), $3.5 each. My friend had the Suiza (filled with Swiss chard, leeks, brie, and sage, and the Quinoa (basically the Vegana but with goat cheese instead of vegan cheese), also $3.5 each. In addition she ordered a sweet empanada made with quince. One little hiccup was that the sweet empanada said it came filled with emmental but instead featured goat cheese--no biggie there though, as she enjoyed it anyway. The side of chimichurri was totally delicious, if far more oily than either of us would have made it. \n\nIf you're looking for something that tastes traditionally Argentine, this isn't it, at least not based on what we ordered. We realized that as a vegetarian and a vegan, we likely wouldn't get classic flavors, since this empanadería is trying to innovate rather than replicate (say, using veggie pork, onions, and potato.) We thoroughly enjoyed our empanadas and their novel flavor combinations, and would definitely order from Buena Onda again!","date":"2021-03-04 05:27:49"}
{"review_id":"MnItFrjQP7LYFq5Wb4Pp_A","user_id":"VppPy7JOfV1hLRRujc34UA","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"This place was great! The food was awesome! Ambiance was fun and the staff were all really friendly! I will come back here and recommend to anyone in the area.","date":"2021-10-09 22:20:20"}
{"review_id":"P-gqvzqS03ERtmzVM-Qa4g","user_id":"IhGAPYmYd9468Omk9U_oeg","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":1,"funny":0,"cool":1,"text":"Amazing empanadas. And this is coming from a Peruvian that knows good food and good empanadas. What was surprising: the humita, with corn and cheese. Fantastic. They were so good we went for a second order. Carne. Chicken, caprese, hongos, jamón, all so good","date":"2020-07-25 20:45:38"}
{"review_id":"O5ZQN9Mfltx5I3esZk48mg","user_id":"U0M-pTHVZ9ygDWp1jBg1OA","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":1,"funny":0,"cool":1,"text":"We came to the satellite location and was able to dine outdoors. All the empanadas were warmed up for us which made for a better experience. There were quite a lot of vegetarian options. My table ordered 12 empanadas in total. We ordered the 3 carne, 3 pollo, 2 serrano, 1 hongos, 1 humita (which was partially yummy) 1 vagana, 1 quinoa. \n\nThe dough was quite soft and pillowy with a bit of sweetness not making the dish feel too weighed down with the dough. The sauce that came with the empanadas was delicious and had hopes it would provide some spice but it was yummy none the less. Would definitely recommend swinging by to try some of there empanadas.","date":"2021-05-30 21:07:48"}
{"review_id":"fzeIi-UWpJaLrmUXDVcQrA","user_id":"gNMfd3EJYLssuX19LWYcsQ","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"Looking for some party food, I knew I wouldn't be disappointed by Buena Onda, after I had read so many good reviews, Matias was very efficient and helpful with my order, and my guests and I were so happy with the empanadas I'd selected. They are quite large, extremely tasty and easy to identify the ingredients by the different shapes. I chose Pollo, Carne, Suiza and Caprese, and will definitely buy them again. So happy to have found Buena Onda.","date":"2018-01-06 19:22:46"}
{"review_id":"QDP8PQUNSH7kPIT3Af_yrg","user_id":"ncsQny5FlpG5CfsUK03tBA","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":1,"funny":0,"cool":0,"text":"The empanadas were delicious and the best part was the option for outdoor sitting. I brought my dogs and enjoyed a good empanada","date":"2020-09-14 00:19:13"}
{"review_id":"RBH531QOnmp9YY6G0DB9MQ","user_id":"9IU_h92pjVPFnlNWp9LOug","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":2,"funny":0,"cool":1,"text":"Excellent empanadas!\n\nFresh, hot and delicious served with chimichurri sauce.\n\nLovely outdoor seating!\n\nEnjoy :-)","date":"2021-06-24 00:25:02"}
{"review_id":"wCwHgRb-ovL14ClhQgu05Q","user_id":"HIF-6b1aEI473zmTE8VtWg","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"The empanadas are awesome. Can't wait to have another piece when we get back to Stockton","date":"2021-04-07 19:32:01"}
{"review_id":"Sn_pSSHAXrSzv8t73yg5gQ","user_id":"r1ipevFxLwXc5wGDzysCnw","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":1,"funny":0,"cool":2,"text":"Ordered empanadas by delivery from this place, and they are seriously amazing! We shared a half dozen, and I tried the pollo and suiza empanadas. Both were flavorful and absolutely amazing. I also love how they have a unique shape for each flavor! Prices are very reasonable as well. I'm definitely going to want to order more, or try their food in person once that is safe.","date":"2021-01-08 16:06:48"}
{"review_id":"z26p6JZR64KwVjIKP9GPvQ","user_id":"w_zyLyhl58RJOtC5OSKAxQ","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":18,"funny":7,"cool":18,"text":"YEAH BABY ! After leaving Pacific Grove at 10.30am on Thursday morning we had driven over 300 miles to Santa Barbara. It was after 6pm and we had just departed the Tesla Supercharger in Goleta...and we were starving. My wife found this empanada place online while our Tesla was charging and it read well. We decided to grab take-out and then check in at our Casita at The Eagle Inn. I phoned ahead to place an order with Adam for 2 x Empanadas - Pollo ( Mary's chicken, onions & bell peppers ) & Serrano ( Prosciutto ham, mozzarella, garlic  & wild arugula ) for my wife and 1 x 3 Empanadas Combo - Carne (  Sunfed ranch grass-fed ground beef, onions, bell peppers, green olives & free-range hard boiled egg ) - Caprese ( Organic roma tomatoes, fresh mozzarella, basil, & extra virgin olive oil ) - Hongas ( Crimini mushrooms, organic spinach, caramelized red onions & mozzarella ) + Side of Choice - Chimi Papas ( Chimichurri oven roasted potatoes topped with housemate aioli ) for me. We pulled into their tight parking lot just before 6.30pm and I walked inside ( wearing my facial mask ) to collect our take-out order. A young dude ( wearing a facial mask ) behind the counter looked after me and checked our phone order before going to retrieve it. All packed up in a couple of cardboard boxes...I paid and we headed to our hotel. Finally in our hotel suite about 7pm we settled down to watch the baseball world series and enjoy our dinner. Trust me these delicious gourmet empanadas are the real deal...top quality ingredients and fresh as a daisy. We loved 'em !","date":"2020-11-04 01:33:41"}
{"review_id":"WQqotz2xUB1lVJ4a8wXHRg","user_id":"SyzbL8kotVWE4-RWqqAIkQ","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":4.0,"useful":3,"funny":1,"cool":3,"text":"My husband loved their empanadas and I loved their desserts (cheesecake) so I give them a 4 stars. I feel like I had better empanadas elsewhere so these are not my favorite but the customer service was great and the outdoor dining set up was cute. They had their own parking lot which is nice in SB and also the empanadas came out piping out so pretty fresh.","date":"2021-03-19 03:37:39"}
{"review_id":"7TFMxIW7VoOIoZ5SnBQF-A","user_id":"LfjAaCNl8xjRTboru_s7dw","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":1,"funny":0,"cool":0,"text":"After reading the poor review by Arash T. I wanted to come here. The empanadas were TO DIE FOR!!!! Best restaurant in town imo. The service here was great. Not sure what kind of service he got but the only one he deserves is the dahan service  the food was so good, I marked it on my map (which I never do for restaurants)","date":"2021-04-15 21:56:50"}
{"review_id":"_PbV7CC1PGEGkRvLEqULtA","user_id":"5z1y-gBmSnEgLOJgN2aXvQ","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":3,"funny":1,"cool":3,"text":"Wow! This is my first time ever trying empanadas and I loved it!\n\nWe arrived Saturday a little before 2PM I believe and it was popping! Thi=e mosaic locale location is located on State across from the Museum of Art. We had a bit of trouble locating it, but I wouldn't say this location is an actual restaurant. They share the interior with a donut shop along with a beer shop. There's no parking lot, so park in one of the lots downtown. \n\nMy group of four ordered a dozen of empanadas for $39. We ordered a mix of meats (carne, pollo, prosciutto) and veggie empanadas. We had a vegan in our group and there were TONS of veggie options, so no worries here! The empanadas were pre-made so the workers obviously heated them up before serving us.\n\nIt's a super informal place, everything is mostly self serve, self seat. They have a great outdoor area that is super cute with pillows and heaters. Empanadas are served on paper plates with wooden utensils. We finished our empanadas before we realized they forgot to give us two of them! But luckily, it was sitting on top the toaster and the lady forgot to give them to us.\n\nThe empanadas were GREAT! The sauce that came with them was cooling and the perfect light mixture to the filling empanadas. My personal favorite was actually the chicken, then the prosciutto, then carne. The prosciutto empanada tasted just similar to a pizza! The dough was fluffy and chewy. It was nothing like I've ever had before. Delicious and totally worth the try! Super affordable too. \n\nNote -- the Yelp check in offer does not work at this location since it's a smaller shop :(","date":"2021-06-02 07:42:43"}
{"review_id":"ep5PI_sprNdRsEfc-oxq_Q","user_id":"fgdTN9xVoHgfGxQGwHJbvQ","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":2,"funny":0,"cool":1,"text":"Not much to say as there is already so many positive reviews.  My on small caveat is they are very slow but that said the food is worth the wait.\n\nWhen the food came out it was so pretty it looked like it was being modeled for a good magazine and it tasted even better than it looked.  I got a sampler and my favorite was the beef.  Bummed I didn't realize they had dessert empanada until I left so no I'll have to go back for sure!","date":"2019-11-30 01:50:09"}
{"review_id":"aEVa9Lj8Pdbh_YD5b78XPw","user_id":"qyyfcqSCiGvJfl1qFIOpAQ","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"staff was helpful, food was TERRIFIC, and the atmosphere was so nice!! i got takeout but there were lights all around the outdoor area and it looked lovely. would definitely recommend and go there again!!","date":"2021-04-04 00:08:05"}
{"review_id":"lxFxoAZ0oAIyV2-iWxKxeA","user_id":"kXxO_5KTzkPNNtF9VUIyYg","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":3,"funny":0,"cool":1,"text":"From a visit in late September '19:\n\nBuena Onda is located away from the busy State Street, which allowed for a more ambient dining experience outside. These empanadas were delicious, and the salads that came with our combo was much-needed-- considering how cheesy those empanada were! The chimichurri was also a yummy addition and we wish we had more. The combo (2 empanadas + one side) left us full and ready for the Incubus concert.\n\nCan't wait to come back here again next time I'm in the area!","date":"2020-03-13 00:05:38"}
{"review_id":"gOSz_MWrJj84Ds_LDgkJpQ","user_id":"DWIJ2UTCLqAQ1E24x8F6OA","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":4,"funny":2,"cool":4,"text":"5+++++ stars!!!! \n\nBuen Onda for sure!!!! AHmazing empanadas! Stopped by to pick up a dozen (picked a variety) and every single one was delicious! Wow! We loved them so much we are getting more today (the next day). My hubby's family is from Argentina and he even said they are the best he's every had! \nWorth a drive from the valley, Los Angeles (IMO)! \n\nWe stopped by on the way to the SB Bowl. They are very close to the venue. Called in my order and was ready in 10-15 mins. They hold up very well as I brought a cooler with me and they stayed in the car for a few hours with no problemo!!!!! We ate a couple when we got home after heating them in the toaster oven (you can also reheat them in an air fryer). Perfecto!!!! And I know from experience that empanadas freeze very well! \n\nThe staff was very nice and the place, although just doing a pick up, looked very cute with an  outside patio. Empanadas we're packaged\/boxed nicely with a cute little description sheet attached. \n$42 dozen \n$35 frozen dozen","date":"2021-08-28 18:33:13"}
{"review_id":"XmLNE3-utnUkODCqWWBMJw","user_id":"W6Nnw-KjRvCy80Y9AeZL9w","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":0,"funny":0,"cool":1,"text":"Hidden jewel! The empanadas were tasty and fresh from the oven. Beef was my favorite, delicious. \nThe cheesecake is also one of the best I ever had!","date":"2021-12-17 21:01:49"}
{"review_id":"GQqv5d2jT5VehbOkhuvKHw","user_id":"5Iera5N3N2J58DvOg-RtsQ","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":2,"funny":0,"cool":1,"text":"O m g. If you are thinking about going here, G O. Parking was a struggle but 500% worth it. I have never been so blown away by food. I honestly wasn't sure what I was expecting and it was so good. The service was great as well. We got take out and brought it to the beach. Tried 6 different empanadas. My favorite was the mushroom and the corn.","date":"2021-05-22 06:46:18"}
{"review_id":"GkNeiDzCHTKkYcwDJ1NqSA","user_id":"bwcAbAgFkTfX6MmPhsb-sg","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":1,"funny":2,"cool":1,"text":"I popped by on my way home to pick up some empanadas because I wanted to try the new vegan one. \n\nThe Vegana, which I've had before, is very good with quinoa, peppers, onions, cheese, and spinach. The Hakuna Batata is also yummy, with sweet potatoes, spinach, and shallots. Of course I ordered extra sauce and had lots left over to use on other things. It's really delicious.\n\nOne day, I'll make the time to dine on their cute outdoor patio.","date":"2021-12-05 01:10:30"}
{"review_id":"UkLb-fki9lpReHpG6rAvbw","user_id":"bwcAbAgFkTfX6MmPhsb-sg","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":3,"funny":0,"cool":1,"text":"I stopped by during a recent day trip to SB to bring some home with me as I was curious about their vegan empanada. Service is friendly and the order was made fresh so it took about 10 minutes to make four for me. \n\nThey have a nice outdoor seating area and a couple of bar stools inside. Once I got back to my car, I did sneak a bite of one without any sauce (because I was quite sure I'd end up with oil and herbs all over my car) and it was piping hot and had a nice flavor. I really liked the vegan cheese they used. I ate them the next day with the sauce and that took it to a whole other level. Delicious!","date":"2019-12-31 01:16:14"}
{"review_id":"3YwE6OLDgnUK1svcMa4fJg","user_id":"THmpXXuR5Sv5fZipCLTvMQ","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":1,"funny":1,"cool":3,"text":"This was my first time having empanadas, let alone having food from Buena Onda. My friend actually picked up the empanadas and brought them to the beach, but I have heard that the customer service is wonderful. The empanadas were so yummy and you can tell they are made with love. In the photo you can see the inside of the Hongos (mushroom), which was very good. The other was the Carne, which was also delicious.","date":"2021-12-26 23:18:50"}
{"review_id":"m7jydYOFnDkfLLxwZucRPQ","user_id":"AuScWRM8HfReG0gG0nP3GQ","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":2,"funny":0,"cool":2,"text":"One of the best empanadas I've had in a long time. I was surprised to find this establishment in Santa Barbara. \nThis little restaurant is located in Haley St. which is pretty close to the Downtown area. \nThey have a nicely decorated outdoor seating area with patio lighting and a large size flatscreen playing some old Argentina soccer games.\nI ordered three different types of empanadas (chicken, corn, and beef)\nThe good thing about this place is each flavor is made differently, so you can tell which one is which with ease. They give you a piece of paper which gives you the drawings of each shape and it's flavor.\nOverall, the crust, and filling was tasty and I enjoyed every bite. It reminded me of my childhood local empanadas shop near my old house in Buenos Aires.","date":"2021-11-15 22:29:37"}
{"review_id":"fq9WaSbD4cipIuTTvbRxhw","user_id":"kfqJtAHmg7M_XOvD3VvjdQ","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":4.0,"useful":2,"funny":1,"cool":2,"text":"Slow down when you're driven dwon Haley towards Milpas and at 724 you are going to see a tiny courtyard to the right. This is the place in town that sells the most delightful empanadas, and little nice Argentine delicacies in town. They have take away as well and today I picked up the frozen combo of 12 different empanadas for $35.00. Fresh , perfectly prepared, and creatively filled these little half pies are perfect for a party or just a light meal served with soup. Eash one has a different shape and its a bit like a box of chocolates as you can find your favorite filling by its unique shape. Wishing these guys well! What fun!","date":"2021-09-21 21:33:17"}
{"review_id":"ppsis_-KZ3ChmyNT_bqlWQ","user_id":"XmBm3C-Y7TKHuMoEMO5AtQ","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":12,"funny":5,"cool":11,"text":"After experiencing Buena Onda Empanadas at Old Town Coffee in Goleta, I just knew I had to go to their Mother Ship location on Haley Street. And so happy that we did. Also happy to support this amazing Latinx-owned business.\n\nTheir handcrafted Empanadas are incredibly delicious, and with so many different tastes available. I am a total carnivore and am loving their vegetarian\/vegan selections. \n\nThe fun part is that with every visit there is something new to taste, and you can never go wrong. Starting the day with their Buen Dia (breakfast empanada) is perfect. Then at lunch their Carne, Serrano, Hongos, and a new favorite the Hakuna Batata. Their special Combos is always a nice choice too. \n\nAnd of course no visit is complete without their desserts of either Tia Lupe Apple Pie and\/or Tarta de Coco.","date":"2021-10-05 03:28:43"}
{"review_id":"4Xr9UbUSAKHfC1wRKS58kQ","user_id":"maVDPs-P9P5veJdfMsxTqQ","business_id":"vyOVT4bcW227LRwJGHTeSw","stars":5.0,"useful":1,"funny":0,"cool":1,"text":"This place is underrated. And it had 5 stars at the time of this review. I had low expectations because they're \"just empanadas\". They have a deal for 6 empanadas (recommended for 2 ppl) and one for 12 (recommended for 4) but we honestly could have smashed 12 between the two of us. They were that good. Trust them on the specials guys. I wish I had ordered more of the vegan\/veggie ones because they were just as good if not better than the ones containing meat. I can't wait to come back.","date":"2018-06-15 19:18:39"}
